
## Command-Line Interface

### IOS Differences

### Interacting with IOS

### CLI Access Modes

For CLI interaction, four modes are supported:

* **User EXEC**
	* Provides basic access to IOS with limited command availability (basically simple monitoring and troubleshooting commands)
	* `IOS>`
* **Privileged EXEC**
	* Provides high-level management access to IOS, including all commands available at user EXEC mode
	* `IOS> enable` -> `IOS#`
	* `IOS# disable` -> `IOS>`
* **Global Configuration**
	* Enables configuration changes to be made to the device
* **ROM Monitor (ROMMON)**
	* Loads a bootstrap program that allows for low-level diagnostic teasing of an IOS device, performing the password recovery procedure, and performing an emergency upgrade

![[Pasted image 20251129171420.png]]

---

## IOS Basics

### Command Abbreviation and Completion

### Context-Sensitive Help

### Error Messages

### Entering Commands

### IOS Feature Example

---

## Basic IOS Configuration

### Accessing Configuration Mode

```
IOS# configure terminal
IOS(config)#
```

This mode is commonly referred to as configuration mode or Global Configuration mode.
In this mode, you can execute commands that change your router's or switch's configuration: however, you cannot actually view the changes from within this mode.

To exit configuration mode and return to privileged EXEC mode, either type `end` or press `CTRL-Z`

### Device Identification

One of your first tasks is to change the name of your IOS device. This name has only local significance and is used for management purposes.

You use the `hostname` command to change the name of the device.

```
Router(config)# hostname Perimeter
Perimeter(config)#
```

To change the hostname back to the factory default:

```
Perimeter(config)#no hostname Perimeter
Router(config)#
```

In certain cases, you don't have to include the parameters of the command when negating it.
In the preceding example, you could easily have typed in `no hostname` to accomplish the change, but in other cases, you must type in `no` and follow it with the entire configuration command.

### Subconfiguration Modes

### Line Configuration

Lines on IOS devices provide access to an EXEC shell; sometimes this is called *character mode access*, since it deals with CLI.

**IOS Line Types**

| Line Type | Desc                                                                                                                                                                                                                                                  | Command Nomenclature |
| --------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------- |
| Console   | Physical port that provides the initial CLI access                                                                                                                                                                                                    | line con 0           |
| Auxiliary | Backup physical port typically used for dialup into IOS device                                                                                                                                                                                        | line aux 0           |
| VTY       | Logical port that allows for remote access connections such as telnet and SSH to gain access to the CLI.                                                                                                                                              | line vty 0 4         |
| TTY       | Physical port used for connecting to a modem for a terminal service or for access to the console ports of other devices. These ports are found only on routers, and the number supported depends on the router model and asynchronous card installed. | line tty 0 31        |

#### Changing the Inactivity Timeout

By default, an IOS device automatically logs you off after 10 minutes of inactivity.
You can change this using the `exec-timeout`

```
IOS(config)#line LINE_TYPE LINE_#
IOS(config-line)# exec-timeout MINUTES SECONDS
```

If you don't want a particular line to time out ever, you can set the minutes and seconds values to 0.

```
IOS(config)#line con 0
IOS(config-line)#exec-timeout 0 0
```

If you want to disable of a line completely, use this configuration:

```
IOS(config)#line LINE_TYPE LINE_#
IOS(config-line)#no exec
```

To verify your line configuration, use the `show line` command.

#### Restricting VTY Protocol Access

By default, all methods of access are allowed for the VTYs, including telnet and SSH.

```
IOS(config)# line vty LINE_# [LINE_#]
IOs(config-line)# transport input {all | telnet | ssh}
IOs(config-line)# transport output {all | telnet | ssh}
```

#### CLI Output

One nice feature of an IOS device is that when certain types of events occur, such as an interface going down or up, an administrator making a configuration change, or an output of `debug` commands, the IOS device, by default, prints an information message on the console line. It won't however, display the same messages if you happen to have logged into the IOS device via telent or SSH or accessed the device via the auxilary or TTY lines.
If the latter is the case, you can have IOS display these messages on your screen by executing the privileged EXEC `terminal monitor` command.

One annoying problem with the information messages displayed on your CLI screen is that if you are typing in an IOS command, when the device displays the message, it starts printing it right where the cursor is, making it difficult to figure out where you left off typing.
If you remember, just keep typing your command, or press `CTRL-C` to abort the command. A better approach, though, is to set up IOS so that after the message prints in your window, IOS redisplays what you have already entered on a new CLI prompt.
The `logging synchronous` command accomplished this:

```
IOS(config)# line LINE_TYPE LINE_#
IOS(config-line)# logging synchronous
```

Notice that this command is executed under the line subconfiguration mode. If you want to implement this feature, you'll need to set it up under all the lines from which you'll be accessing your IOS device, including your VTYs and console port.

You can also press `CTRL-R` to refresh the screen.

### Interface Configuration

To configure an interface, you must first enter interface subconfiguration mode:

```
IOS(config)# interface TYPE [SLOT_#/]PORT_#
IOS(config-if)#
```

#### Assign IP Address

```
IOS>enable
IOS#conf t
IOS(config)#interface G0/0
IOS(config-if)#ip address 14.0.0.1 255.0.0.0
```

You can also configure the interface for a dynamic IP address:

```
IOS(config-if)#ip address dhcp
```

#### Enable and Disable the Interface

On switches, the interface are *enabled* by default; on Cisco routers, the interfaces are *disabled* by default.

You can disable interface with the `shutdown` command, to enable the interface use the `no shutdown` command.

```
### Disable interface
IOS(config-if)#shutdown

### enable interface
IOS(config-if)#no shutdown
```

#### Description

You can add a description to any interface by using the `description` command.

```
IOS(config-if)# description INTERFACE_DESC
```

This description appears in the output of the `show interfaces` command.

#### Speed and Duplexing for Ethernet Interfaces

To set the speed and duplexing speeds of Ethernet-based interface, use the following configuration:

```
IOS(config-if)# speed 10|100|1000|auto
IOS(config-if)# duplex full|half|auto
```

> For 10/100/1000 Ethernet ports, it is no longer recommended that you hard-code the speed and duplexing with the `speed` and `duplex` commands; instead, let the interface autosense these settings from the directly connected device.

#### Serial Interfaces on Routers

Things are a little different when configuring serial interfaces, because you need to configure not only an IP address, but you must specify a layer 2 protocol to use.

After the IP address is assigned to the serial interface, you can choose the layer 2 protocol you want to use to carry traffic across the serial link.
One the LAN, the layer 2 protocol is Ethernet, but that is not used on our serial lines. We need to specify what type of layer 2 frame we want to put the IP packet inside before sending data out the serial port.

Two main serial link protocols are used on Cisco routers:

* **HDLC**
	* This protocol is a Cisco proprietary protocol that is used to send data across a serial link.
	* It requires no configuration and is the default encapsulation protocol.
* **PPP**
	* Industry standard protocol
	* Should be used if you have a mix of Cisco devices and non-Cisco devices on the network.

```
IOS(config-if)#ip address 13.0.0.2 255.0.0.0
IOS(config-if)#encapsulation {hdlc | ppp}
```

One of the benefits of PPP is that you can configure authentication. To configure authentication with PPP:

* Set the hostname on each router
* Create a username and password on each routers that matches the name of the other router.
* Enable authentication with the authentication protocol of PAP or CHAP.
	* CHAP is preferred because PAP sends the username and password in clear text.

```
IOS#config t
IOS(config)#hostname VAN-R1
VAN-R1(config)#username LA-R1 password wanpass
VAN-R1(config)#interface s0
VAN-R1(config-if)#encapsulation ppp
VAN-R1(config-if)#ppp authentication chap
```

Now that we have configured the IP address and encapsulation protocol on the serial interface, all we need to do is make sure that the interface is receiving the clocking speed, or timing, of the link.
Setting the clocking speed is the responsibility of the data communications equipment (DCE).

When connecting the router to the ISP, the ISP is the DCE end of the link, and such the ISP sets the clocking speed of the link. In the ISP example, your router is the data terminal equipment (DTE), so you are not allowed to set the clock speed of the link.

If you are connecting two routers together over their serial ports with a back-to-back serial cable, one end of the cable is typically labeled "DCE" and the other end of the cable is labeled "DTE".
On the router that has the DCE end of the cable, you will need to set the clock rate with: `clock rate 64000`

The last command you configure on the serial interface is to enable the interface by using the `no shutdown` command.

If you are not sure which router has the DTE end of the calbe and which has the DCE end, you can determine this with the `show controllers` command.

### Ex 7-1: Basic Router Configuration

![[Pasted image 20251130123119.png]]

**VAN-R1**

```
R1#config t

### Set hostname
R1(config)#hostname VAN-R1

### check DCE
VAN-R1#show controllers S1/0
cable type : V.11 (X.21) DCE cable, received clockrate 64000

### Fast Ethernet (to switch) configuration
VAN-R1(config)#interface F0/0
VAN-R1(config-if)#ip addr 12.0.0.1 255.0.0.0
VAN-R1(config-if)#no shutdown

### Serial port (to router) configuration
VAN-R1(config-if)#interface S1/0
VAN-R1(config-if)#ip addr 13.0.0.1 255.0.0.0
VAN-R1(config-if)#no shutdown

### set clock rate (because this interface is DCE)
VAN-R1(config-if)#clock rate 64000

### Save configuration
VAN-R1#copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
[OK]
```

**LA-R1**

```
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### set hostname
R2(config)#hostname LA-R1

### cable type check (DCE or DTE)
LA-R1(config)#do show controllers S1/0
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

### Fast Ethernet interface configuration
LA-R1(config)#
LA-R1(config)#interface F0/0
LA-R1(config-if)#ip addr 14.0.0.1 255.0.0.0
LA-R1(config-if)#no shutdown

### Serial interface configuration
LA-R1(config-if)#interface S1/0
LA-R1(config-if)#ip addr 13.0.0.2 255.0.0.0
LA-R1(config-if)#no shutdown

### Save Configuration
LA-R1(config-if)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
[OK]
```

**test**

```
VAN-R1(config-if)#do ping 13.0.0.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/13/20 ms

LA-R1(config-if)#do ping 13.0.0.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/16/32 ms
```

**verify**

```
### brief
LA-R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            14.0.0.1        YES manual up                    up
Serial1/0                  13.0.0.2        YES manual up                    up
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
FastEthernet2/0            unassigned      YES unset  administratively down down
FastEthernet2/1            unassigned      YES unset  administratively down down
GigabitEthernet3/0         unassigned      YES unset  administratively down down

### F0/0
LA-R1#show interface F0/0
FastEthernet0/0 is up, line protocol is up
  Hardware is DEC21140, address is ca02.0398.0000 (bia ca02.0398.0000)
  Internet address is 14.0.0.1/8
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:00, output 00:00:02, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     526 packets input, 32177 bytes
     Received 470 broadcasts (0 IP multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog
     0 input packets with dribble condition detected
     102 packets output, 11513 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out

### S1/0
LA-R1#show interface S1/0
Serial1/0 is up, line protocol is up
  Hardware is M4T
  Internet address is 13.0.0.2/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:02, output 00:00:07, output hang never
  Last clearing of "show interface" counters 00:02:17
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     36 packets input, 3085 bytes, 0 no buffer
     Received 24 broadcasts (0 IP multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     27 packets output, 2262 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
     8 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     0 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
```

---

## Basic IOS Security Configuration

### Physical and Environmental Threats

* **Hardware**
	* Restricting physical access to the router via physical measures, such as locked doors, key cards, video cameras, and so on.
* **Electrical**
	* Ensuring that equipment is protected from power surges/spikes, brownouts, and loss of power.
* **Environmental**
	* Protecting equipment from temperatures that are too cold or too hot, or from too much humidity
* **Maintenance**
	* Ensuring that you follow electrostatic discharge procedures when handling sensitive electronic parts, have spares on hand for ciritical parts, and properly label equipment and cables.

### Passwords

The most common way of restricting physical access to IOS devices is to use some type of user authentication.

You can configure passwords to restrict access to the lines on IOS device (user EXEC mode) as well as access to privileged EXEC mode.

#### User EXEC Password Protection

Controlling access to user EXEC mode on an IOS device is accomplished on a line-by-line basis: console, auxiliary, TTYs, and VTYs.

To secure the console port, you must first go into the console's  line subconfiguration mode with the `line console 0` command to configure the line password:

```
IOS(config)# line console 0
IOS(config-line)# password CONSOLE_PASSWORD
IOS(config-line)# login
```

`login` is needed as an indication that you wnat the Cisco device to force people to authenticate using that password if they connect to the console 0 port.
Passwords on IOS devices are *case-sensitive*.

```
### AUX port
IOS(config)# line aux 0
IOS(config-line)# password AUX_PASSWORD
IOS(config-line)# login

### telnet password (and ssh)
IOS(config)# line vty 0 15
IOS(config-line)# password VTY_PASSWORD
IOS(config-line)# login
```

The `vty` parameter in this command refers to *virtual terminal*, a fancy name for telnet or SSH access.
Cisco devices support multiple simultaneous VTY sessions, where each connection is internally tracked by a number. Depending on the router model and IOS software version, this number may range from 5 on up to almost 1000. You could assign a different password to each VTY, but then you wouldn't know which password to use when telnetting into the IOS device.

#### Creating Usernames and Passwords

Other ways of validating access are available, such as a local username database or an external authentication server.

A local username database on the router enables you to specify both a username and a password to restrict access to the lines on an IOS device.

```
IOS(config)# username NAME {secret | password} PASSWORD
IOS(config)# line vty 0 15
IOS(config-line)# login local
```

The main difference between the `secret` and `password` parameters is that the `secret` parameter tells IOS to encrypt the password with an MD5 hash, and the `password` parameter doesn't (the password is stored in clear text).

> The `login local` command can be used on any of the lines on Cisco device to tell the device to perform authentication using the local username and password database.

#### Privileged EXEC Password Protection

```
IOS(config)# enable password PRIVILEGE_EXEC_PASS
IOS(config)# enable secret PRIVIEGE_EXEC_SECRET
```

#### Password Encryption

Passwords that are not encrypted can be encrypted by using the `service password-encryption` command.

However, the `enable secret` command's encryption is *much* stronger than using the `service password-encryption` command to do the encryption.

### Ex 7-2: Configuring Passwords

```
VAN-R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.

### Console password
VAN-R1(config)#line console 0
VAN-R1(config-line)#password conpass
VAN-R1(config-line)#login

### Auxilary password
VAN-R1(config-line)#line aux 0
VAN-R1(config-line)#password auxpass
VAN-R1(config-line)#login

### vty password
VAN-R1(config-line)#line vty 0 15
VAN-R1(config-line)#password vtypass
VAN-R1(config-line)#login

### save configuration
VAN-R1# copy running-config startup-config
```

### Configuring Banners

Banners provide a way for you to display messages to administrators when they connect to your Cisco device.

**common types of banners**

* **MOTD**
	* The message-of-the-day banner appears before the administrator is asked to log in and is used to display a temporary message that may change day to day
* **Login**
	* The login banner displays before the administrator logs in, but after the MOTD banner appers, and is used to display a more permanent message to the administrator
* **EXEC banner**
	* The exec banner is used to display a message after the administrator authenticates to the system and after he enters user EXEC mode.

#### MOTD Banner

Before the administrator is asked to log in to the device (before the console, aux, or VTY passwords).

```
IOS(config)# banner motd 'MY_MESSAGE'

IOS(config)# banner motd $
long
message
$
```

#### Login Banner

Before administrator logs in, but it appers *after* the MOTD banner text appears.

```
IOS(config)# banner login 'login banner'

IOS(config)# banner login $
long
login banner
$
```

#### Exec Banner

After the administrator has authenticated to the device with console or aux password, but before enters user EXEC mode.

```
IOS(config)# banner exec 'exec banner'

IOS(config)# banner exec $
long
exec banner
$
```

### Ex 7-3: Setting Banners

```
IOS(config)# banner motd
IOS(config)# banner login
IOS(config)# banner exec
```

---

## IOS Operation and Verification

### Show and Debug Command Overview

* **show**
	* Takes a snapshot of a particular process and displays information about it; the information displayed is static and will not refresh itself unless re-execute the command.
* **debug**
	* Displays how a particular process is currently operating, showing information as it basically happens, in real time.

#### Common Show Commands

* **`show ip interface brief`**
	* List of all interfaces on the device and offers a quick look at their statuses; indicates whether an interface is up and running and the IP address assigned to the interface.
* **`show interfaces`**
	* Lists all the interfaces and detailed specifications on the interfaces
* **`show interfaces g0/0`**
	* Lists of the details of a specific interface
* **`show controllers s0/3/0`**
	* Lists of information such as the DCE and DTE details on serial interfaces

### Running and Startup Configuration

* **running-config**
	* This file contains the actual configuraiton running in the RAM of an IOS device (the settings that the device is currently using).
* **startup-config**
	* This file contains the saved configuration settings in nonvolatile RAM (NVRAM) of a Cisco device and are applied at bootup.

IOS devices do not automatically save the configuration file from RAM to NVRAM; this must be done maually.

#### Viewing Configurations

```
VAN-R1#show running-config
Building configuration...

Current configuration : 1814 bytes
!
! Last configuration change at 14:52:49 UTC Sun Nov 30 2025
upgrade fpd auto
version 15.3
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname VAN-R1

....

end
```

#### Saving Your Changes

```
IOS# copy running-config startup-config
```

#### Reverting Your Configuration

```
IOS# copy startup-config running-config
```

### Device Version Information

```
VAN-R1#show version
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 15.3(3)XB12, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Tue 19-Nov-13 04:39 by prod_rel_team

ROM: ROMMON Emulation Microcode
BOOTLDR: 7200 Software (C7200-ADVENTERPRISEK9-M), Version 15.3(3)XB12, RELEASE SOFTWARE (fc2)

VAN-R1 uptime is 2 hours, 23 minutes
System returned to ROM by unknown reload cause - suspect boot_data[BOOT_COUNT] 0x0, BOOT_COUNT 0, BOOTDATA 19
System image file is "tftp://255.255.255.255/unknown"
Last reload reason: Unknown reason

 --More--
```

### Interface Information

#### Viewing Interface Information

```
IOS# show interfaces TYPE
```

If you don't specify a specific interface, the IOS device displays all of its interfaces.

#### Troubleshooting Interface Problems

One of the first things that you want to examine in this display is the status of the interface: `GigabitEthernet0/0 is up, line protocol is up (conntected)`.
The first **up** refers to the status of the physical layer, and the second **up** refers to the status of the data link layer.

**Possible values for the physical layer status:**
* **Up**
	* The device is sensing a physical layer signal on the interface.
* **Down**
	* The device is not sensing a physical layer signal on the interface, a condition that can arise if the attached device is turned off, no cable is attached, or the wrong type of cable is being used.
* **Administratively down**
	* Use the `shutdown` command to disable the interface.

**Possible values for the data link layer status:**
* **Up**
	* The data link layer is operational
* **Down**
	* The data link layer is not operational
	* Missed keepalived on a serial link, no clocking, an incorrect encapsulation type, or a disabled physical layer.

#### WAN Serial Loopback Test

A loopback test is a way to verify where the problem occurs with the WAN link.

Perform CSU/DSU loopback test to verify your T1 link or your 56K link. If that is successful, you can then verify connectivity from the CSU/DSU to the service provider by performing a telco-assisted loopback test with the service provider.

Two types of loopback testing can be performed on the CSU/DSU:
* **Software**
	* Use Cisco IOS commands to test functionality from the router to the CSU/DSU
* **Hardware**
	* Connect a loopback plug/cable to the CSU/DSU to perform the loopback test.

You can see hardware that exists in your device by using the `show inventory` command.

To perform the loopback test on interface, you need to enable loopback.

```
Router(config-if)#loopback {dte | line | remote}

dte:    loopback on the router side of the CSU/DSU
line:   loopback on the line side of the CSU/DSU
remote: loopback on the remote side of the CSU/DSU
```

To verify that loopback is enabled, use the `show interface` command. You should see the message "loopback is set" instead "loopback not set".

### Ex 7-4: Viewing Your Configuration

1. To view configuration of the interfaces and their status: `show ip interface brief`
2. To view status of the g0/0 interface including its IP address and whether it is functioning at layer 1 and layer 2, use the `show interfaces g0/0`
3. To view whether your serial port is a DCE or DTE device, use the `show controller s0/0` command.
	* If serial port is "DCE" you need to set clock rate on this interface
4. To view current configuration, use the `show running-config`.
5. To view the configuration of NVRAM, use the `show starup-config`.
6. Want to save the configuration changes, use the `write` command or `copy running-config startup-config` (recommended) command.

---

## Review

### Basic IOS Configuration

* `config t`: enter configuration mode
* `hostname`: change hostname
* `no shutdown`: enables an interface.
* `clock rate`: if device are DCE (you can check with `show controller` command), this command can used for change clock rate.

### Basic IOS Security Configuration

* Lines can be secured with the `enable password` or `enable secret` command.
* Clear text can be encrypted with the `service password-encryption` command.
* You can display banners with `banner` command.

---

## Questions

1.  A `rollover` cable is used to connect to the console port of your IOS device.

2.  Match the device modes with the appropriate command or task.

| Device Mode             | Command or Task     |
| ----------------------- | ------------------- |
| A. User EXEC            | enable              |
| B. Privileged EXEC      | show running-config |
| C. Global configuration | line vty 0 4        |
| D. ROMMON               | Password recovery   |

3. Which of the following enable you to use context-sensitive help? (Choose two.)

**A. help**
B. show
**C. ?**
D. verify

4.  Which control sequence takes you to the beginning of the CLI?

A. ctrl-e
**B. ctrl-a**
C. esc-b
D. ctrl-b

5.  Enter the IOS command that will change the device name to Perimeter: `hostname Perimeter`.

6.  Match the following commands to their description.

* `shutdown`: Disabled an interface
* `show controller`: Shows if an interface is DTC/DCE
* `login local`: Specifies the use of an IOS database for authentication
* `clock rate`: Specifies the speed of a serial interface

5.  You execute the line console 0 command from configuration mode. What will the router’s prompt be?

A. Router(config)#
**B. Router(config-line)#**
C. Router(config-interface)#
D. Router#(config-if)

8.  Enter the IOS command that will encrypt all unencrypted passwords: `service password-encryption`.

9.  Which IOS command would display a message of “This is Router5” after a user logs in?

A. banner motd $ : before login
B. login exec $
**C. banner exec $**
D. login motd $

10.  You examine your interfaces, and the GigabitEthernet 0/0 interface status says “GigabitEthernet 0 is up, line protocol is down.” What does this indicate?

A. A physical layer problem
**B. A data link layer problem**
C. A network layer problem
D. No problem

11.  What IOS command saves the active configuration to NVRAM?

A. copy nvram startup-config
B. copy startup-config running-config
C. copy running-config nvram
**D. copy running-config startup-config**

12. Using the following exhibit, draw a line from the description to the appropriate command for that description. Not all descriptions are used.

![[Pasted image 20251201115103.png]]

* `Router(config-line)# exec-timeout 5.0`
	* Configures the console to timeout after 5 minutes of inactivity
* `Router(config-line)# transport input ssh`
	* Restricts the VTY ports to accept only SSH traffic
* `Router(config-if)# ip address 14.0.0.1 255.0.0.0`
	* Manually assigns an IP address to an interface
* `Router(config-if)# ip address dhcp`
	* Configures the interface to receive an IP address from the DHCP server
* `Router(config-if)#clock rate 64000`
	* Configured on the DEC end of a point-to-point serial link

13. Using the following exhibit, write each of the commands found on the left at the top of the box that identifies the output for that command.

![[Pasted image 20251201115132.png]]

`VAN-R1#show controllers s0/3/0` `VAN-R1#show running-config`
`VAN-R1#show ip interface brief`
`VAN-R1#show interface g0/0`
