
## Router Configuration Files

Configuration file contains the commands used to configure an IOS device. Configuration files are typically located in one of three places: RAM (running-config), NVRAM, and/or external server.


### Saving Configuration Files

```
### Save configuration in flash drive
copy running-config flash:FILE_NAME
copy startup-config flash:FILE_NAME
```

This enables you to have multiple configuration file stored on your IOS device; by default, when booting up, your IOS device will use the startup-config file in NVRAM to load its configuration.

You can also back up your configuration to an external server.

```
IOS# copy running-config URL_location

### TFTP
copy running-config tftp://192.168.1.10/my_backup.txt

### If you don't supply the full URL:
copy running-config tftp
Address or name of remote host []? 192.168.1.10
Destination filename [router-config]? my_backup.txt
!!
781 bytes copied in 5.8 secs (156 bytes/sec)
IOS#
```

If the filename already exists on the server, the server *overwrites* the old file.

### Restoring Confiugration Files

```
IOS# copy LOCATION running-config
IOS# copy LOCATION startup-config

### If you only type protocol information
IOS# copy tftp startup-config
Address or name of remote host []? 192.168.1.10
Destination filename [router-config]? my_backup.txt
Accessing tftp://192.168.1.10/my_backup.txt...

### NVRAM to RAM
copy startup-config running-config

### restore from flash
copy flash:FILE_NAME running-config|startup-config
```

### Creating and Deleting Configuration Files

To create a basic configuraiton file, use `configure terminal` command.

If you want to delete configuration file, use `erase` command:
```
### delete configuration file in the startup-config file in NVRAM
IOS# erase startup-config
IOS# erase nvram
```

To verify, use the `show startup-config` command. If the startup-config was erased, you will get the following
```
IOS# show startup-config
%% Non-volatile configuration memory is not present
```

### Configuration File Nomemclature

**File locations**

| location  | desc                                                   |
| --------- | ------------------------------------------------------ |
| bootflash | Bootflash memory                                       |
| flash     | Flash memory on the motherboard                        |
| flh       | Flash load helper log files                            |
| ftp       | FTP server                                             |
| nvram     | Nonvolatile RAM                                        |
| rcp       | Remote Copy Protocol (RCP) server                      |
| scp       | Secure Copy (SCP) server - uses RCP through SSH tunnel |
| slot0     | PCMCIA slot 0                                          |
| slot1     | PCMCIA slot 1                                          |
| system    | RAM                                                    |
| tftp      | TFTP server                                            |

```
### back up router's configuration from RAM to NVRAM
IOS# copy system:running-config nvram:startup-config

### delete a file in flash
IOS# delete flash:FILE_NAME
```

### Review of Configuration Files

| From | To    | Command                            | IOS Process |
| ---- | ----- | ---------------------------------- | ----------- |
| RAM  | NVRAM | copy running-config startup-config | Overwrite   |
| RAM  | TFTP  | copy running-config tftp           | Overwrite   |
| CLI  | RAM   | configure terminal                 | Merge       |

Anything copied into RAM uses a merge process.

### Ex 8-1: Manipulating Your Router's Configuration Files

1. look configuration files
	* `show runnig-config`
	* `show startup-config`
2. Save the change to NVRAM
	* `copy running-config startup-config`
	* `copy system:running-config nvram:startup-config`

---

## Changes in Your Network

You should always do some preparation work *before* you make the changes.

### Adding Devices

1. Decide which IP address you'll assign to the device for management purposes.
2. Configure the ports of the device, including the console and virtual type terminal (VTY) ports.
3. Set up your passwords for User and Privileged EXEC access
4. Assign the appropriate IP addresses to the device's interface(s)
5. Create a basic configuration on the device so it can perform its job.

### Changing Devices

*Before* you make any changes to your network, you should *always* back up your configuration files.

---

## IOS Image Files

The default location of IOS images is in flash. On some IOS devices, flash is built into the motherboard, some use PCMCIA cards for storage, and some use a combination of both.

To view your files in flash, use the `show flash` command. You can also use the `dir` command to see how much flash memory is available on your deivce.

### Naming Conventions for IOS Images

*c1841-advipservicesk9-mz.124-6.T7.bin*

* c1841
	* Refers the name of the platform on which image will run.
* advipservicesk9
	* Refers to the features included in this IOS version, commonly referred to as the *feature set*.
	* In this example, IOS is the advanced IP services and k9 refers to the inclusion of encryption support
* mz or z
	* Means that the image is compressed and must be uncompressed before loading/runnig.
	* If you see *l* here, this indicates where the IOS image is run from. The *l* indicates that it is a relocatable image and that the image can be run from RAM.
	* Some images can run directly from flash, depending on the router model.
* 124-6.T7
	* Indicates the software version number of IOS.
	* Image filename with *T* indicate new features, and those without *T* indicate the mainline (only bug fixes are made to it)

### Before Upgrading the IOS Image

Before you upgrade the IOS on your device, you should first back up the existing image to an external server, for two reasons: First, your flash may not be large enough to support two images (the old one and the new). If you load the new one and you experience problems with it, you'll probably want to load the old image back onto your device.
Second, Cisco dosen't keep every software version available on its web site. Older versions of IOS are hard to locate.

you can back up your Cisco IOS (and configuration files) to a TFTP server or to an FTP server.
Although both are File Transfer Protocols, they do differ in their underlining use. TFTP uses UDP port 69 and dose not require authentication to connect to the TFTP server. FTP uses TCP port 21 (command) and TCP port 20 (data) and dose use authentication.

#### Verifying Server Information

Before you back up your IOS image to an external server, ask the following questions to determine whether you're ready to go:
* Is the server reachable (test with the ping command)
* Are you able to connect to the port? (TFTP: UDP 69, FTP: TCP 20, 21)
* Is there enough disk space on the server to hold the IOS image?
* Does the server support the file nomenclature that you want to use?

### Ex 8-2: Installing TFTP Software

https://wiki.gentoo.org/wiki/FTP

### Backing Up an IOS Image

#### Using a TFTP Server

```
copy flash tftp
Source filename []? c3640-js-mz.120-11

....
```

#### Using FTP

If you have an FTP server available, you can use that to back up your configuration files for your Cisco IOS.

```
### FTP username and password
R1(config)#ip ftp username ftpuser
R1(config)#ip ftp password ftppass
```

```
R1#copy running-config ftp:
```

> You can use the `dir flash` or the `show flash` command to display the contents of flash memory

#### Using USB Storage

```
R1# dir usbflash0:
R1# copy usbflash0:R1_config current-config
R1#copy flash:c2900-universalk9-mz.SPA.151-4.M4.bin usbflash:0:
```

### Upgrading an IOS Image

Before you upgrade IOS on your Cisco device, you first need to verify that your device meets the minimal hardware requirements (required ram, required flash).

You can see the amount of installed RAM and flash with the `show version` command. and see free flash memory with `show flash` or `dir` command.

After the router copies the IOS image to flash, you must reboot your router in order for it to use the new image. However, by default, the Cisco device loads the first valid IOS image in flash. TO use a different ont, you need to define this in your configuration with the `boot system` command and save this as part of the startup configuration file.

The `boot system` commands are processed in order in the startup configuration file, if there is one there that is no longer needed, you should revmoe it with the corresponding `no boot system` command, followed by the old IOS image name.

You can reboot your router in two ways: do a hard reboot by turning the router off and back on, or do a soft rebot by using the privileged EXEC `reload` command.

#### Using `tftpdnld`

You can use the `tftpdnld` command option to load an IOS onto a Cisco device if an IOS is missing or corrupt. This is used if an IOS is not booted and you have entered ROMMON mode.
To use `tftpdnld` you will need to have ROMMON loaded and you will need network connectivity to load an IOS via `tftpdnld`.

* It erases all files that exist in flash memory before downloading the IOS image specified
* The transfer happens over the first port on the device.

After booting to ROMMON mode, before you use the `tftpdnld` option, you must first configure a few of the environment variable that are used to perform the copy:

```
rommon 1> IP_ADDRESS=12.0.0.50
rommon 2> IP_SUBNET_MASK=255.0.0.0
rommon 3> DEFAULT_GATEWAY=12.0.0.1
rommon 4> TFTP_SERVER=12.0.0.100
rommon 5> TFTP_FILE=c2900-universalk9-mz.SPA.151-4.M4.bin
```

Once you have set the environment variables, you can then use the `tftdnld` command from ROMMON to start the IOS download from the TFTP server:

```
rommon 6> tftpdnld
```

After the download is complete, you will see a ROMMON prompt. You can then use the `reset` command to reboot the Cisco deivce.

#### Using `xmodem`

To use the ROMMON `tftpdnld` command, you must have network connectivity, but what if your Cisco device is not loading an IOS and does not have network connectivty? What you could do is boot to the ROMMON prompt and then use the `xmodem` command, which will copy the IOS from the computer connected to the console port to your Cisco device using the console port.

1. Boot your switch to ROMMON mode by unplugging the switch, holding down the mode button, and then plugging the power back into the switch.
2. If you are working on a Cisco switch, you may need to initialize flash memory by using the following command: `switch: flash_init`
3. Once flash memory has been initialized, you can copy from the computer (using Xmodem) to flash memory: `switch: copy xmodem: flash:c3750-ipbase-mz.122-35.SE5.bin`
4. After the transfer has completed you can test the loading of the new IOS by typing: `switch: boot flash:c3750-ipbase-mz.122-35.SE5.bin`

### Ex 8-3: Backing Up and Restoring Device

#### Backup & restore the running configuration to TFTP (12.0.0.100) server

```
### Backup
VAN-R1#copy running-config tftp://12.0.0.100/VAN-R1-config

### restore
VAN-R1#copy tftp://12.0.0.100/VAN-R1-config running-config
```

#### Backup & restore IOS

```
### check ios name
VAN-R1#show flash
System flash directory:
File Length Name/status
...  ...    c2900-universalk9-mz.SPA.151-4.M4.bin

### backup IOS
VAN-R1#copy flash:c2900-universalk9-mz.SPA.151-4.M4.bin tftp://12.0.0.100/c2900-universalk9-mz.SPA.151-4.M4.bin

### restore IOS
VAN-R1#copy tftp::/12.0.0.100/c2900-universalk9-mz.SPA.151-4.M4.bin flash:c2900-universalk9-mz.SPA.151-4.M4.bin
```

---

## Remote Access to Your Cisco Device

### SSH vs. Telnet Access

Telent sent all information in clear text, SSH uses RSA an encruption alorgithm to encrypt any data sent between you and your networking device.

### Telnet Configuration

#### Configuring Telnet

Before you can remote connect to the router using telnet, you need to ensure that an IP address is assigned to the device.
On a Cisco router, this will be an IP address on the interface, but for a Cisco switch, you will assign an IP address to the management VLAN (typically VLAN 1).
Note that if you are going to telnet into a switch from another network, you will need to set the default gateway setting on the switch so that the switch can send data off the network.

After configuring an IP address, you'll then configure VTY passwords and a password (or secret value) to enter privileged EXEC mode.

```
### privileged exec password
VAN-R1(config)#enable password routerpass

### privileged exec secret (if secret is set, this value will used)
VAN-R1(config)#enable secret routersecret

### Configure password on VTY ports
VAN-R1(config)#line VTY 0 15
VAN-R1(config-line)#password telnetpass
VAN-R1(config-line)#login
```

#### Using Telnet

To open up a telnet session from your IOS device, you can use:

```
IOS# name_of_the_destination | destination_IP_ADDR
IOS# telnet name_of_the_destination | destination_IP_ADDR
IOS# connect name_of_the_destination | destination_IP_ADDR
```

All three of these methods work in the same manner.

#### Suspending Telnet Sessions

If you are using an IOS device and telnet to a remote destination, you may want to go back to your IOS device. One way of doing this is to exit the remote device; however, you may just want to go back to your source Cisco device, make a quick adjustment, and then return to the remote device.

In this instance, you can *suspend* a telnet session, return to your original router or switch, do what you need to do, and then jump right back into your remote device.
To suspend a telnet session, press `CTRL-SHIFT-6, x` (hold down the `CTRL`, `SHIFT`, and 6 keys simultaneously, let go, and then press the x key).

To resume a specific session, use `resume connection_#` you can see connection_# with `show sessions` command.
To terminate a suspended telnet sessions without having to resume and then logout of the telnet session you can use `disconnect connection_#`.

#### Verifying and Clearing Connecitons

If you are logged into an IOS device, you can view other users who are also logged in with `show users` command.

```
Router# show users
  Line       User    Host(s)  Idle  Location
  0    con 0                  idle
  2    vty 0         idle        0  10.1.1.1
* 3    vty 1         idle        0  10.1.1.2
```

The asterisk in the first column indicates the current session.

If you want to terminate someone's session, use the `clear line` command:
```
Router# clear line LINE_#
```

### Ex 8-4: Configuring Telnet on the Cisco Device

* Configure VAN-R1 router so that you can telnet into it and perform remote administration.

```
### privileged secret
VAN-R1(config)#enable secret ciscosecret

### Configure VTY line passwords
VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#password telnetpass
VAN-R1(config-line)#login

### SUSPEND
CTRL-SHIFT-6, x

### check other sessions
VAN-R1#show sessions

### resume
VAN-R1#resume 1
```

### SSH Configuration

To set up SSH on your Cisco device so that you can use an SSH client to access it, you'll need to configure the following:

* **A local username and password**
	* `Router(config)# username my_user password my_pass`
	* `Router(config-line)# login local`
	* SSH requires both a username and password configured on the device
* **A hostname and a domain name**
	* `Router(config)# hostname my_hostname`
	* `Router(config)# ip domain-name`
	* Hostname and domain name are required to label the RSA key pair on the IOS device
* **The SSH version to use**
	* `Router(config)#ip ssh version`
	* The defualt version is 1, but the recommended version to use is 2
* **RSA public and private keys**
	* `Router(config)#crypto key generate rsa`
	* You will need to generate the encryption keys.
* **Restricting VTY access**
	* `Router(config-line)#transport input ssh`
	* Ensure that remote access can be achieved only through SSH and not telnet.

```
Router(config)# username user secret mypassword
Router(config)# hostname R1
R1(config)# ip domain-name somedomain.com
R1(config)# ip ssh version 2
R1(config)# crypto key generate rsa
R1(config)# line vty 0 15
R1(config-line)# login local
R1(config-line)# transport input ssh
```

---

## Configuration Registers and Password Recovery

### Configuration Registers

The *configuration register* setting is used by the bootstrap program to determine the location from which the IOS image and configuration file should be loaded.

The configuration register is a 16-bit field that is stored in NVRAM and can be modified to control how your device boots.

![[Pasted image 20251202235206.png]]

The 16 bits are divided into four, 4-bit blocks, with each 4-bit chunk known as a *nibble*.

Turning on one of the bits in the configuraiton registers is a method to enable a feature during bootup.

| Bit Number | Explanation                                          |
| ---------- | ---------------------------------------------------- |
| 0-3        | Known as the boot fields                             |
| 6          | Ignore the contents of NVRAM                         |
| 7          | Disable the display of boot messages                 |
| 8          | Break is disabled                                    |
| 10         | IP broadcast with all zeros                          |
| 13         | Loads the default ROM software if network boot fails |

#### Boot Fields

The first 4-bit nibble on the right side is known as the *boot field*, which controls how the Cisco device boots up. If the boot field equals a specific decimal value, then the bootup of the device happens a specific way.

* **0**
	* If the boot field equals 0 (no bits enabled, 0000), the Cisco device will boot to ROMMON mode.
	* To boot to ROMMON mode, the configuration register value would be 2100(0010 0001 0000 0000).
* **1**
	* If the boot field has a decimal value of 1 (0001), the device boots to a Mini IOS that is located on ROM and known as RXBOOT.
	* The configuraiton register in this case would be set to 2101 (0010 0001 0000 0001)
* **2 to F**
	* Having the boot field set to a value from 2 to F indicates the IOS image that should be loaded from flash memory.
	* To boot an IOS image from flash memory, the configuraiton register would have a value 2012 through 210F.

#### Looking at the Configuration Register Value

Once the router is booted up, you can view the current configuration register value with the `show version` command:

```
Router>show version

...

Configuration regiser is 0x2102

...
```

#### Changing the Configuration Register from Configuraiton Mode

You can change the configuration register value from configuration mode or from ROMMON mode.

```
Router(config)# config-register 0xHEX_VALUE
```

The register value is four hexadecimal digits, or 16 bits, in length. Each bit poisition in the register, though, indicates a function that the bootstrap program should take.

When entering the register value, you must *always* prcede it with *0x*, indicating that this is a hexadecimal value. If you don't do this, the router assumes the value is decimal and *converts* it to hexadecimal.

### Changing the Configuration Register from ROM Monitor

One problem with the configuration mode method of changing the register value is that you must gain access to Privileged EXEC mode first.

A second method, though, enables you to change the register value without having to log into the router. To use this method, you'll need console access to the router (you can't do this from the auxilary line or from a VTY session).
Next, you'll turn off the router and then turn it back on. As the router starts booting, you'll break into ROMMON mode with the router's break sequence (most cases, use the `CTRL-BREAK`).

Once you're in ROMMON mode, you can begin the process of changing the register value using one of two methods, depending on the router model that you have. Cisco devices typically use the `confreg` command to modify the configuration register from ROMMON.

```
rommon 4 > confreg 0x2142
```

```
### confreg script mode
rommon 5 > confreg
    Configuration Summary
enabled are:
load rom after netboot fails
console baud: 9600
boot: image specified by the boot system commands
      or default to: cisco2-C3600
      
do you wish to change the configuration? y/n  [n]: y

....

rommon 6 >
```

### Password Recovery

The passwords are stored in your startup configuration, which is stored in NVRAM. To bypass the password you need to modify the configuration registers so that your device boots without loading the startup configuration (ignore NVRAM).

To configure your Cisco device to ignore NVRAM, you will need to enable bit 6, which has a value of 4, resulting in the configuration register value of 0x2142 instead of default 0x2102.

Following are the steps to recover the password on your Cisco device:

1. Use the `show version` command to view the current configuration register value.
2. When you power on the Cisco router, press `CTRL-BREAK` to distrupt the boot process and go into ROMMON mode. You shoule see the `rommon >` prompt
3. Use `confreg` command to skip startup config when booting: `rommon>confreg 0x2142`
4. Reboot the router with the `reset` command
5. When the router reboots, it will not load the startup configuraiton and ask if you want to use the System Configuration dialog. Type *no* and press `enter`.
6. Atthe `router>` prompt, enter the `enable` command to get into privileged EXEC mode.
7. Use the `copy startup-config running-config` command to copy the startup configuration that was not read during bootup to be your current configuration. This is so you do not lose any settings.
8. View the configuration with the `show running-config`.
9. Change the password by using the `enable password` or `enable secret` command. You can also remote the password by using the `no enable password` or `no enable secret`.
10. Copy that from your current configuraiton to your startup configuration by using the `copy running-config startup-config` command
11. Use the `config-register 0x2102` command to change the configuration registers back to the default value of 0x2102 so that NVRAM is readu during bootup.
12. Reboot the router with the `reboot` command.

### Ex 8-5: Using the Password Recovery Procedure

```
### check current configuration (see register value)
Router# show version

### go into rommon, change register value to 2142
rommon>confreg 0x2142

### reboot the router
rommon>reset

### get preivous configuration
Router>enable
Router#copy startup-config running-config

### remove password
Router#conf t
Router(config)# no enable password
Router(config)# no enable secret

### change register value to default (0x2102) value
Router#config-register 0x2012

### save changes
Router#copy running-config startup-config
```

---

## Troubleshooting and Debugging

| layer | Command            |
| ----- | ------------------ |
| 2     | show ip arp        |
| 2     | show interfaces    |
| 2     | show cdp neighbors |
| 3     | ping               |
| 3     | traceroute         |
| 7     | telnet             |
| 2-7   | debug              |

### Local ARP Table

Address Resolution Protocol (ARP) is used to resolve layer 3 IP addresses to layer 2 MAC addresses.
When a LAN device in a subnet needs to access resources beyond the subnet, it must forward its frames to the MAC address of the default gateway (router) and use ARP for the resolution.
The router builds a local ARP table when it receives traffic on an interface, keeping track of the IP-to-MAC address mappings. You can view the mappings using the `show arp` or `show ip arp` command:

```
IOS#show ip arp
Protocol  Address    Age (min)  Hardware Addr   Type  Interface
Internet  10.0.6.2           -  0007.0e46.4070  ARPA  FastEthernet0/0
Internet  172.30.6.2         -  0007.0e46.4071  ARPA  FastEthernet0/1
Internet  172.30.6.7         0  0040.5480.7e01  ARPA  FastEthernet0/1
```

A dash (-) in the (min) column means the address is local to the router; a time value indicates that the router learned the IP/MAC addressing mapping dynamically.
If a particular MAC address isn't shown for a period of time, it is aged out of the ARP table. Likewise, when a frame matches an existing entry in the table, its aging time is reset to 0 in the table.
The type column denotes the Ethernet encapsulation type (ARPA, SNAP, or SAP) used in the frame: TCP/IP uses ARPA for Ethernet.

### Cisco Discovery Protocol (CDP)

CDP is a Cisco proprietary data link layer protocol that was made available in version 10.3 of the router IOS. Many but not all, Cisco devices support CDP. For those devices that support CDP, it is enabled by default, are not forwarded to any other devices behind it. In other words, you can see CDP information about *only* other Cisco devices directly connected to your deivce.

#### CDP Information

CDP, works at the data link layer. However, since CDP uses a Subnetwork Access Protocol (SNAP) frame type, not every data link layer media type is supported. The media types that are supported are Ethernet, Token Ring, Fiber Distributed Data Interface (FDDI), Point-to-Point Protocol (PPP), High-Level Data Link Control (HDLC), Asynchronous Transfer Mode (ATM), and Frame Relay.

The information shared in a CDP packet about a Cisco device includes the following:
* Name of the device configured with `hostname`
* IOS software version
* Hardware capabilities, such as routing, switching, and/or bridging
* Hardware platform of your device
* The layer 3 address(es) of the device
* The interface on which the CDP update was generated

#### CDP Configuration

CDP is enabled on all Cisco CDP-capable devices. On Cisco routers and switches, you can globally disable or enable CDP with:
```
IOS(config)# [no] cdp run
```

You can also enable or disable CDP on an interface-by-interface basis:

```
IOS(config)# interface TYPE
IOS(config-if)# [no] cdp enable
```

#### CDP Status

To see status of CDP:

```
IOS# show cdp

or 

### see the CDP configuration on an interface-by-interface basis
IOS# show cdp interface
```

#### CDP Neighbors

To see a summarized list of the CDP neighbors to which your Cisco device is connected, use the `show cdp neighbors` command.

```
IOS# show cdp neighbors

Device ID    Local Intrfce  Holdtime  Capability  Platform  Port ID
Router-A     Eth 0/0        176       R           2621      Fas 0/1
```

In this example, one device is connected with a device ID of *Router-A*, which is 2621 router. If you see a MAC address for the device ID, this indicates that the connected Cisco device wasn't assigned a name with the `hostname` command.
This update was received on ethernet0/0 on this device 4 seconds ago (hold-down time of 176 seconds subtracted from the hold-down time of 180 seconds).
The Port ID refers to the port at the remote side from which the device advertised the CDP message.

You can add the optional `detail` parameter to the preceding command to see the details concerning the connected Cisco device. You can also use the `show cdp entry *` command.
IOS devices support one additional CDP command, which enables you to view CDP traffic status: `show cdp traffic`

### Using LLDP

One of the drawbacks of CDP is that it is a Cisco proprietary protocol. If you had a mixed environemt of Cisco devices and non-Cisco devices, CDP would not be able to dicover the non-Cisco devices for you.

The IEEE has created an industry-standard protocol for device discovery, the Link Layer Discover Protocol (LLDP), which is known as the IEEE 802.1ab standard.

With LLDP running on your Cisco devices, you can use it to discover any other devices running LLDP, much like CDP. LLDP is not enabled on Cisco devices by default, but it can enabled with `lldp run` command.

Once enabled, LLDP is enabled for all interfaces. You can disable LLDP with the `no lldp run` command. If you wanted to disable LLDP on a specific interface, you can navigate to the interface and disable transmitting and receiving of LLDP on the interface:

```
Router(config-if)#no lldp transmit
Router(config-if)#no lldp receive
```

You can enable LLDP communication on the interface by using the `lldp transmit` command and the `lldp receive` command.

You can verify that LLDP is running on your Cisco device by using the `show lldp` command.

### Layer 3 Connectivity Testing

CDP can be very useful in determining whether the data link layer is working correctly with another directly connected Cisco device, or it is commonly used to create a network map by discovering the different devices on the network. You can even see the layer 3 address(es) configured on your neighboring device and use this for testing layer 3 connectivity.

You could also use the `show interfaces` command for data link layer testing.

#### Using Ping

Ping (Packet Internet Groper) is a command utility that you can use to verify layer 3 connectivity on a Cisco device.

Ping uses ICMP as the status reporting protocol to identify whether or not a system is up and running.

**Ping messages**
* **Destination host unreachable**
	* The router connected to the remote host cannot contact that host on the connected segment
* **Destination network unreachable**
	* A router between the source and destination doesn't have a routing table entry that determines how to reach the destination

When using the `ping` command to perform the communication test, if the destination is reachable, the destination responds with an echo reply message for each echo sent by the source.

If the destination is not reachable, an intermediate router, if it exists, will respond with a destination network unreachable message, indicating where the problem begins.

If a router is connected to the remote segment where the destination hots is connected, and that router can't reach the destination host, this will cause a "destination host unreachable" message.

#### Simple `ping` Command

`IOS> ping DEST_IP_ADDR_OR_HOST_NAME`

```
IOS> ping 192.168.1.10
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.10,
    timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5),
    round-trip min/avg/max = 2/5/6 ms.
```

**Output codes for the `ping`**

| Output | Exp                                                                                                            |
| ------ | -------------------------------------------------------------------------------------------------------------- |
| .      | A response was not received before the timeout period expired                                                  |
| !      | A response was received within the timeout period                                                              |
| U      | A remote router responded that the destination is unreachable (network segment is reachable, but not the host) |
| N      | A remote router reponded that the network is unreachable (network cannot be found)                             |
| P      | A remote device reponded that the protocol is not supported.                                                   |
| Q      | The source quench tells the source to slow its output                                                          |
| M      | The ping packet needed to be fragmented, but a remote router couldn't perform fragmentation                    |
| A      | The ping packet was filtered by a device with an access control list (administratively prohibited).            |
| ?      | The ping packet type is not understood by a remote device                                                      |
| &      | The ping exceeded the maximum number of hops supported by the routing protocol                                 |

#### Extended `ping` Command

```
Router# ping
  Protocol [ip]:
  Target IP address: 192.168.1.10
  Repeat count [5]:
  Datagram size [100]:
  Timeout in seconds [2]:
  Extended commands [n]: y
  Source address:
  Type of service [0]:
  Set DF bit in IP header? [no]:
  Data pattern [0xABCD]:
  Loose, Strict, Record, Timestamp, Verbose[none]:
  Number of hops [9]:
  Loose, Strict, Record, Timestamp, Verbose[RV]:
  Sweep range of sizes [n]:
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.10,
    timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5),
    round-trip min/avg/max = 2/5/6 ms.
```

* **Protocol**
	* The protocol to use for the ping (defaults to IP).
* **Target IP address**
	* The IP address or hostname of the destination to test
* **Repeat count**
	* How many echo requests should be generated for the test (defaults to 5).
* **Datagram size**
	* The size, in bytes, of the ping packet (defaults to 100).
* **Timeout in seconds**
	* The amount of time to wait before indicating a timeout for the echo (defaults to 2 seconds).
	* When seeing a mix of periods and explanation points (!) in the displayed output, increasing this value can help determine whether you are experiencing congestion problems with a slow response time between your IOS device and the destination.
* **Extended commands**
	* Whether or not the remaining questions should also be asked (defaults to no).
* **Source address**
	* The IP address that should appear as the source address in the IP header (defaults to the IP address of the interface the ping will use to exit the IOS device).
* **Type of service**
	* The IP level for QoS (defaults to 0).
* **Set DF bit in IP header?**
	* Whether or not the ping can be fragmented when it reaches a segment that supports a smaller MTU size (the default is no).
	* Sometimes a misconfigured MTU can cause performance problems. You can use this parameter to pinpoint the problem, since a device with a smaller MTU size will not be able to handle the larger packet.
* **Data pattern**
	* The data pattern that is placed in the ping.
	* It is a hexadecimal four-digit (16-bit) number (default to 0xABCD) and is used to solve cable problems and crosstalk on cables.
* **Loose, Strict, Record, Timestamp, Verbose**
	* IP header options (defaults to none of these).
	* The record parameter records the router that the ping took (this is somewhat similar to traceroute). If you choose reocord, you will be asked for the maximum number of hops that are allowed to be recorded by the ping (defaults to 9, and can range from 1 to 9).
* **Sweep range of sizes**
	* Send pings that vary in size.
	* This is helpful when trying to troubleshoot a problem related to a segment that has a small MTU size (and you don't know what that number is). This defaults to no.

#### Using `traceroute`

One limitation of `ping` is that it will not tell you where, between you and the destination, layer 3 connectivity is broken.

The `traceroute` command, on the other hand, will list each router along the way, including the final destination. Therefore, if a layer 3 connection problem exists, `traceroute` will tell you at least where the problem begins.

Like `ping` command, `traceroute` has two versions: one for use EXEC mode and one for privileged EXEC mode.

#### Simple `traceroute` Commmand

`Router> traceroute DEST_IP_OR_HOST_NAME`

```
Router> traceroute 65.32.13.33
Type escape sequence to abort.
Tracing the route to 65.32.13.33
  1 10.98.240.1 20 msec 24 msec 16 msec
  2 65.32.15.254 16 msec 16 msec 12 msec
  3 65.32.13.33 12 msec 12 msec 12 msec
```

In this example, the destination was three hops away, each hop is listed on a separate line. For each destination, three tests are performed, where the rount-trip time is displayed for each test.

If you don't see a rount-trip time, typically indicated by an astrisk, this indicates a possible problem or timeout in the reponse.

**Other values may shown instead of the round trip time**

| Output | Exp                                                                                                                                                  |
| ------ | ---------------------------------------------------------------------------------------------------------------------------------------------------- |
| *      | Either the wait time expired while wating for a response or the device did not repond at all potentially because of a firewall blocking ICMP traffic |
| A      | The trace packet was filtered by a remote device (administratively prohibited).                                                                      |
| U      | The pot of the device is unreachable (the destination received the trace packet but discard it).                                                     |
| H      | The destination is unreachable (the destination segment was reachable, but not the host).                                                            |
| I      | The user interrupted the traceroute process                                                                                                          |
| N      | The network is unreachable (the destination segment was not reachable)                                                                               |
| p      | The protocol is unreachable (the device doesn't support traceroute)                                                                                  |
| Q      | The source quench tells the source to slow its output                                                                                                |
| T      | The trace packet exceeded the configured timeout value                                                                                               |
| ?      | The device couldn't identify the specific trace types in the trace packet.                                                                           |

In certain cases, for a specific destination, you might see three astrisks in the output. It can occur for a variety of reasons: for instance, there may be an inconsistency in how the source and destination devices have implemented traceroute, or the destination may be configured not to reply to these messages.
However, if you continually find the same destination repeated in the output with these reply messages, this indicates layer 3 problem with either this device or the device preceding it.

#### Extended `traceroute`

```
Router# traceroute
Protocol [ip]:
Target IP address: 65.32.13.33
Source Address:
Numeric display [n]:
Timeout in seconds [3]:
Probe count [3]:
Minimum Time to Live [1]:
Maximum Time to Live [30]:
Port number [33434]:
Loose, Strict, Record, Timestamp, Verbose [none]:
Type escape sequence to abort.
Tracing the route to 65.32.13.33
  1 10.98.240.1 20 msec 24 msec 16 msec
  2 65.32.15.254 16 msec 16 msec 12 msec
  3 65.32.13.33 12 msec 12 msec 12 msec
```

Some of these options are the same ones used by `ping`.

* **Numeric display**
	* Turns off a DNS lookup for the names of the routers and the destination
* **Time to Live**
	* Specifies how many hops the trace is allowed to take
* **Loose**
	* Tells the router the hops you specify must appear in the trace path, but other routers can appear as well
* **Strict**
	* Restricts the trace path only to those routers that you specify
* **Record**
	* Specifies the number of hops to leave room for in the trace packet
* **Timestamp**
	* Enables you to specify the amount of space to leave room for in the trace packet for timing information
* **Verbose**
	* Automatically selected whenever you choose any of the options from this question; prints the entire contents of the trace packet

One important item to point out about the `traceroute` command is that if more than one path exists to reach the destination, this command will test `each` path, which can take the trace process longer.
And like the extended `ping` command, instead of using the script to perform the test, you can enter the command and all of its parameters on a single command line.

### Layer 7 Connectivity Testing

The `ping` and `traceroute` commands can test only layer 3 connectivity. If you can reach a destination with either of these two commands, this indicates that layer 3 and below are functioning correctly.

You can use other tools, such as `telnet`, to test the application layer. If you can telnet to a destination, then all seven layers of the OSI model are functioning correctly.

### Debug Overview

One problem with using `show` commands is that they display only what is currently stored somewhere in the router's RAM, and this display is static.

The `debug` commands can display detailed troubleshooting information. For example, perhaps you want the router to tell you when a particular even occurs and display some of the packet contents of that event. However, Since the router has to examine and display many different things when this feature is enabled, the performance of IOS will suffer.

Typically, you will use `debug` commands for detailed troubleshooting. For instance, you may have tried using `show` commands to discover the cause of a particular problem, but without any success. You should then turn to using a particular debug command to uncover the source of the problem.

Once you've fixed your problem or no longer need to see the `debug` output, you should always disable the `debug` process.

```
IOS# no debug all

or

IOS# undebug all
```

If you want to see timestamps displayed in your debug output, enter the following command:

```
Router(config)# service timestamps debug datetime msec
```

The `datetime` parameter displays the current date and time, and the `msec` parameter displays an additional timing parameter: milliseconds.

### Ex 8-6: Using the Router's Troubleshooting Tools


---

## Licensing Cisco Devices

Cisco now has only four image types:

* IP Base
* Data (MPLS and ATM)
* Unified Commnuications (VoIP and IP telephony)
* Security (firewall, IPS, and VPNs)

You can use the `show license feature` command to view the technology package licenses and the feature licenses supported by your router.

Licensing is enforced starting with Cisco ISR G2 routers. Licensing unlock features in IOS code. Licenses come in two types:

* **Evaluation**
	* Temporary license
* **Permanent**
	* Valid for the life of the product

Licenses are associated with two values from a Cisco ISR G2 router, referred to as a universal device identifier (UDI):
* Product ID (platform type)
* Serial number (located in ROM on the motherboard)

You can take a license from one router and copy it to another router: the license is tied to the UDI value of your router.
Use the `show license udi` to see UDI information.

### Installing Licenses

```
Router# license install URL_LOCATION
```

The license file is an XML file that you download from Cisco. Typically use would place this in flash on the router, but you could pull it from a remote server.

Once you've installed a license, it is not used until the router is rebooted. You can execute the `reload` command to reboot the router.

### Licensing Verification

`show version`, you can also use the `show license` command.

### Managing Licenses

To back up a license, use the `license save` command.

```
Router# license save URL

or

Router# license save flash:/licenses.lic
```

To uninstall (remote) a license from a router, you need to perform two actions:

1. Disable the technology package.
2. Clear the license

To disable the technology package, use the `license boot module` command.

```
Router(config)# license boot module c3900 technology-package uck9 disable
Router(config)# exit
Router# copy running-config startup-config
Router# reload
```

Once the router has rebooted, you need to clear the license with the `license clear` command.

```
Router# license clear uck9
```

Use the `show version` or `show license` command to verify.

---

## Review

---

## Questions

1.  Which router commands perform an overwrite process? (Choose
two.)

**A. copy running-config startup-config**
B. copy startup-config running-config: merge
C. copy tftp running-config: merge
**D. copy running-config tftp**

write to ram performs merge process

2.  Enter the router command to delete your configuration file in
NVRAM: `erase startup-config`

3.  You have executed the show startup-config command and see the following message: `%%Non-volatile configuration memory is not present.` Which of the following answers are correct about these two things? (Choose two.)

A. This command displays the running configuration in NVRAM.
**B. This command displays the saved configuration in NVRAM.**
C. This command displays the saved configuration in flash.
D. The message indicates that flash needs to be reformatted.
E. This message indicates that NVRAM needs to be reformatted.
**F. This message indicates that there is nothing stored in this memory location.**

4.  When backing up your IOS image from flash, which of the following will the copy flash tftp command prompt you for? (Choose three.)

**A. TFTP server IP address**
B. Verification to copy
**C. Source filename**
**D. Destination filename**

5.  What IOS command will display the version of software your device is running?

A. show startup-config
B. show flash
**C. show version**
D. dir and show version

6.  Enter the IOS configuration on the first five VTYs to allow only SSH access and to prompt for both a username and password for line authentication:

```
Router#username my_user password my_pass

Router(config)#line vty 0 4
Router(config-line)#login local
Router(config-line)#transport input ssh
```

7.  Enter the IOS command that will create RSA public and private keys to encrypt and decrypt traffic for an SSH session: `crypto key generate rsa`.

8.  Which of the following is true of CDP?

A. The show cdp neighbor command displays what version of software the neighbor is running.
B. The no cdp run command disables CDP on an interface.
C. CDP sends out broadcasts every 60 seconds.
**D. CDP can be used to validate layer 2 connectivity.**

9.  Which router command would you use to test only layer 3 connectivity?

A. telnet: layer 7
B. show cdp traffic
C. show interfaces
**D. traceroute**

10.  How would you suspend a telnet session?

A. ctrl-shift-x, 6
**B. ctrl-shift-6, x**
C. ctrl-alt-ins
D. ctrl-c

11.  What IOS command is used to verify the installed licenses on a Cisco router?

A. show installed-licenses
B. show flash:licenses
C. license view
**D. show version**

and `show licenses`

12.  What command was used to generate the following output?

![[Pasted image 20251209014933.png]]

A. Show cdp neighbor detail
B. Show interfaces
**C. show cdp neighbor**
D. show ip interface brief

13.  What command was used to generate the following output?

![[Pasted image 20251209015001.png]]

**A. Show cdp neighbor detail**
B. Show interfaces
C. show cdp neighbor
D. show ip interface brief

14.  As the network administrator for your company you need to create a network diagram containing all of the network devices that include Cisco devices, Juniper devices, and devices from other vendors. What command would you use on your Cisco devices?

A. cdp run
**B. lldp run**
C. show cdp neighbor
D. cdp enable

15. You have configured an extended access list with the following rules:
![[Pasted image 20251209015101.png]]

Using the following exhibit, identify which packets would be denied and which packets would be permitted by writing the packet information in the boxes on the right.

* **TFTP**
	* UDP based
	* Port 69
	* Authentication not supported
	* permit
* **FTP**
	* TCP based
	* Ports 21 and 20
	* Support authentication
	* permit

16. Draw a line from the command on the left side to the appropriate description on the right side. Not all descriptions are used.

![[Pasted image 20251209015232.png]]

* `copy tftp running-config`
	* Restore a configureation to the device
* `copy running-config tftp`
	* Back up current config to a server
* `copy tftp flash`
	* Restore the IOS to the device
* `copy flash tftp`
	* Back up the IOS to a server
* `copy running-config startup-config`
	* Save current changes to NVRAM
