
## Understanding Switch Features

Unlike a router, a switch, by default, doesn't require that you apply configuration settings. There are, however, a number of features that you can configure on the switch that enable you to tweak how the switch operates and to use advanced features that are not configured by default.

### Switch Functions

#### Address Learning/MAC Learning

When a switch receives a frame, it reads the source MAC address in the frame and compares it to a local MAC address table, called a *MAC address table* or *content addressable memory (CAM) table*.
If the address is not already in this table, the switch adds the address and the port number on which the frame was received.
If the address is already in the CAM table, the switch compares the incoming port with the port already in the table. If the two are different, the switch updates the CAM table with the new port information.

The CAM table can be built statically or dynamically.

#### Filtering and Forwarding

*frame filtering* or filtering and forwarding, where the switch forwards traffic intelligently.
To do this, the switch uses the CAM table to help it find where destinations are located. When a frame is received on a port, the switch examines the destination MAC address in the frame header and looks for a corresponding entry in the MAC address table.
If the switch finds a matching entry, it forwards the frame out of the specified port. If the port is the same port on which the frame was received, the switch drops the frame.
If the switch doesn't find the entry in the CAM table, the switch *floods* the frame out all of the remaining ports.

> *frame flooding*: If a switch does not know where to send a frame, it will flood the frame to all ports.
> The difference between frame flooding and a broadcast is that the flooded frame has a specific destination MAC address in the header of the frame, whereas a frame being broadcast has a destination MAC address of FF:FF:FF:FF:FF:FF.

#### Loop Avoidance

Cisco switches use STP, a loop prevention protocol that places one of the ports causing the loop in a blocking state.
If a port is in a blocking state, it cannot send or receive any data until it is placed back in a forwarding state.
STP will automatically detect when the other link goes down and will change the state to forwarding on the link that was originally blocked.

### Ex 9-1: Verifying the Loop Avoidance Feature

### Operation Modes

#### Store-and-Forward Switching

*Store-and-forward* switching is the most basic form of switching. With store-and-forward swithing, the layer 2 device must receive the entire frame into the buffer of the inbound port and will check the frame for errors (for FCS checksum field on the frame) before the switch will perform any addtional processing of the frame.

When checking the FCS, commonly called a *cyclic redundancy check (CRC)*, the switch will calculate a CRC value, just as the source device did, and compares this value to what was included in the FCS of the frame. If they are the same, the frame is considered good, and the switch can forward the frame out the correct destination port of the switch. If the FCS value in the frame and computed CRC value are different, the switch will drop the frame.

#### Cut-Through Switching

With cut-through switching, the switch only waits to read the destination MAC address before it begins forwarding the frame.

#### Fragment-Free Switching (modified cut-through, runtless switching)

Whereas cut-though switching reads up to the destination MAC address field in the frame before making a switching decision, fragment-free switching makes sure that the frame is at least 64 bytes long before switching it (64 bytes is the minimum leagal size of an Ethernet frame).

---

## Identifing Switch Components

### Chassis and Physical Ports

### LEDs and Display Modes

---

## Basic Switch Configuration

### Initial Configuration Dialog

If no configuration has occurred before the switch boots up, the IOS will run the setup script, commonly called the initial configuration dialog.

### Basic Settings

#### Naming the Device

```
Switch(config)#hostname VAN-SW1
```

#### Assigning an IP Address

Switches work a bit differently from routers in the sense that you do not assign IP addresses to the ports of the switch. The devices that are connected to the ports, such as computers or IP phones, have their IP addresses assigned.
To assign IP address to a switch, you first navigate to a special VLAN interface and then assign the IP to the VLAN of the switch.

```
VAN-SW1(config)#interface vlan1
VAN-SW1(config-if)#ip address 12.0.0.2 255.0.0.0
VAN-SW1(config-if)#no shutdown
```

##### Setting Up a Default Gateway

If you want to administer the switch from a different network, you must configure a default gateway so that the switch knows how to send data off the network.

```
VAN-SW1(config)#ip default gateway 12.0.0.1
```

### Ex 9-2: Configuring a Switch

```
### change hostname
IOS(config)#hostname VAN-SW1

### assign ip address
IOS(config)#interface vlan1
IOS(config-if)#ip address 12.0.0.2 255.0.0.0
IOS(config-if)#no shutdown

### assign default gateway
IOS(config)#ip default gateway 12.0.0.1

### verify
IOS#show interface vlan1
```

### MAC Address Table

You can view the MAC address table by using the `show mac address-table` command.

```
VAN-SW1#show mac address-table
```

To clear dynamically learned entries from the CAM table, use the `clear mac address-table` command.

### Static MAC Addresses

You can manually create static entries. The benefit of static entries is that they are part of your switch configuration, so they are retained even if the switch is rebooted (whereas dynamic entries are lost after a reboot and must be learned again).

To add a static entry in the MAC address table, use the following syntax:
```
Switch(config)# mac address-table static MAC_ADDR
						vlan VLAN_#
						interface TYPE
Switch(config)# mac address-table 0000.1111.2222 vlan 1 int g1/0/8
```

### Ex 9-3: Working with the MAC Address Table

To view CAM table: `show mac address-table`
To add static address: `mac address-table 0000.1111.2222 vlan 1 interface g1/0/8`

---

## Interface Configuration

### Configuring Ports

#### Adding a Port Description

```
VAN-SW1(config-if)#description UpLink Port
```

Once you have added a description to a port, you will see that label when you view the status of the interface with the `show interface TYPE` command.

#### Configuring Switch Speed

The switch will detect the speed of the device that is connected to it and run the port at that speed.

```
### check interface speed
VAN(config-if)#speed ?
  10    Force 10 Mbps operation
  100   Force 100 Mbps operation
  1000  Force 1000 Mbps operation
  auto  Enable AUTO speed configuration
VAN-SW1(config-if)#speed 1000

### or interface range
VAN-SW1(config)#interface range g1/0/1 - 24
VAN-SW1(config-if-range)#speed 1000
```

#### Configuring Duplex Setting

```
### check duplex options
VAN-SW1(config-if)#duplex ?
  auto  Enable AUTO duplex configuration
  full  Force full duplex operation
  half  Force half duplex operation
  
### set duplex full
VAN-SW1(config-if)#duplex full
```

#### Enabling and Disabling Ports

```
### Disable single port (interface)
VAN-SW1(config-if)#shutdown

### Enable single port (interface)
VAN-SW1(config-if)#no shutdown

### Disable multiple ports (interfaces)
VAN-SW1(config)#interface range g1/0/1 - 2
VAN-SW1(config-if-range)#shutdown

### enable multiple ports (interfaces)
VAN-SW1(config)#interface range g1/0/1 - 2
VAN-SW1(config-if-range)#no shutdown
```

#### Verifying Port Settings

```
### see every interfaces
VAN-SW1#show interfaces

### see every interfaces with brief
VAN-SW1#show ip interface brief

## see single interface
VAN-SW1#show interfaces g1/0
```

### Ex 9-4: Configuring Interfaces on a Switch

### Understanding Port Security

*Port security* is a switch feature that enables you to lock down switch ports based on the MAC address associated with the interface; this prevents unauthorized access to a LAN.

The port security feature will not work on trunk ports, Switch Port Analyzer (SPAN) ports, and EtherChannel ports. However, it is compatible with 802.1X and voice VLANs.

#### Port Security Configuration

```
### places the interface in access mode
switch(config-if)#switchport mode access

### enables port security
switch(config-if)#switchport port-security

### specifies the maximum number of devices that can be associated with the interface
# defaults to 1, and can range from 1 to 132
switch(config-if)# switchport port-security maximum VALUE

### Specifies what should occur if a security violation occurs
switch(config-if)# switchport port-security violation
					protect|restrict|shutdown

### specifies the exact MAC address
switch(config-if)#switchport port-security mac-address MAC_ADDR
```

**Violation options**
* **Protect**
	* This command sends an alert to the administrator when an unauthorized device is connected to the port.
* **Restrict**
	* Results in the port being able to forward frames for the authorized device only.
	* If an unauthorized device connects to the port, the switch will drop those frames.
* **Shutdown**
	* The port is diabled the second an authorized device connects to the port. The port is disabled until the administrator issues the `no shutdown` comand.
	* Default violation mode.

#### Sticky Learning

```
Switch(config-if)#switchport port-security mac-address sticky
```

When you use the `sticky` option, the switch will dynamicaly learn the MAC address of the system already connected to the port and then configure the port security feature using that MAC address.

#### Port Security Verification

To check which ports you have configured port security on and also view the security action and violation count, use the `show port-security` command.

```
Switch#show port-security
Secure Port MaxSecureAddr CurrentAddr SecurityViolation Security Action
-----------------------------------------------------------------------
  Gig1/0/4        1           1               0           shutdown
-----------------------------------------------------------------------
```

To see the MAC addresses that are statically defined or dynamically learned with port security, use the `show port-security address` command:

```
Switch#show port-security address
			Secure Mac Address Table
--------------------------------------------------------------------------
Vlan  Mac Address      Type              Ports        Remaining Age (mins)
----  -----------      ----              -----        --------------------
1     CCCC.CCCC.3333   SecureConfigured  GE1/0/4              -
--------------------------------------------------------------------------
Total Addresses in System (exculding one mac per port)      : 0
Max Addresses limit in System (excluding one mac per port)  : 1024
```

If you want to see a bit more port security detail on a specific port, use the `show port-security interface TYPE` command.

```
Switch#show port-security interface g1/0/4
```

### Ex 9-5: Configuring Port Security on a Cisco Switch

```
#### configure port security
VAN-SW1(config)#interface g1/0/5
VAN-SW1(config-if)#switchport mode access
VAN-SW1(config-if)#switchport port-security
VAN-SW1(config-if)#switchport port-security maximum 1
VAN-SW1(config-if)#switchport port-security violation shutdown
VAN-SW1(config-if)#switchport port-security mac-address cccc.cccc.3333
VAN-SW1(config-if)#no shutdown

#### verify
VAN-SW1#show port-security
VAN-SW1#show port-security address
VAN-SW1#show port-security interface g1/0/5
```

---

## Working with VLANs

A *virtual LAN (VLAN)* is a logical grouping of network devices in the same broadcast domain that can span across multiple switches.

**Single VLAN**
![[Pasted image 20251214135816.png]]

**Multiple VLAN**
![[Pasted image 20251214135834.png]]

Switches are used to create VLANs, or separate broadcast domains.

VLANs are not restricted to any physical boundary in the switched network, assuming that all the devices are interconnected via switches and that there are no intervening layer 3 devices.
For example, a VLAN could be spread across multiple switches, or it could be contained in the same switch.

### Subnets and VLANs

Logically speacking, VLANs are also subnets. A subnet, or a network, is a contained broadcast domain. A broadcast that occurs in one subnet will not be forwarded, by default, to another subnet.

### Scalability

Through segmentation of broadcast domains, VLANs increase your network's scaleability. Because VLANs are a logical construct, a user can be located anywhere in the switched network and still belong to the same broadcast domain.

### VLANs and Traffic Types

Many network administrators use VLANs not only to separate different types of user traffic (commonly separated by job function), but also to separate based on the type of traffic, placing network management, multicast, and voice over IP (VoIP) traffic into their own distinctive VLANs.

### VLAN membership

A device's membership in a VLAN can be determined by one of three methods: static, dynamic, or voice.

With static VLANs, you must manually assign a port on a switch to a VLAN using an *interface subconfiguration* mode command. VLANs configured in this way are typically called *port-based* VLANs.

With dynamic VLANs, the switch automatically assigns the port to a VLAN using information from the user device, such as its MAC address, IP address, or even directory information (a user or group name, for instance). The switch then consults a policy server, called a VLAN membership policy server (VMPS), which is proprietray to Cisco and contains a mapping of device information to VLANs. One of the switches in your network must be configured as this server.
Another options is to use 802.1X authentication, which is used to authenticate a device's access to a switch or wireless access point.

Voice VLANs are unique. They are associated to ports that have VoIP phones attached. Some VoIP phones may have a multiport switch attached to them to enable other devices to connect to the switch via the phone.

---

## VLAN Connections

When dealing with VLANs, switches support two types of switch ports: access ports and trunk ports.

### Access Ports

An *access port* provides a connection to a device that has a standardized Ethernet NIC that understands only standardized Ethernet frames. In other words, a normal NIC that understands IEEE 802.3 and Ethernet II frames.

Access port connections can be associated only with a single VLAN (VoIP VLAN ports are an exception to this). This means that any device or devices connected to this port will be in the same broadcast domain.

For example, if ten users are conntected to a hub, and you plug the hub into an access port interface on a switch, then all of these users will belong to the same VLAN that is associated with the switch port. If you wanted five users on the hub to belong to one VLAN and the other five to a different VLAN, you would need to purchase an additional hub and plug each hub into a different switch port. Then, on the switch, you would need to configure each of these ports with the correct VLAN identifier.

### Trunk Ports for Interswitch Connectivity

Unlike access ports, *trunk ports* are capable of carring traffic for multiple VLANs and are configured on ports that are connecting to other switches.

To support trunking, the original Ethernet frame must be modified to carry VLAN information, commonly called a *VLAN identifier* or number.

For instance, if a device from VLAN 1 has generated a broadcast and the connected switch has received it, when this switch forwards it to other switches, these switches need to know the VLAN origin so that they can forward this frame out only VLAN 1 ports and not other VLAN ports.

Cisco supports two Ethernet trunking methods:
* Cisco's proprietary InterSwitch Link (ISL) protocol for Ethernet
* IEEE 802.1Q, commonly referred to as *dot1q* for Ethernet

#### Trunk Tagging

Trunking methods create the illusion that instead of a single physical connection between the two trunking devices, a seprate logical connection exists for each VLAN between them.
When trunking, the switch adds the source port's VLAN identifier to the frame so that the device (typically a switch) at the other end of the trunk understands what VLAN origintated this frame and the destination switch can make intelligent forwarding decisions on not just the destination MAC address, but also the source VLAN identifier.

Since information is added to the original Ethernet frame, normal NICs will not understand this information and will typically drop the frame. Therefore, you need to ensure that when you set up a trunk connection on a switch's interface, the device at the other end also supports the same trunking protocol and has it configured.

The modification of these frames, commonly called *tagging*, is done in hardware by application-specific integrated circuits (ASICs). ASICs are specialized processors. Since the tagging is done in hardware at faster than wire speeds, no latency is involved in the actual tagging process.
And to ensure compatibility with access port devices, switches will strip off the tagging information and forward the original Ethernet frame to the device or devices connected to access port connections.

#### Trunk-Capable Devices

Trunk links are common between certain types of devices, including switch-to-switch, switch-to-router, and switch-to-file server connections. Using a trunk link on a router is a great way of reducing your layer 3 infrastructure costs.

You can use a single port on a router to route between your multiple broadcast domains. You need a router and an interface that support trunking. Not every router supports trunking. If your router doesn't support trunking, you would need a separate router interface for each VLAN you created to reoute between the VLANs.

You can also purchase specialized NICs for PCs or servers, such as file servers or virtualization servers, that support trunking. For instance, suppose you want multiple VLANs to access a file server. You could use a normal NIC and set it up with an access port connection to a switch. Because this is an access port connection, the server could belong only to one VLAN. The users in the same VLAN, when accessing the server, would have all their traffic switched via layer 2 devices to reach it. Users in other VLANs, however, would require that their traffic be routed to this server via a router, since the file server is in a different broadcast domain.

If throughput is a big concern, you may want to buy a trunk NIC for the file server. Configuring this NIC is different from configuring a normal NIC on a file server.

### Configuring Trunks

### Creating VLANs

### Basic Troubleshooting of VLANs and Trunks

### Ex 9-6: Configuring VLANs

---

## Review

---

## Questions

