
## Command-Line Interface

How you access IOS CLI on a Cisco device for the first time depends on the kind of device you are configuring.

In most every case, you will use the console interface initially to interact with the device; however, gaining access to the CLI from the console port can be different from one device to another.

On a Cisco router, for instance, you are taken directly to IOS CLI when you log in from the console port.
If IOS cannot find a configuration file for the router or switch, IOS takes you through Setup mode (via the System Configuration Dialog), which is a basic configuration script that prompts you for information about how you want to configure your IOS device.

Once you have configured your Cisco device via the console port, you can then use other methods of accessing and changing its configuration, such as telnet or SSH Cisco calls this *virtual type terminal* (VTY) access.
Or you can use Trivial File Transfer Protocol (TFTP), File Transport Protocol (FTP), Simple Netowkr Management Protocol (SNMP), or a web-based solution (Cisco Configuration Professional, or CCP, for routers).

A variety of Cisco management products can be used to configure and manage your Cisco devcice, such as the Cisco Security Manager (CSM);

### IOS Differences

Even though both Cisco routers and switches run IOS, the commands used by products are frequently different.
However, how you access IOS and maneuver around IOS access levels, as well as how you use many of the management commands, is the same on *all* IOS products.
This can be confusing to a Cisco novide one command for a particular feature is the same on all Cisco products, but configuring another feature is different between a Cisco router and a Catalyst switch.

In addtion to command differences betwen different products, such as routers and switches, command differences may exist within a product line, such as Cisco routers, for instance. For example, Cisco sells different flavors of its IOS software fo routers, depending on the features that you need. Because of hardware differences, some commands work on some routers but not on others.

### Interacting with IOS

The CLI is a character- or text-based interface.

To interact with the CLI, you simply need to type in commands, just as you would do when typing an essay in a text editor or a message in an e-mail program.
You can even use functions such as copy-and-paste with IOS CLI: so, for example, you can copy the complete configuration from a router using a terminal emulator's copy function, paste this into a text editor, make changes to the configuration, select and copy the new configuration, and then paste all of these commands back into the CLI.

The CLi supports a command parser. Whenever you press the `ENTER` key, IOS parses the command and parameters that you entered and checks for correct syntax and options.

When you paste multiple commands into the CLI, IOS still performs this process for each command that is included in the paste function.
If you make a mistake with one command, the CLI parser will display an error message, but it will continue with the next command in the pasted list.

> Before making any configuration changes on your IOS device, you should first back it up.

### CLI Access Modes

For CLI interaction, four modes are supported:

* **User EXEC**
	* Provides basic access to IOS with limited command availability (simple monitoring and troubleshooting commands)
* **Privileged EXEC**
	* Provides high-level management access to IOS, including all commands available at user EXEC mode
* **Global Configuration**
	* Enables configuration changes to be made to the device
* **ROM Monitor (ROMMON)**
	* Loads a bootstrap program that allows for low-level diagnosic testing of an IOS device, performing the password recovery procedure, and performing an emergency upgrade

Of the four modes, the first three apply to IOS. While in ROMMON mode, IOS has not loaded and therefore packets are not moved between interfaces of the device.

Both EXEC modes can be password-protected, enabling you to limit who can access your device to perform management, configuration, and troubleshooting tasks.

#### User EXEC Mode

Has only a limited number of IOS commands you can execute.
Depnding on the Cisco device's configuration, you may be prompted for a password to access this mode.

User EXEC mode is typically used for basic troubleshooting of networking problems. You can tell you are in user EXEC mode by examining the prompt on the left side of the screen:
```
IOS>
```

If you see a `>` character of the end of the line, you know you are in user EXEC mode.
The information preceding the `>` is the name of the Cisco device.

For instance, the default name of all Cisco routers is *Router*, whereas the 2960 switch's user EXEC prompt looks like this: `Switch>`.
These device names can be changed with the `hostname` command.

```
### Change hostname

R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#hostname IOS
IOS(config)#exit
IOS#
*Oct  9 12:16:12.574: %SYS-5-CONFIG_I: Configured from console by console
IOS#
```

#### Privileged EXEC Mode

Once you have gained access to user EXEC mode, you can use the `enable` command to access privileged EXEC mode:

```
IOS>enable
Password:
IOS#
```

Once you enter the `enable` command, if a privileged EXEC password has been configured on the Cisco device, you will be prompted to enter it.

Upon successfully authenticating, you will be in privileged EXEC mode. You can tell that you are in this mode by examining the CLI prompt.

When you are in privileged EXEC mode, you have access to all of the user EXEC commands as well as many more advanced management and troubleshooting commands.

To return to User EXEC mode from privileged EXEC mode, use the `disable` command:
```
IOS#disable
IOS>
```

**Summary of how to navigate through the different modes**
![[Pasted image 20251009122224.png]]

#### Loggin Out of Your device

```
IOS# logout

OR

IOS# exit
```

---

## IOS Basics

### Command Abbreviation and Completion

The CLI of IOS enables yout to avvreviate commands and parameters to their most unique charcters.

As an example, you could type `en` instead `enable` when you want to go from user EXEC mode to privileged EXEC mode.

The Cisco device, internally, completes the command for you.
Howevery, the characters that you enter must make the command unique.
As an example, you couldn't type just the letter `e` for `enable`, since other commands being with the letter `e`, such as `exit`.

### Context-Sensitive Help

Context-sensitive help is supported at all modes within IOS, including user EXEC, privileged EXEC, and configuration modes.

You can use this feature in a variety of ways. If you are not sure what command you need to execute, at the prompt, type either `help` or `?`.
The Cisco device then displays a list of commands that can be executed at the level in which you are currently located, along with a brief description of each command.

```
IOS#?
Exec commands:
  access-enable    Create a temporary Access-List entry
  access-profile   Apply user-profile to interface
  access-template  Create a temporary Access-List entry
  alps             ALPS exec commands
  archive          manage archive files
  audio-prompt     load ivr prompt
  auto             Exec level Automation
  beep             Blocks Extensible Exchange Protocol commands
  bfe              For manual emergency modes setting
  calendar         Manage the hardware calendar
  call             Voice call
  call-home        Call-Home commands
  cd               Change current directory
  clear            Reset functions
  clock            Manage the system clock
  cns              CNS agents
  configure        Enter configuration mode
  connect          Open a terminal connection
  copy             Copy from one file to another
  crypto           Encryption related commands.
  debug            Debugging functions (see also 'undebug')
  delete           Delete a file
  dir              List files on a filesystem
  disable          Turn off privileged commands
  disconnect       Disconnect an existing network connection
  emm              Run a configured Menu System
  enable           Turn on privileged commands
  eou              EAPoUDP
  ephone-hunt      ephone hunt exec command
  erase            Erase a filesystem
  ethernet         Ethernet parameters
  event            Event related commands
  exit             Exit from the EXEC
  file-acct        File mode accounting exec command
  flush            File mode accounting flush options
  format           Format a filesystem
  fsck             Fsck a filesystem
  help             Description of the interactive help system
  hw-module        Slot level commands
  if-mgr           IF-MGR operations
  isdn             Run an ISDN EXEC command on an ISDN interface
  lat              Open a lat connection
  lock             Lock the terminal
  login            Log in as a particular user
  logout           Exit from the EXEC
  microcode        microcode commands
  mkdir            Create new directory
  monitor          Monitoring different system events
  more             Display the contents of a file
  mpls             MPLS commands
  mrinfo           Request neighbor and version information from a multicast
                   router
  mrm              IP Multicast Routing Monitor Test
  mstat            Show statistics after multiple multicast traceroutes
  mtrace           Trace reverse multicast path from destination to source
  name-connection  Name an existing network connection
  ncia             Start/Stop NCIA Server
  no               Disable debugging functions
  pad              Open a X.29 PAD connection
  partition        Partition disk
  ping             Send echo messages
  ppp              Start IETF Point-to-Point Protocol (PPP)
  pwd              Display current working directory
  redundancy       Redundancy Facility (RF) exec commands
  release          Release a resource
  reload           Halt and perform a cold restart
  rename           Rename a file
  renew            Renew a resource
  restart          Restart Connection
  resume           Resume an active network connection
  rlogin           Open an rlogin connection
  rmdir            Remove existing directory
  rsh              Execute a remote command
  sdlc             Send SDLC test frames
  send             Send a message to other tty lines
  set              Set system parameter (not config)
  setup            Run the SETUP command facility
  show             Show running system information
  slip             Start Serial-line IP (SLIP)
  spec-file        format spec file commands
  squeeze          Squeeze a filesystem
  ssh              Open a secure shell client connection
  start-chat       Start a chat-script on a line
  systat           Display information about terminal lines
  tarp             TARP (Target ID Resolution Protocol) commands
  tclquit          Quit Tool Command Language shell
  tclsafe          Tool Command Language shell SAFE mode
  tclsh            Tool Command Language shell
  tdm              TDM
  telnet           Open a telnet connection
  terminal         Set terminal line parameters
  test             Test subsystems, memory, and interfaces
  tn3270           Open a tn3270 connection
  traceroute       Trace route to destination
  tunnel           Open a tunnel connection
  udptn            Open an udptn connection
  undebug          Disable debugging functions (see also 'debug')
  undelete         Undelete a file
  upgrade          Upgrade commands
  verify           Verify a file
  voice            Voice Commands
  webvpn           WebVPN exec command
  where            List active connections
  which-route      Do OSI route table lookup and display results
  write            Write running configuration to memory, network, or terminal
  x28              Become an X.28 PAD
  x3               Set X.3 parameters on PAD
  xconnect         Xconnect EXEC commands
```

For more detaild help, you can follow a command or parameter with a space and a `?`.
This causes the CLI to list the available options or paramters that are included for the command.

```
IOS#erase ?
  /all                       Erase all files(in NVRAM)
  /no-squeeze-reserve-space  Do not reserve space for squeeze operation
  nvram:                     Filesystem to be erased
  pram:                      Filesystem to be erased
  startup-config             Erase contents of configuration memory

IOS#erase
```

If you're not sure how to spell a command, you can enter the first few characters and immediately follow these characters with a `?`.

```
IOS#e?
emm    enable    eou    ephone-hunt
erase  ethernet  event  exit

IOS#e
```

### Error Messages

Errors inevitably creep in when you enter commands.
If you mistype a command, IOS will tell you that it has encountered a problem after it tries to execute the command.

```
% Invalid input detected at '^'
```

You should examine the line between the command that you typed in and the error message.
Somewhere in this line, you'll see a & character. This is used by IOS to indicate that an error exists in the command line at that spot.

```
% Incomplete command.
```

This error indicates that you have not entered all the necessary parameters for the command.
The syntax of the command is correct, but more parameters are necessary.
In this case use the the context-sensitive help feature to help you figure out what parameter or parameters you forgot.

You'll see an error message similar to the following if you do not type in enough characters to make a command or parameter unique:

```
% Ambiguous command: "show i"
```

In this example, apparently, more than one parameter for the `show` command begins with the letter `i`.
Again, you can use context-sensitive help to figure out what parameter to use:

```
IOS#show i?
idb        if-mgr  ima   interfaces
inventory  ip      ipc   iphc-profile
ipv6       ipx     isis

IOS#show i
```

If you enter a command that IOS does not understand, you'll see this error message:

```
% Unknown command or computer name, or unable to find computer address
```

If you see this, use the context-sensitive help to figure out the correct command to enter.

### Entering Commands

Four key features included in IOS relate to entering commands:

* Symbolic translation
* Command prompting
* Syntax checking
* Command recall

Whenever you enter a command in the CLI, the command-line parser dissects the command, making sure that it is a valid command with valid parameters.

In the case of Cisco IOS, if the CLI parser cannot find the actual command, IOS assumes that you are trying to telnet to a machine by that name and attempts a DNS reolution of the name to an IP address.
This process, called *symbolic traslation*, can be annoying at times. But it does make telnetting to a remote machine easier, since you have to type only the name or IP address of the machine instead of using the `telnet` command.

```
### Disable DNS lookup
IOS(config)#no ip domain-lookup
IOS(config)#exit
IOS#
*Oct  9 14:29:47.481: %SYS-5-CONFIG_I: Configured from console by console
IOS#
```

You have already been presented with the *command prompting feature* this is most commonly seen when using the context-sensitive help.

The CLI always parses your commands and checks their validity by using the *syntax checking* feature.
Any nonexists commands or improperly entered commands cause IOS to generate an error message with an appropriate error description.

#### Command-Line History

On any IOS device, you can use the `show history` comand to see your previously entered commands.

By default, an IOS device stores the last 10 commands that you executed.
You can recall these commands by pressing either `CTRL-P` or the `UP-ARROW` key.

If you accidentally go past the command that you want to edit or re-execute, press `CTRL-N` or the `DOWN-ARROW` key.

You can increase the size of the history buffer from 10 commands up to 256 by using `terminal history size` command

```
IOS#terminal history size ?
  <0-256>  Size of history buffer
```

#### Editing the Command Line

**Control or Command sequences you can use to edit information on the command line**

| Seq                   | Desc                                                                                               |
| --------------------- | -------------------------------------------------------------------------------------------------- |
| CTRL-A                | Moves the cursor to the begining of the line                                                       |
| CTRL-E                | Moves the cursor to the end of the line                                                            |
| ESC-B                 | Moves the cursor back one word at a time                                                           |
| ESC-F                 | Moves the cursor forward one word at a time                                                        |
| CTRL-B or LEFT-ARROW  | Moves the cursor back one character at a time                                                      |
| CTRL-F or RIGHT-ARROW | Moves the cursor forward one character at a time                                                   |
| CTRL-P or UP-ARROW    | Recalls the last command                                                                           |
| CTRP-N or DOWN-ARROW  | Recalls the most recently executed command                                                         |
| CTRL-D                | Deletes the character the cursor is under                                                          |
| Backspace             | Deletes the character preceding the cursor                                                         |
| CTRL-R                | Redisplays the current line                                                                        |
| CTRL-U                | Erases the line completely                                                                         |
| CTRL-W                | Erases the word the cursor is under                                                                |
| CTRL-Z                | Takes you from configuration mode back to privileged EXEC mode                                     |
| TAB                   | IOS device completes the word                                                                      |
| $                     | At the begining of a command line, this indicates that there are more characters to the right of $ |

### IOS Feature Example

```
IOS#cl?
clear  clock

IOS#clock ?
  read-calendar    Read the hardware calendar into the clock
  set              Set the time and date
  update-calendar  Update the hardware calendar from the clock

IOS#clock set ?
  hh:mm:ss  Current Time

IOS#clock set 15:00:00 ?
  <1-31>  Day of the month
  MONTH   Month of the year

IOS#clock set 15:00:00 May ?
  <1-31>  Day of the month

IOS#clock set 15:00:00 May 23 ?
  <1993-2035>  Year

IOS#clock set 15:00:00 May 23 2025 ?
  <cr>

IOS#clock set 15:00:00 May 23 2025
IOS#

IOS#show clock
15:00:41.555 UTC Fri May 23 2025
IOS#
```

---

## Basic IOS Configuration

Many of the configuration commands are the same on the Cisco routers and switches, simplifying a basic setup of these devices; however, certain features are specific to each product type, and thus each product has unique configuration commands.

### Accessing Configuration Mode

```
IOS# configure terminal
IOS(config)#
```

All system/operating changes in IOS must occur within configuration mode.

Notice that the prompt changed from # to (config)#, indicating the change in modes. This mode is commonly referred to as configuration mode or Global Configuration mode.

In configuration mode, you can execute caommdns that change your router's or switche's configuration; however, you cannot actually view the changes from within thie mode, as this is done from privileged EXEC mode.

To exit configuration mode and return to privileged EXEC mode, either type `end` or press `CTRL-Z`.

### Device Identification

One of your first tasks is to change the name of your IOS device.
This name has only local significance and is used for management purposes.

For instance, the Cisco Discovery Protocol (CDP) uses the device name.
On both routers and switches, you use the `hostname` command to change the name of the device.

```
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#hostname IOS
IOS(config)#exit
IOS#
*Oct  9 12:16:12.574: %SYS-5-CONFIG_I: Configured from console by console
IOS#
```

To undo changes or negate a command on a Cisco device, you can precede the command with the `no` parameter.

```
IOS(config)#no hostname IOS
Router(config)#
```

In certain cases, you don't have to include the parameters of the command when negating it.

### Subconfiguration Modes

Certain configuration commands on IOS device take you into a specific subconfiguration mode, commanly referred to as *subcommand mode*.

| Prompt               | Subconfiguration Mode                     |
| -------------------- | ----------------------------------------- |
| (config-if)#         | Interface subconfiguration mode           |
| (config-subif)#      | Subinterface subconfiguraiton mode        |
| (config-line)#       | Line subconfiguration mode                |
| (config-controller)# | Controller subconfiguration mode          |
| (config-router)#     | IP routing protocol subconfiguration mode |

To leave a subconfiguration mode and return to Global Configuration mode, use the `exit` command.
using the `end` command or pressing CTRL-Z will always take you back to privileged EXEC mode no matter what configuration mode you are currently working in.

### Line Configuration

Lines on IOS devices provide access to an EXEC shell; sometimes this is called *character mode access*, since it deals with a CLI.

| Line Type  | DESC                                                                                                                                                                                                                                                | Command Nomenclature |
| ---------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | -------------------- |
| Console    | Physical port that provides the initial CLI access; used for troubleshooting when remote access to IOS device isn't functioning.                                                                                                                    | line con 0           |
| Auxilliary | Backup physical port typically used for dialup into IOS device.                                                                                                                                                                                     | line aux 0           |
| VTY        | Logical port that allows for remote access connections such as telnet and SSh to gain access to the CLI. Many VTYs are supported on an IOS device, and the number is dependent on the deive, model, and software version.                           | line vty 0 4         |
| TTY        | Physical port used for connecting to a modem for a terminal service or for access to the console ports of other devices. These ports are found only on routers, and the number supported depends on the router model and asynchronus card installed | line tty 0 31        |

#### Changing the Inactivity Timeout

By default, an IOS device automatically logs you off after 10 minutes of inactivity.
You can change this using the `exec-timeout` line configuration mode command.

```
IOS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
IOS(config)#line con 0
IOS(config-line)#exec-timeout
IOS(config-line)#exec-timeout ?
  <0-35791>  Timeout in minutes

IOS(config-line)#exec-timeout 0
```

If you want to disable the use of a line completely:
```
IOS(config)# line LINE_TYPE
IOS(config-line)# no exec
```

To verify your line configuration, use the `show line` command

```
IOS(config-line)#do show line con 0
   Tty Typ     Tx/Rx    A Modem  Roty AccO AccI   Uses   Noise  Overruns   Int
*     0 CTY              -    -      -    -    -      0       0     0/0       -

Line 0, Location: "", Type: ""
Length: 24 lines, Width: 80 columns
Status: PSI Enabled, Ready, Active, Automore On
Capabilities: none
Modem state: Ready
Group codes:    0
Special Chars: Escape  Hold  Stop  Start  Disconnect  Activation
                ^^x    none   -     -       none
Timeouts:      Idle EXEC    Idle Session   Modem Answer  Session   Dispatch
                never         never                        none     not set
                            Idle Session Disconnect Warning
                              never
                            Login-sequence User Response
                             00:00:30
                            Autoselect Initial Wait
                              not set
Modem type is unknown.
Session limit is not set.
Time since activation: 1d18h
Editing is enabled.
History is enabled, history size is 20.
DNS resolution in show commands is enabled
Full user help is disabled
Allowed input transports are none.
Allowed output transports are lat pad telnet rlogin mop v120 ssh.
Preferred transport is lat.
No output characters are padded
No special data dispatching characters
```

#### Restricting VTY Protocol Access

By default, all methods of access are allowed for the VTYs, including telnet and SSH.
Controlling the type of connection allowed on the VTYs is done with the `transport input` and `transport output` commands.

Transport input: what protocols can be used to connect to the router
Transport output: what protocols can be used to connect from the router

By default, all protocols are allowed.

```
Only ssh protocol is allowed on the VTYs
Router(config)# line vty 0 15
Router(config-line)# transport input ssh
Router(config-line)# transport output ssh
```

#### CLI Output

One nice feature of an IOS device is that when certain types of events occur, such as an interface going down or up, an administer making a configuration change, or an output of `debug` commands, the IOS device, by default, prints an information message on the console line.

It won't however, display the same messages if you happen to have logged into the IOS device via telnet or SSH or accessed the device via the auxiliary or TTY lines.

If the latter is the case, you can have IOS display these messages on your screen by executing the privileged EXEC `terminal monitor` command.

```
IOS# terminal monitor
```

You must execute this command after you have logged into IOS from the VTY, TTY, or auxiliary lines.

Once you log out, however, this command does not apply to everyone else logging into IOS device on the same line; each individual line session must re-execute this command.

One annoying problem with the information message displayed on your CLI screen is that if you are typing in right where the cursor is, making it difficult to figure out where you left off typing.
If you remember, just keep typing your command, or press CTRL-C to abort the command.
A better approach, thorugh, is to set up IOS so that after the message prints in your window, IOS redisplys what you have already entered on a new CLI prompt.
The `logging synchronus` command accomplishes this:
```
IOS(config)# line LINE_TYPE
IOS(config-line)# logging synchronous
```

You can also press CTRL-R to refresh the screen.


### Interface Configuration

To configure an Interface, you must enter interface subconfiguration mode:

```
IOS(config)# interface TYPE
IOS(config-if)#
```

#### Assign IP Address

After navigating to hte interface, you can execute a number of commands to modify the characteristics of the interface.

Assign IP address:
```
IOS(config-if)#ip address 14.0.0.1 255.0.0.0

OR, using DHCP

IOS(config-if)#ip address dhcp
```

#### Enable and Disable the Interface

```
### DISABLE
IOS(config-if)# shutdown

### Enable
IOS(config-if)# no shutdown
```

#### Description

You can add a description to any interface by using `description` command

```
IOS(config-if)# description INTERFACE_DESC
```

This description appears in the output of the `show interfaces` command.

#### Speed and Duplexing for Ethernet Interfaces

```
IOS(config-if)# speed 10|100|1000|auto
IOS(config-if)# duplex full|half|auto
```

> It is no longer receommended that you hard-code the speed and duplexing with the `speed` and `duplex` commands; instead, let the interface autosense these settings from the directly connected device.
> The commands to change the speed and duplex settings are there for troubleshooting situations where autonegotiate is not working and you need to force a speed of duplex setting.

#### Serial Interfaces on Routers

Things are a little differnt when configuring serial interfaces, because you need to configure not only an IP address, but you must also specify a layer 2 protocol to use.

```
IOS(config-if)#ip address 13.0.0.2 255.0.0.0
IOS(config-if)#description LINK-TO-ISP
```

After the IP address is assigned to the serial interface, you can choose the layer 2 protocol you want to use to carry traffic across the serial link.

On the LAN, the layer 2 protocols is Ethernet, but that is not used on our serial lines.
We need to specify what type of layer 2 frame we want to put the IP packet inside before sending data out the serial port.

* **HDLC**
	* This protocol is Cisco proprietary protocol that is used to send data across a serial link.
	* It requires no configuration and is the default encapsulation protocol if you do not specify one.
* **PPP**
	* This industry standard protocol is supported by many different vendors and products should be used if you have a mix of Cisco devcies and non-Cisco devices on the network.

```
IOS(config-if)#encap hdlc

OR

IOS(config-if)#encap ppp
```

One of the benefits of PPP is that you can configure authentication.
To configure authentication with PPP:
* Set the hostname on each router
* Create a username and password on each of the routers that maches the name of the other router.
* Enable authentication with the authentication protocols (PAP or CHAP).
	* CHAP is preferred because PAP sends the username and password in clear text

```
Router#config term
Router(config)#hostname VAN-R1
VAN-R1(config)#username LA-R1 password wanpass
VAN-R1(config)#interface s0/3/0
VAN-R1(config-if)#encap ppp
VAN-R1(config-if)#ppp autentication chap
```

VAN-R1 router for username of the LA-R1 router. and then enable the encapsulation protocol of PPP, and finally configure the PPP authentication protocol to CHAP.
You would then configure the LA-R1 router in a similar way.

Now that we have configured the IP address and encapsulation protocol on the serial interface, all we need to do is make sure that the interface is receiving the clocking speed or timing, of the link.
Setting the clocking speed is the responsibility of the data communications equipment (DCE).

When connecting the router to the ISP, the ISP is the DCE end of the link, and as such the ISP sets the clocking speed of the link.
In the ISP example, you router is the data terminal equipement (DTE), so you are not allowed to set the clock speed of the link.

If you are connecting two routers together over their serial ports with a back-to-back serial cable, one end of the cable is typically labeled "DCE" and the other end of the cable is labled "DTE".
On the router that has the DCE end of the cable, you will need to set the clock rate:
```
# IN DCE side
IOS(config-if)#clock rate 64000
```

If you try to execute the `clock rate` command when you are configuring the DTE device, you will get a message that the command is performed on DCE devices only.

The last command you configure on the serial interface is to enable the interface by using the `no shutdown` command.

```
IOS(config-if)#no shutdown
```

If you are not sure which router has the DTE end of the cable and which has the DCE end, you can determine this with the `show controllers` command

```
Router> show controllers serial 0/3/0
```

### Exercise 7-1: Basic Router Configuration

![[Pasted image 20251009202129.png]]

* Serial1/0 -> between routers
* GigabitEhternet2/0 -> to switch (Ethernet0/0)
* (switch) Ethernet1/0, Ethernet1/1 -> to PCs

**VAN-R1**
```
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### Set hostname
R1(config)#hostname VAN-R1
VAN-R1(config)#

### Set G2/0 IP address
VAN-R1(config)#interface G2/0
VAN-R1(config-if)#ip address 12.0.0.1 255.0.0.0
VAN-R1(config-if)#no shutdown
VAN-R1(config-if)#
*Oct  9 20:12:55.459: %LINK-3-UPDOWN: Interface GigabitEthernet2/0, changed state to up
*Oct  9 20:12:56.459: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet2/0, changed state to up

### Serial1/0 configure
# check DTE or DCE
VAN-R1(config)#do show controllers S1/0
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BC8C48, ds = 0x66BC9D90, ssb=0x66BCA154
Clock mux=0x0, ucmd_ctrl=0x0, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: down
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

# set ip address
VAN-R1(config)#interface S1/0
VAN-R1(config-if)#ip address 13.0.0.1 255.0.0.0

# encapsulation
VAN-R1(config-if)#encap hdlc

# because this interface is DCE, set clock rate
VAN-R1(config-if)#clock rate 64000

# turn on interface
VAN-R1(config-if)#no shutdown

VAN-R1(config-if)#exit
*Oct  9 20:16:43.707: %LINK-3-UPDOWN: Interface Serial1/0, changed state to up
VAN-R1(config-if)#exit
VAN-R1(config)#
*Oct  9 20:16:44.711: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up

# save running-configuration to startup configuration file
VAN-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
VAN-R1(config)#
```

**LA-R1**
```
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### set hostname
R2(config)#hostname LA-R1

### set G2/0 interface
LA-R1(config)#interface G2/0
LA-R1(config-if)#ip address 14.0.0.1 255.0.0.0
LA-R1(config-if)#no shutdown
LA-R1(config-if)#exit
*Oct  9 20:18:11.487: %LINK-3-UPDOWN: Interface GigabitEthernet2/0, changed state to up
*Oct  9 20:18:12.487: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet2/0, changed state to up

### check DCE
LA-R1(config)#do show controllers S1/0
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BC8C08, ds = 0x66BC9D50, ssb=0x66BCA114
Clock mux=0x0, ucmd_ctrl=0x0, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: down
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

### S1/0 interface config
LA-R1(config)#interface S1/0
LA-R1(config-if)#ip address 13.0.0.2 255.0.0.0
LA-R1(config-if)#encap hdlc
LA-R1(config-if)#clock rate 64000
LA-R1(config-if)#no shutdown
LA-R1(config-if)#exit
LA-R1(config)#
*Oct  9 20:20:16.431: %LINK-3-UPDOWN: Interface Serial1/0, changed state to up
LA-R1(config)#
*Oct  9 20:20:17.435: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up

### Save running configuration to startup configuration
LA-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
LA-R1(config)#
```

```
### TEST
# LA-R1 to VAN-R1
LA-R1#ping 13.0.0.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/39/48 ms
LA-R1#

# VAN-R1 to LA-R1
VAN-R1#ping 14.0.0.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 14.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 44/53/76 ms
VAN-R1#

### Verify
# LA-R1
LA-R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
Serial1/0                  13.0.0.2        YES manual up                    up
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
GigabitEthernet2/0         14.0.0.1        YES manual up                    up
Ethernet4/0                unassigned      YES unset  administratively down down
Ethernet4/1                unassigned      YES unset  administratively down down
Ethernet4/2                unassigned      YES unset  administratively down down
Ethernet4/3                unassigned      YES unset  administratively down down

LA-R1#show interfaces g2/0
GigabitEthernet2/0 is up, line protocol is up
  Hardware is 82543, address is ca02.0134.0038 (bia ca02.0134.0038)
  Internet address is 14.0.0.1/8
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 1000Mb/s, link type is autonegotiation, media type is SX
  output flow-control is unsupported, input flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:00, output 00:00:00, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     227 packets input, 14021 bytes, 0 no buffer
     Received 203 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     45 packets output, 5104 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier, 0 pause output
     0 output buffer failures, 0 output buffers swapped out
LA-R1#
LA-R1#show interfaces S1/0
Serial1/0 is up, line protocol is up
  Hardware is M4T
  Internet address is 13.0.0.2/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:01, output 00:00:02, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops)
     Conversations  0/1/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     53 packets input, 4684 bytes, 0 no buffer
     Received 30 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     54 packets output, 4702 bytes, 0 underruns
     0 output errors, 0 collisions, 2 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     2 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up

# VAN-R1
VAN-R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES NVRAM  down                  down
Serial1/0                  13.0.0.1        YES manual up                    up
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
GigabitEthernet2/0         12.0.0.1        YES manual up                    up
Ethernet4/0                unassigned      YES unset  administratively down down
Ethernet4/1                unassigned      YES unset  administratively down down
Ethernet4/2                unassigned      YES unset  administratively down down
Ethernet4/3                unassigned      YES unset  administratively down down

VAN-R1#show interfaces G2/0
GigabitEthernet2/0 is up, line protocol is up
  Hardware is 82543, address is ca01.0118.0038 (bia ca01.0118.0038)
  Internet address is 12.0.0.1/8
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 1000Mb/s, link type is autonegotiation, media type is SX
  output flow-control is unsupported, input flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:00, output 00:00:03, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     565 packets input, 34893 bytes, 0 no buffer
     Received 507 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     112 packets output, 11857 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier, 0 pause output
     0 output buffer failures, 0 output buffers swapped out
VAN-R1#show interfaces S1/0
Serial1/0 is up, line protocol is up
  Hardware is M4T
  Internet address is 13.0.0.1/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:04, output 00:00:03, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops)
     Conversations  0/1/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     58 packets input, 5107 bytes, 0 no buffer
     Received 35 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     100 packets output, 7046 bytes, 0 underruns
     0 output errors, 0 collisions, 3 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     3 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
```

---

## Basic IOS Security Configuration

The Computer Security Institute (CSI) is an organization that provides eduction and trainning on network security fundamentals.
It periodically performs market research studies on security issues with companies.

### Physical and Environmental Threats

Many network administrators forget that the first line of defense in securing their network devices includes protecting against physical and environment threats, including the following:

* **Hardware**
	* Restricting physical access to the router via physical measures, such as locked doors, key cards, video cameras, and so on.
* **Electrical**
	* Ensuring that equipment is protected from power surges/spikes, brownouts, and loss of power
* **Environmental**
	* Protecting equipment from temperatures that are too cold or too hot, or from too much humidity.
* **Maintenance**
	* Ensuring that you follow electrostatic discharge procedures when handling sensitive electronic parts, have spares on hand for critical parts, and properly label equipment and cables

### Passwords

The most common way of restricting physical access to IOS devices is to use some type of user authentication.
For example, you can configure passwords to restrict access to the lines on IOS devices (user EXEC mode) as well as access to privileged EXEC mode.

#### User EXEC password Protection

Controlling access to user EXEC mode on an IOS device is accomplished on a line-by-line basis: console, auxiliary, TTYs, and VTYs.
Remeber that not all devices support auxiliary ports, only routers support TTYs, and the number of VTYs an IOS device supports is product-dependent, ranging from five VTYs to almost a thousand.

To secure the console port, you must first go into the console's line subconfiguration mode with the `line console 0` command to configure the line password:

```
IOS(config)# line console 0
IOS(config-line)# password CONSOLE_PASS
IOS(config-line)# login
```

you can use the `password` command to assign the console password.
`login` is needed as an indication that you want the Cisco device to force people to authenticate using that password if they connect to the console 0 port.

Passwords on IOS device are *case-sensitive*.
Remeber that the `password` command, when executed under **line console 0**, sets the user EXEC password for someone trying to access the IOS device from the console port only.

The auxiliary port is typically used as a remote access port with a modem attached to it, which enables you to dial into the router if someting has happend to the Internet connection and you cannot remote in via telnet or SSH.

**setting up password authentication on the auxiliary port**
```
Router(config)# line aux 0
Router(config-line)# password AUX_PASS
Router(config-line)# login
```

Again, the `login` command is required; if you forget it, you will have set a password on the port and will no have asked the Cisco device to prompt for that password when someone connects to the port.

**Set up a telnet password**
```
IOS(config)# line vty 0 15
IOS(config-line)# password TELNET_PASS
IOS(config-line)# login
```

The vty parameter in this command refers *virtual termial*, telnet or SSH.
Cisco devices support mulitple simultaneous VTY session, where each connection is internally tracked by a number: 0-15.
Depending on the router model and IOS software version, this number is different.

You couls assign a different password to each VTY, but then you wouldn't know which password to use when telnetting into the IOS device.

However, IOS enables you to specify multiple VTYs ports with the *line* command, simplifying your configuration, as in the preceding configuration: `line vty 0 15`. You need to specify the beginning and ending VTY numbers on the same line.

### Creating Usernames and Passwords

Other ways of validating access are available, such as a local username database or an external authentication server.

A local username database on the router enables you to specify both a username and a password to restrict access to the lines on an IOS device.
Using username and a passwords is recommended over using only passwords on lines: the advantage of this approach is that each user can have his or her own password instead of sharing a password, providing for more accountability.

The following commands illustrate the setup of a local username database and its use on VTYs:
```
IOS(config)# username NAME {secret | password} PASSWORD
IOS(config)# line vty 0 15
IOS(config-line)# login local
```

The `username` command specifies the name and password for the user.

The main difference between `secret` and `password` parameters is that the `secret` parameter tells IOS to encrypt the password with an MD5 hash, and the `password` parameter doesn't (the password is stored in clear text).

This is true of the line subconfiguration mode `password` command: it also is stored in cleat text.

> The `login local` command can be used on any of the lines on Cisco device to tell the device to perform authentication using the local username and password database.
> You can use this on console, auxiliary, and VTY ports to force to Cisco device to require a username and password when someone connects.

#### Privileged EXEC Password Protection

Along with protecting access to the lines on IOS device, you can also control access to privileged EXEC mode by assigning a password to it.

```
Switch(config)# enable password PRIVILAGE_EXEC_PASS

or

Switch(config)# enable secret PRIVILAGE_EXEC_PASS
```

Both of these commands configure the privileged EXEC password.
The main difference between the two, as with the `username` command, is that the `secret` parameter encrypts the password, `password` doesn't.

If you configure both of these commands, the password configured with `enable secret` command always takes precedence over the password configured with the `enable password` command.

The `enable password` command is still supported by Cisco for backward-compatibility purposes.

#### Password Encryption

Passwords that are not encrypted can be encrypted by using the `service password-encryption` Global configuration mode command.

However, the `enable secret` command's encryption is *much* stronger than using the `service password-encryption` command to do the encryption.

### Exercies 7-2: Configuring Passwords

You will configure a console password, an auxilary password (if you have an aux port), and VTY port password

![[Pasted image 20251009213927.png]]

**VAN-R1**

```
VAN-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### console password
VAN-R1(config)#line con 0
VAN-R1(config-line)#password conpass
VAN-R1(config-line)#login

### aux password
VAN-R1(config-line)#line aux 0
VAN-R1(config-line)#password auxpass
VAN-R1(config-line)#login

### VTY password
VAN-R1(config-line)#line vty 0 16
VAN-R1(config-line)#password vtypass
VAN-R1(config-line)#login
VAN-R1(config-line)#exit

### enable password, enable secret
VAN-R1(config)#enable password enablepass
VAN-R1(config)#enable secret enablesecret

### save configuration changes
# you could have also used the write command, which does not prompt you to confirm the destination of the save operation.
VAN-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
VAN-R1(config)#
```

**LA-R1**
```
LA-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
LA-R1(config)#line con 0
LA-R1(config-line)#password conpass
LA-R1(config-line)#login
LA-R1(config-line)#line aux 0
LA-R1(config-line)#password auxpass
LA-R1(config-line)#login
LA-R1(config-line)#line vty 0 16
LA-R1(config-line)#password vtypass
LA-R1(config-line)#login
LA-R1(config-line)#exit
LA-R1(config)#enable password enablepass
LA-R1(config)#enable secret enablesecret
LA-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
LA-R1(config)#
```

### Configuring Banners

Banners provide a way for you to display messages to administrators when they connect to your Cisco device.

There are different types of banners, such as message-of-the-day (MOTD) and login banners, which differ in the timing of when they appear.

* **MOTD banner**
	* The MOTD banner appears before the administrator is asked to log in and is used to display a temporary message that may change from day to day
* **Login banner**
	* The login banner displays before the administrator logs in, but the MOTD banner appears, and is used to display a more permanent message to the administrator.
* **EXEC banner**
	* The exec banner is used to display a message after the administrator authenticates to the system and after he enters user EXEC mode.

```
VAN-R1(config)#banner ?
  LINE            c banner-text c, where 'c' is a delimiting character
  exec            Set EXEC process creation banner
  incoming        Set incoming terminal line banner
  login           Set login banner
  motd            Set Message of the Day banner
  prompt-timeout  Set Message for login authentication timeout
  slip-ppp        Set Message for SLIP/PPP
```

#### MOTD Banner

You can set up a MOTD banner on your IOS device that will display a message *before* the administrator is asked to log in to the device (before the console, aux, or VTY passwords).

Use the `banner motd` command to create the MOTD banner:
```
IOS(config)# banner motd $
some long multiline
motd message
$
IOS(config)#

or

IOS(config)# banner motd 'Single line motd'
IOS(config)#
```

#### Login Banner

The *login banner* also appears before the administrator logs in, but it appears *after* the MOTD banner text appers.

The login banner is desinged to be more of a permanent message that would not change very often.

```
IOS(config)# banner login $
some long
multiline
login banner
$

or

IOS(config)# banner login 'single line'
```

> You should not use such words as *welcome* or any type of welcomming salutation in your banner; using such words can be misconstructed and may enable attackers to defend their actions by citing the welcome salutation in your login banner.

#### Exec Banner

Use the exec banner to display a message *after* the administrator has authenticated to the device with console or aux password, but before enters user EXEC mode.

```
IOS(config)# banner exec $
long
multilne
banner
$
IOS(config)#
```

### Exercies 7-3: Setting Banners

MOTD banner, login banner, and exec banner on VAN R1

```
VAN-R1(config)#banner motd $
Enter TEXT message.  End with the character '$'
Long weekend upcomming. We will be performing maintenance.
Back up all your configuration.
$
VAN-R1(config)#banner login $
Enter TEXT message.  End with the character '$'
This is a private system and only authorized indiciduals are allowed!
All others will be prosecuted to the fullest extent of the law!
$
VAN-R1(config)#banner exec $
Enter TEXT message.  End with the character '$'
Remeber to save your changes with the write command.
$
VAN-R1(config)#do write
Building configuration...
[OK]
VAN-R1(config)#

### verify
*Oct  9 22:21:05.595: %SYS-5-CONFIG_I: Configured from console by console
Long weekend upcomming. We will be performing maintenance.
Back up all your configuration.

This is a private system and only authorized indiciduals are allowed!
All others will be prosecuted to the fullest extent of the law!


User Access Verification

Password:
Remeber to save your changes with the write command.

VAN-R1#
```

---

## IOS Operation and Verification

Once you have configured your IOS device, many commands are available to use to examine and troubleshoot your configuration.

### Show and Debug Command Overview

You can use two basic commands to troubleshoot problems an IOS device:

* **`show`**
	* Takes a snapshot of a particular process and displays information about it; the information displyed is static and will not refresh itself unless you re-execute this command
* **`debug`**
	* Displays how a particular process is currently operating, showing information as it basically happens, in real time

#### Common `show` Commands

Use `show` commands to get a quick idea about how an IOS device is configured (the configuration in RAM, a routing protocol, or Spanning Tree protocols (STP)) or the current state of a process (such as an interface, a routing table, or a port address table).

Unfortunately, in certain instances, `show` commands may not provide enough information to diagnose and fix a problem correctly.

**Some command `show` commands**
* **`show ip interface brief`**
	* Lists of all of the interfaces on the device and offers a quick look at heir statuses; indicates whether an interface is up and running and the IP address assigned to the interface
* **`show interfaces`**
	* Lists all the interfaces and details specifications on the interfaces
* **`show interfaces g0/0`**
	* Lists all the details of a specific interface
* **`show controllers s0/3/0`**
	* Lists information such as the DCE and DTE details on serial interfaces

#### Common `debug` Commands

The `debug` commands, on the other hand, display how a process is currently running or behaving, such as the contents of a routing update received by a neighboring router, and are therefore typically more useful in troubleshooting difficult problems.

The main disadvantage of `debug` commands is that they are process-intensive on IOS devices and should be used with care.

### Running and Startup Configuration

When you configure a Cisco device, the configuration settings are stored in a configuration file.
By default, two configurations are possible on Cisco devices:

* **running-config**
	* This file contains the actual configuration running on the RAM of an IOS device (the settings that the devcie is currently useing).
* **startup-config**
	* This file contains the saved configuration settings in nonvolatile RAM (NVRAM) of a Cisco device and are applied at bootup.

Configuration files can reside in many locations, including RAM, NVRAM, or a Trivial File Transfer Protocol (TFTP) or FTP server, among other places.

Whenever you make changes to an IOS's configuration by typing in commands from configuration mode, these changes are made in RAM (running-config).
These changes can then be saved to NVRAM (startup-config), which is *static* form of memory; when the Cisco device is turned off, the contents of NVRAM are not erased and are available upon a power-up.

IOS devices do *not* automatically save the configuration file from RAM to NVRAM; this must be done *manually*.
Configuration changes can also be saved to an external server using TFTP, FTP, and Secure Copy Protocol (SCP), this requires that you configure IP addressing and possibly a default gateway address on your IOS device.

#### Viewing Configurations

To examine the active or running configuration on an IOS device, use the `show running-config` command.

```
VAN-R1#show running-config
Building configuration...

Current configuration : 2262 bytes
!
upgrade fpd auto
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname VAN-R1
!
boot-start-marker
boot-end-marker
!
logging message-counter syslog
enable secret 5 $1$5Hk6$yPaN6.uBbFSKlJXvGelv7/
enable password enablepass
!
no aaa new-model
ip source-route
no ip routing
no ip icmp rate-limit unreachable
no ip cef
!
!
!
!
no ip domain lookup
no ipv6 cef
!
multilink bundle-name authenticated
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
archive
 log config
  hidekeys
!
!
!
!
!
ip tcp synwait-time 5
!
!
!
!
interface FastEthernet0/0
 no ip address
 no ip route-cache
 duplex half
 no mop enabled
!
interface Serial1/0
 ip address 13.0.0.1 255.0.0.0
 no ip route-cache
 serial restart-delay 0
 clock rate 64000
!
interface Serial1/1
 no ip address
 no ip route-cache
 shutdown
 serial restart-delay 0
!
interface Serial1/2
 no ip address
 no ip route-cache
 shutdown
 serial restart-delay 0
!
interface Serial1/3
 no ip address
 no ip route-cache
 shutdown
 serial restart-delay 0
!
interface GigabitEthernet2/0
 ip address 12.0.0.1 255.0.0.0
 no ip route-cache
 negotiation auto
!
interface Ethernet4/0
 no ip address
 no ip route-cache
 shutdown
 duplex half
!
interface Ethernet4/1
 no ip address
 no ip route-cache
 shutdown
 duplex half
!
interface Ethernet4/2
 no ip address
 no ip route-cache
 shutdown
 duplex half
!
interface Ethernet4/3
 no ip address
 no ip route-cache
 shutdown
 duplex half
!
ip forward-protocol nd
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
!
!
!
control-plane
!
!
!
!
!
!
!
gatekeeper
 shutdown
!
banner exec ^C
Remeber to save your changes with the write command.
^C
banner login ^C
This is a private system and only authorized indiciduals are allowed!
All others will be prosecuted to the fullest extent of the law!
^C
banner motd ^C
Long weekend upcomming. We will be performing maintenance.
Back up all your configuration.
^C
!
line con 0
 exec-timeout 0 0
 privilege level 15
 password conpass
 logging synchronous
 login
 stopbits 1
line aux 0
 exec-timeout 0 0
 privilege level 15
 password auxpass
 logging synchronous
 login
 stopbits 1
line vty 0 4
 password vtypass
 login
line vty 5 16
 password vtypass
 login
!
end
```

#### Saving Your Changes

The startup configuration file is stored in NVRAM for both switches and routers.
When IOS device boots up, IOS loads the configuration from NVRAM and places it in RAM.
After booting the device, you can make configuration changes, which are stored in RAM (running-config).

To have that configuration retained during reboots of the device, you will need to save the new changes to NVRAM (startup-config).
To save the active configuration to NVRAM, you must execute `copy running-config startup-config` command.

Upon executing this command, the IOS device takes the active configuration in RAM and saves it to NVRAM.
In this process, the old configuration file in NVRAM is overwritten.

```
VAN-R1#copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
VAN-R1#
```

When executing this command, you are asked for a filename for the configuration file (the default is *startup-config*).
This is the filename IOS looks for when booting up.

You can change the name for backup revisioning purposes (different versions of th backed-up configuration), but amake sure that your most current configuration is saved as startup-config.

On the IOS device, you can view the saved configuration in NVRAM with the `show startup-config` command.

> A shortcut to save IOS'S configuration to NVRAM is the `write memory` command: you can abbreviate this to just `write`.
> `write memory` is deprecated command, so although it currently works, it will eventually be removed as a command in future versions of IOS.

#### Reverting Your Configuration

To revert your configuration from NVRAM to RAM, use the `copy startup-config running-config` comamnd.

When you take a configuration file from any location and copy it to RAM, IOS uses a merge process to load in the configuration file from the source, overwriting matching commands in RAM and adding new commands that don't exist in RAM, but not deleting commands that don't exist in NVRAM but do exist in RAM.

### Device Version Information

If you want to see general information about your IOS device (its model number, the types of interfaces, the different kinds and amounts of memory, its software version, where IOS located and loaded and its configuration file, as well as the configuration settings), you can use the `show version` command.

```
VAN-R1#show version
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Fri 04-Mar-11 06:49 by prod_rel_team

ROM: ROMMON Emulation Microcode
BOOTLDR: 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)

VAN-R1 uptime is 3 hours, 5 minutes
System returned to ROM by unknown reload cause - suspect boot_data[BOOT_COUNT] 0x0, BOOT_COUNT 0, BOOTDATA 19
System image file is "tftp://255.255.255.255/unknown"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 7206VXR (NPE400) processor (revision A) with 491520K/32768K bytes of memory.
Processor board ID 4279256517
R7000 CPU at 150MHz, Implementation 39, Rev 2.1, 256KB L2 Cache
6 slot VXR midplane, Version 2.1

Last reset from power-on

PCI bus mb0_mb1 (Slots 0, 1, 3 and 5) has a capacity of 600 bandwidth points.
Current configuration on bus mb0_mb1 has a total of 200 bandwidth points.
This configuration is within the PCI bus capacity and is supported.

PCI bus mb2 (Slots 2, 4, 6) has a capacity of 600 bandwidth points.
Current configuration on bus mb2 has a total of 440 bandwidth points
This configuration is within the PCI bus capacity and is supported.

Please refer to the following document "Cisco 7200 Series Port Adaptor
Hardware Configuration Guidelines" on Cisco.com <http://www.cisco.com>
for c7200 bandwidth points oversubscription and usage guidelines.


4 Ethernet interfaces
1 FastEthernet interface
1 Gigabit Ethernet interface
4 Serial interfaces
509K bytes of NVRAM.

8192K bytes of Flash internal SIMM (Sector size 256K).
Configuration register is 0x2102
```

### Interface Information

You typically will notice any problems with an interface when you enable it, because a status message states whether the interface is up (enabled with no problems) or down (unable to enable due to configuration errors).
In Ethernet, a status message could be issued if the wrong cable type (crossver versus straight-through) is used, there is a mismatch in the speed of duplex settings, or a bad cable is used.

#### Viewing Interface Information

One of the most common commands that you will use on an IOS device is the `show interfaces` command.
This command enables you to see the status and configuration of your interfaces, as well as some statistical infromation.

```
IOS> show interface INTERFACE_TYPE
```

If you don't specify a specific interface, the IOS device displays all of its interfaces.

#### Troubleshooting Interface Problems

One of the first things that you want to examine in this display is status of the interface (up or down).

**Some possible values for the physical layer status:**
* **Up**
	* The device is sensing a physical layer signal on the interface
* **Down**
	* The device is not sensing a physical layer signal on the interface, a condition that can arise if the attached device is turned off, no cable is attached, or the wrong type of cable is being used.
* **Administratively down**
	* Use the `shutdown` command to disable the interface

**Some possible values for the data link layer status:**
* **Up**
	* The data link layer is operational
* **Down**
	* The data link layer is not operational
	* a conditaion that can be cause by:
		* missed keepalives on a serial link
		* no clocking
		* an incorrect encapsulation type
		* disabled physical layer

> If the interface status is "up and up," the interface is operational.
> If the status is "up and down," this indicates a problem with the data link layer protocol such as a configuration error on layer 2 protocol.
> If the status is "down and down," a physical layer problem (layer 1) exist, because the part indicating the layer 2 status will never show as up if the layer 1 part of the status is down.
> If the status is "administratively down and down," the interface was disabled with the `shutdown` command by one of the administrators.
> The "Hardware is" refers to the physical layer properties of the interface and the "Encapsulation" refers to the data link porperties of the interface.


```
# hardware interface type
Hardware is CN Gigabit Ethernet, address is 0004.9ab9.5601 (bia 0004.9ab9.5601)
```

This is follwed by the MAC address on the interface.

```
### shows IP address and subnet mask configured on the interface
# you won't see this on layer 2 switche's interface
Internet address is 14.0.0.1/8
```

```
MTU 1500 bytes, BW 1000000 kbit, DLY 10 usec,
```
This shows MTU Ethernet frame size as well as the routing protocol metrics.
Notice the **BW** parameter in this line. Referred to as the *bandwidth* of the link, this is used by some routing protocols, such as Open Shortest Path First (OSPF) and Enhanced Interior Gateway Routing Protocol (EIGRP), when making routing decisions.
For Gigabit Ethernet, this is 1,000,000 Kbps.

```
Encapsulation ARPA, loopback not set
```
This line refers to the layer 2 encapsulation (frame) type used; with Ethernet, this can be ARPA, but on WAN interface you may see serial link protocols such as HDLC or PPP.

**Some elements in `show interfaces` command**
Note that depending on the kind of IOS device and type of interface, the output displayed in `show interfaces` command may differ slightly.

* **Address**
	* The MAC address of the interface
	* BIA (burnt-in address) is the MAC address burnt into the Ethernet controller.
	* Can be overridden with the interface `mac-address` command.
* **Last input/output**
	* The last time a packet was received on or sent out the interface
	* can be used to determine whether the interface is operating or not.
* **Last clearing**
	* The last time the `clear counters` command was executed on the interface
* **Output queue**
	* The number of packets waiting to be sent out the interface
	* The number after the slash (/) is the maximum size of the queue, followed by the number of packets dropped because the queue was full.
* **Input queue**
	* The number of packets received on the interface and waiting to be processed
	* The number after the slash (/) is the maximum size of the queue, followed by the number of packets dropped because the queue was full.
* **No buffers (input)**
	* The number of received packets dropped because the input buffer was full.
* **Runts (input)**
	* Number of packets received that were less than the minimum for the encapsulation type (64 bytes for Ethernet).
* **Giants (intput)**
	* The number of packets received that were grater than the maximum allowed size (1518 bytes for Ethernet).
* **Input errors**
	* The total number of input errors received on the interface
* **CRC (input)**
	* The number of packets received that had checksum errors.
* **Frame (input)**
	* The number of packets received that had both CRC errors and cases where the length of the frame was not on a byte boundary.
* **Overruns (input)**
	* The number of times the inbound packet rate exceeded the capabilities of the interface to process the traffic.
* **Ignored (input)**
	* The number of inbound packets that were dropped because of the lack of input buffer space.
* **Aborts (input)**
	* The number of received packets that were aborted
* **Collisions (output)**
	* The number of times the interface tried transmitting a packet, but a collision occurred.
	* This soud be less than 0.1 percent of total traffic leaving the interface.
* **Interface resets (output)**
	* The number of times the interface changed state by going down and then coming back up.
* **Restarts (output)**
	* The number of times the controller was reset because of errors
	* use the `show controllers` command to troubleshoot this problem.

```
VAN-R1#show interfaces G2/0
GigabitEthernet2/0 is up, line protocol is up
  Hardware is 82543, address is ca01.0118.0038 (bia ca01.0118.0038)
  Internet address is 12.0.0.1/8
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Full-duplex, 1000Mb/s, link type is autonegotiation, media type is SX
  output flow-control is unsupported, input flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:00, output 00:00:01, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     9552 packets input, 587448 bytes, 0 no buffer
     Received 8572 broadcasts, 0 runts, 0 giants, 0 throttles
     
     #### lot of input and CRC errors
     735 input errors, 731 CRC, 0 frame, 0 overrun, 0 ignored
     
     
     0 watchdog, 0 multicast, 0 pause input
     0 input packets with dribble condition detected
     1747 packets output, 180728 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier, 0 pause output
     0 output buffer failures, 0 output buffers swapped out
```

If autosensing of the speed/duplex was used (which is the default), then the word `auto` appear in the duplexing line.
The curlprit is probably a duplex mismatch on the other end.

> Remember that if devices connected to a subnet can ping each other, but devices cannot ping the router connected to the same subnet, you can use the `show interfaces` command to verify the interface is operational and the router has the correct IP address configured on it.

#### WAN Serial Loopback Test

When troubleshooting connectivity over the WAN, you may need to perform a loopback test on the serial port of the Cisco device.

A loopback test is a way to verify where the problem occurs with the WAN link: Is it on your side or is it with the service provider?

It is great idea to start testing connectivity to the channel service unit/data service unit (CSU/DSU) by performing CSU/DSU loopback test to verify your T1 link or your 56K link.
If that is successful, you can then verify connectivity from the CSU/DSU to the service provider by performing a telco-assisted loopback test with the service provider.

Two types of loopback testing can be performed on the CSU/DSU:

* **Software**
	* Use Cisco IOS commands to test functionality from the router to the CSU/DSU.
* **Hardware**
	* Connect a loopback plug/cable to the CSU/DSU to perform the loopback test.

```
Router>enable
Router#show inventory

...

NAME: "WAN Interface Card - DSU/CSU T1 Fractional (V2)", DESCR: "WAN INterface Card - DSU/CSU T1 Fractional (V2)"
PID:                        , VID: 1.2, SN: FOC10174ES5

...

Router#show ip interface brief
Interface       IP-Address    OK? Method Status   Protocol
Serial0/2/0     13.0.0.1      YES manual up       up

...

Router#show interface S0/2/0
Serial0/2/0 is up, line protocol is up
  Hardware is GT96K with integrated T1 CSU/DSU
  MTU 1500 bytes, BW 1544 Kbit, DLY 20000 usec,
    reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, loopback not set
  Keepalive set (10 sec)

...

Router#config t
Router(config)#interface s0/2/0
Router(config-if)#loopback dte
Loopback in progress

### verify loopback
Router#show interface S0/2/0

...

# if loopback is not set
Encapsulation ARPA, loopback is not set

# if loopback is set
Encapsulation ARPA, loopback is set
```




### Exercise 7-4: Viewing Your Configuration

```
Router#show running-config
Router#show startup-config

### save changes
Router#copy running-config startup-config

or

Router#write
```

---

## Chapter Review

The nomenclature of a swich interface is this: *type slot_#/port_#*.
The type of interface is the media type, such as Ethernet, FastEthernet, or GigabitEthernet.

For all fixed interfaces on the deivce, the slot number is always 0.
All switch port numbers start at 1 and work their way up.

The nomenclature of a router interface is either *type slot_#/port_#* or *type port_#*.
The type of interface is the media type, such as Ethernet, FastEthernet, GigabitEthernet, and Serial, as well as many others.

IOS provides a CLI with many features, including context-sensitive help accessed by using `help` or `?`, command line history, and advanced editing features, which are available at all modes, including the user EXEC, privileged EXEC, and configuration modes.

Within configuration mode are subconfiguration modes.
To access privileged EXEC mode, use the `enable` command, and to access configuration mode, use `configure terminal`

You can protect access to your Cisco device by assigning userEXEC and privileged EXEC passwords.
Use the line subconfiguration mode `password` command and the `enable secret` or `enable password` command for the two respective levels.

The `service password-encryption` command encrypts clear-text passwords on the IOS device.

The `banner motd` command displays a login banner before any username of password prompt.

To view the active configuration, use the `show running-config` command.
On IOS devices, you must manully save your configuration to NVRAM with the `copy running-config startup-config` command.

Switch interfaces are enabled by default, but router interfaces need to be enabled using the `no shutdown` command.
For DCE serial interfaces, routers need a clock rate applied with the `clock rate` command.
Use the `show interfaces` command to view the status and configuration of your interfaces.

---

## Quick Review

Interfaces have a name, possibly a slot number, and a port number. The slot number of the 2960 is 0; port numbers start at 1. Router slot numbers begin with 0; port numbers start at 0 and restart with each type within each slot.

### Command-Line Interface (CLI)

* Four CLI access modes exist
	* user EXEC (IOS>)
	* privileged EXEC (IOS#)
	* configuration (IOS(config)#)
	* ROMMON mode (>)
* The `enable` command moves you from user EXEC to privileged EXEC mode.
* The `exit` command logs you out of an IOS device

### IOS Basics

* Use the `?` to display context-sensitive help in any mode of a router; it lists available commands and their valid parameters
* If you execute a command and see the resulting output of the command, be sure to examine the output to ensure that no error is present in the command you entered.
* You can use the arrow kes on your keyboard to recall and edit commands.
* Use the TAB key to autocomplete a command.

### Basic IOS Configuration

* Use the privileged EXEC `configure terminal` command to enter configuration mode.
* the `hostname` command assigns a locally significant name to the router.
	* the `no` parameter negates/undoes a configuration change.
* The `no shutdown` enables an interface; interfaces on switches are enabled by default, but router interfaces are disabled.
* The `clock rate` command specifies the speed of a DCE serial interface on a router and is required when connecting two serial interfaces, back-to-back, without using external clocking devices such as CSU/DSUs.
	* Use the `show controller` command to verify whether or not the serial interface is a DTE or DCE.

### Basic IOS Security Configuration

* Lines (access to user EXEC mode) can be secured with the `password` command.
* Access to privleged EXEC mode can be secured with either `enable password` or `enable secret` command.
* Clear-text passwords can be encrypted with the `service password-encryption` command
* You can display a login banner before a username/password prompt with the `banner motd` command; after the authentication takes place and before user sees and EXEC prompt, you can display a bnner with the `banner exec` command.

### IOS Operation and Verification

* You must be at privileged EXEC mode to manipulate configuration files.
	* The `show running-config` command displays the running configuration in RAM
	* The `show startup-config` command displays the backed-up configuration in NVRAM.
* IOS devices do not automatically save their configuration from RAM to NVRAM.
	* use the `copy running-config startup-config` command to do this.
* Use the `show version` command to see the IOS version of the device as well as its hardware characteristics.
* The `show interfaces` command is used to see the operational status of the physical and data link layers of an IOS device's interface.

---

### Questions
1.  A `__________` cable is used to connect to the console port of your IOS device.

rollover cable

2.  Match the device modes with the appropriate command or task.

| Device Mode          | Command or Task     |
| -------------------- | ------------------- |
| User EXEC            | enable              |
| Privileged EXEC      | show running-config |
| Global configuration | line vty 0 4        |
| ROMMON               | Password recovery   |

3.  Which of the following enable you to use context-sensitive help? (Choose two.)

**A. help**
B. show
**C. ?**
D. verify

4.  Which control sequence takes you to the beginning of the CLI?

A. ctrl-e
**B. ctrl-a**
C. esc-b
D. ctrl-b

5.  Enter the IOS command that will change the device name to
Perimeter: `__________`.

hostname Perimeter

6.  Match the following commands to their description.

| Command         | Desc                                                    |
| --------------- | ------------------------------------------------------- |
| shutdown        | Disables an interface                                   |
| show controller | Shows if an interface is DTE/DCE                        |
| login local     | Specifies the use of an IOS database for authentication |
| clock rate      | Specifies the speed of a serial interface               |

7.  You execute the line console 0 command from configuration mode. What will the router’s prompt be?

A. Router(config)#
**B. Router(config-line)#**
C. Router(config-interface)#
D. Router#(config-if)

8.  Enter the IOS command that will encrypt all unencrypted passwords: `__________`.

service password-encryption

9.  Which IOS command would display a message of “This is Router5” after a user logs in?

A. banner motd $
B. login exec $
**C. banner exec $**
D. login motd $

10.  You examine your interfaces, and the GigabitEthernet 0/0 interface status says “GigabitEthernet 0 is up, line protocol is down.” What does this indicate?

A. A physical layer problem
**B. A data link layer problem**
C. A network layer problem
D. No problem

11.  What IOS command saves the active configuration to NVRAM?

A. copy nvram startup-config
B. copy startup-config running-config
C. copy running-config nvram
**D. copy running-config startup-config**

### Performance-based Questions

1.  Using the following exhibit, draw a line from the description to the appropriate command for that description. Not all descriptions are used.

![[Pasted image 20251010012427.png]]

`Router(config-line)# exec-timeout 5.0`
* Configures the console to timeout after 5 minutes of inactivity

`Router(config-line)# trasnport input ssh`
* Restricts the VTY ports to accept only SSH traffic

`Router(config-if)#ip address 14.0.0.1 255.0.0.0`
* Manully assigns an IP address to an interface

`Router(config-if)#ip address dhcp`
* Configures the interface to receive an IP address from the DHCP server

`Router(config-if)#clock rate 64000`
* Configured on the DEC end of a point-to-point serial link.

2.  Using the following exhibit, write each of the commands found on
the left at the top of the box that identifies the output for that
command.

![[Pasted image 20251010012440.png]]

show interface g0/0
show running-config
show ip interface brief
show contollers s0/3/0
