
## Understanding Switch Features

A *switch* is a central connectivity device to which all systems connect in order to communicate with one another.

Switches have replaces hubs, because switches offer more advanced capabilities, such as being able to filter traffic by sending data only to the destination port (while the hub always sends data to all ports).

A switch also supports other features, such as full-duplex communication.

Switches also have the benefit of being able to divided into multiple virtual local area networks (VLANs).

The switch is ready to peform that job out of the box; simply give it power and then connect the systems to the switch, and it will forward traffic to each of the connected devices as needed.
Unlike a router, a switch by default, doesn't require that you apply configuration settings. There are, however, a number of features that you can configure on the switch that enable you to tweak how the switch operates and to use advanced features that are not configured by default.

### Switch Functions

Switches are layer 2 devices, that is, they operate at the data link layer of the OSI model.

Although a switch has many capabilities, they do have core functions: they learn, forward, and avoid loops.

Switchs make all of their switching decisions based on the destination Media Access Control (MAC) address in the header of the frame that is received, and all of the processing is performed in hardware by using application-specific integrated circuits (ASICs).

ASICs are specialized processors built into perform very few specific tasks.
Because they do only a few things, ASICs are much more cost-effective than generic processors.

A switch has the following three main functions:

* **Adress learning/MAC learning**
	* When a computer sends a frame to another computer and that frame reaches the swtich, the switch records the sending MAC address and the port that system is connected to in the MAC table of the switch.
	* Any time the switch receives a frame, it checks the MAC table to see what port the destination system is connected to.
* **Filtering/forwarding**
	* Switches filter traffic by forwarding the frame only to the port of the destination system.
* **Loop avoidance**
	* Prevent layer 2 loops on the network by using a loop prevention protocol, such as Spanning Tree Protocol (STP).

#### Address Learning/MAC Learning

One of the three functions of a switch is to learn which devices are connected to which ports on the switch.
The switch uses this information to forward frames intelligently.

When a switch receives a frame, it reads the source MAC address in the frame and compares it to a local MAC address table, called a *MAC address* table or *content addressable memory (CAM)* table.

If the address is not already in this table, the switch adds the address and the port number on which the frame was received.

![[Pasted image 20251013184121.png]]

ComputerB with MAC address `bbbb.bbbb.2222` is sending data.
When the switch receives this data it will record that the address `bbbb.bbbb.2222` is located at port 2 on the switch.

If the address is already in the CAM table, the switch compares the incoming port with the port already in the table.
If the two are different, the switch updates the CAM table with the new port information.

This is important, because you may have moved the device from one port to another, and you want to switch to determine the new location.
If the port has not been changed, the switch resets the age timer for the entry.

Because this MAC address table is stored in memory on the switch and is generated dynamically based on traffic, entries will age out after 300 seconds by default if the entry is not updated by the system sending traffic.

The CAM table can be built statically or dynamically.
By default, when you turn on a switch, the CAM table is empty unless you have configured static entries in it.
As traffic flows through the switch, the swtich will begin learning address locations based on the source MAC address of the frame and will build its CAM table.

#### Filtering and Forwarding

The second function of a switch is known as *frame switching* or filtering and forwarding, where the switch forwards traffic intelligently.

To do this, the switch uses the MAC address table to help it find where destinations are located.
When a frame is received on a port, the switch examines the destination MAC address in the frame header and looks for a corresponding entry in the MAC address table.

If the switch finds a matching entry, it forwards the frame out of the specified port.
If the port is the same port on which the frame was received (the source and destination are connected to the same port), the switch drops the frame.

If the switch dosen't find the entry in the MAC address table, the switch *floods* the frame out all of the remaining ports.

#### Loop Avoidance

The third function of a switch is to avoid layer 2 loops.
Having layer 2 loops on the network can cause serious problems with the network and even bring the network down.

We want to have multiple links between switches so there is a fault-tolerant pathway between the switches.

Having a lyer 2 loop can cause many problems, including instability in the MAC address table that confuses the switch and eventually causes the switch to distrust its MAC address table and flood all frames (acting as a hub).

**A layer 2 loop causes instability in the MAC address table**
![[Pasted image 20251013190131.png]]

For an example of how a loop can cause confusion, Computer A is sending data to ComputerB (destination MAC: bbbb.bbbb.2222).
When the data leaves Computer A, it is sent to the VAN-SW1 switch on port 3.
The VAN-SW1 checks to see if it has the destination MAC address of bbbb.bbbb.2222 in its CAM and finds it does not, so it then floods the frame to all ports.

This causes the frame to go out port 2 and 24 toward VAN-SW2.
When VAN-SW2 receives the frame, it records in the MAC address table that the sending ComputerA can be reached via port 1 and port 23 of the VAN-SW2 switch.

This is where one of the issues with layer 2 loops occurs: the switch will get confuesd about whether it can trust the data in the MAC address table, because the same system appears to be reached by two different ports.

To correct this problem, Cisco switches use STP, a loop prevention protocol that places one of the ports causing the loop in a blocking state.

If a port is in a blocking state, it cannot send or receive any data until it is placed back in a forwarding state.
STP will automatically detect when the other link goes down and will change the state to forwarding on the link that was originally blocked.

### Exercise 9-1: Verifying the Loop Avoidance Feature

![[Pasted image 20251013191022.png]]

**connect port 1 and port 24**
```
VAN-SW1#show spanning-tree summary
Switch is in pvst mode
Root bridge for: VLAN0001
Extended system ID           is enabled
Portfast Default             is disabled
PortFast BPDU Guard Default  is disabled
Portfast BPDU Filter Default is disabled
Loopguard Default            is disabled
EtherChannel misconfig guard is enabled
Configured Pathcost method used is short
UplinkFast                   is disabled
BackboneFast                 is disabled

Name                   Blocking Listening Learning Forwarding STP Active
---------------------- -------- --------- -------- ---------- ----------
VLAN0001                     0         0        0         16         16
---------------------- -------- --------- -------- ---------- ----------
1 vlan                       0         0        0         16         16
VAN-SW1#

VAN-SW2#show spanning-tree summary
Switch is in pvst mode
Root bridge for: none
Extended system ID           is enabled
Portfast Default             is disabled
PortFast BPDU Guard Default  is disabled
Portfast BPDU Filter Default is disabled
Loopguard Default            is disabled
EtherChannel misconfig guard is enabled
Configured Pathcost method used is short
UplinkFast                   is disabled
BackboneFast                 is disabled

Name                   Blocking Listening Learning Forwarding STP Active
---------------------- -------- --------- -------- ---------- ----------
VLAN0001                     1         0        0         15         16
---------------------- -------- --------- -------- ---------- ----------
1 vlan                       1         0        0         15         16
VAN-SW2#
```

**disconnect port 24**
```
VAN-SW1#show spanning-tree summary
Switch is in pvst mode
Root bridge for: VLAN0001
Extended system ID           is enabled
Portfast Default             is disabled
PortFast BPDU Guard Default  is disabled
Portfast BPDU Filter Default is disabled
Loopguard Default            is disabled
EtherChannel misconfig guard is enabled
Configured Pathcost method used is short
UplinkFast                   is disabled
BackboneFast                 is disabled

Name                   Blocking Listening Learning Forwarding STP Active
---------------------- -------- --------- -------- ---------- ----------
VLAN0001                     0        16        0          0         16
---------------------- -------- --------- -------- ---------- ----------
1 vlan                       0        16        0          0         16
VAN-SW1#


VAN-SW2#show spanning-tree summary
Switch is in pvst mode
Root bridge for: none
Extended system ID           is enabled
Portfast Default             is disabled
PortFast BPDU Guard Default  is disabled
Portfast BPDU Filter Default is disabled
Loopguard Default            is disabled
EtherChannel misconfig guard is enabled
Configured Pathcost method used is short
UplinkFast                   is disabled
BackboneFast                 is disabled

Name                   Blocking Listening Learning Forwarding STP Active
---------------------- -------- --------- -------- ---------- ----------
VLAN0001                     0         0       16          0         16
---------------------- -------- --------- -------- ---------- ----------
1 vlan                       0         0       16          0         16
VAN-SW2#
```

### Operation Modes

The switching method used affects how a layer 2 device receives, processes, and forwards a frame.

Bridges support only one switching methods, store-and-forward, while switches may support one, two, or three different switching methodss.

**Switching methods are supported by layer 2 devices**

* Store-and-forward
* Cut-through
* Fragment-free

#### Store-and-Forward Switching

*Store-and-Forward* swithcing is the most basic form of switching.

With store-and-forward switching, the layer 2 device must receive the entire frame into the buffer of the inbound port and will check the frame for errors (the FCS checksum field on the frame) before the switch will perform any addtional processing of the frame.

When checking the FCS, commonly called a *cyclic redundancy check (CRC)*, the switch will calculate a CRC value, just as the source did, and compare this value to what was included in the FCS of the frame.
If they are same, the frame is considered good, and the switch can forward the frame out the correct destination port of the switch.
If the FCS value in the frame and computed CRC value are different, the switch will drop the frame.

The advantage of store-and-forward is that the switch can check the frame for errors before forwarding it on.
The downfall is the wait time for the switch to read the entire frame, which is longer than that of the other methods.

#### Cut-Through Swithcing

Cut-Through switches were designed to improve the performance of a switch as it relates to processing frames.

With cut-through switching, the switch only waits to read the destination MAC address before it begins forwarding the frame.
Cut-through switching is faster than store-and-forward switching.

its biggest problem, though, is that the switch may be forwarding bad frames, through the header may be legible, the rest of the frame could be corrupted from a late collision.

#### Fragment-Free Switching

*Fragment-free* switching is a modified form of cut-through switching.

Whereas cut-through switching reads up to the destination MAC address field in the frame before making a switching decision, fragment-free switching makes sure that the frame is at least 64 bytes long before switching it (64 bytes is the minimum legal size of an Ethernet frame).

The goal of fragment-free switching is to reduce the number of Ethernet *runt frames* (frames smaller than 64 bytes) that are being switched.

Fragment-free switching is sometimes called *modified cut-through* or *runtless* switching.
With fragment-free switching, a switch could still be switching corrupt frames, because the switch is check only the first 64 bytes.

---

## Identifying Switch Components

### Chassis and Physical Ports

Every switch model will be a little bit different with regard to the type of interface that exists.
Older switches may have only Fast Ethernet (FE) interfaces, some may have mostly FE with Gigabit Ethernet (GE) interfaces to use as uplink ports, or current switches will have all GE interfaces at least.

![[Pasted image 20251013193719.png]]

GBIC (Gigabit Interface Converter) based ports that are used to insert GBIC modules to use as uplink ports.

The benefit of the GBIC-based port is that it can accept any type of module you want to insert into the port, such as an RJ-45 port to connect UTP cabling, or you could insert a GBIC module that enables you to use fiber-optic cabling.

The back side of the switch will have a place to connect the power cable and the console port to enable you to administer the device.
Note that on some switches, the console port is on the front of the switch instead of on the back.

### LEDs and Display Modes

![[Pasted image 20251013194015.png]]

When you power on the switch, the System and RPS LEDs light up to indicate the following: the System LED indicates the overall health status of the switch, while the RPS LED indicates the status of the RPS.

* **System**
	* Green
		* The system is powered on and operational
	* Amber
		* The system experienced a malfunction
	* Off
		* The system is powered down.
* **RPS**
	* Green
		* The RPS is attached and operational
	* Amber
		* The RPS is installed but is not opeational
	* Flashing amber
		* Both the internal power supply and the external RPS are installed, but the RPS is providing power
	* Off
		* The RPS is not installed

#### Mode Button

The meaning of the LED above each port on the front of the switch depends on the display mode setting.

You can change the display mode by pressing the Mode button. Just above the Mode button are four port-mode LEDs: STAT (status mode), UTIL (utilization mode), DUPLEX (duplex mode), and SPEED (speed mode).
By default, the STAT LED is lit, indicating that the LEDs above the Ethernet ports refer to the status of the port.

**Meaning of each LED color while in STAT mode**
* Green
	* A physical layer connection exists with a device attached to the port.
* Flashing green
	* Traffic is entering and/or leaving the port
* Amber
	* The port has been disabled manually (shut down) by the administrator, placed in a blocking state due to STP, or disalbed because of port security.
* Off
	* Not physical connection exists on the port.

If you push the Mode button, the STAT mode LED turns off and the UTIL LED lights up.

This means that each of the LEDs above the ports is showing information about the utilization on each port.

**The LEDs in utilization mode**
* If all ports have a green LED, the bandwidth utilization is above 50 percent
* If all ports except the last port are green, the bandwidth utilication of the switch is between 25 and 49 percent
* If all ports except the last two are green, the bandwidth the switch is less than 25 percent

If you press the Mode button once, the display mode LED will change from STAT to DUPLEX.
After changing to the DUPLEX mode, the LEDs above each of the ports will reflext the duplex setting of the associated port.

**Meaning of each LED in duplex mode**
* off
	* If the LED above the port is off, the port is set to half duplex
* Green
	* If the LED is green, the port is set to full duplex

If you press the Mode button again, and the display mode LED will change from DUPLEX to SPEED.
When the display mode is set to SPEED, the LEDs above the port refer to the speed at which port is operating:
* Off 
	* If the LED is off, the port is operating 10 Mbps
* Green
	* If the LED is solid green, the port is operating at 100 Mbps
* Blinking Green
	* If the LED is blinking green, the port is running at 1 Gbps.

If you press the Mode button again, the STAT LED will light.

Mode button to cycle through the different display modes to get information about each of the ports.

If the display mode LED is either DUPLEX or SPEED, it will automatically change back to STAT after 1 minute.

> If you don't have connectivity through the switch and the switch port LEDs are all off, make sure the switch is powered on.
> Reseat the cable connectors in their ports.
> Also check the cables to make sure they are the correct type: straight trough (connect different kind) vs. cross-over (connect simmilar kind)

---

## Basic Switch Configuration

### Initial Configuration Dialog

If no configuration has occurred before the switch boots up, the Internetwork Operating System (IOS) will run the setup script, commonly called the initial configuration dialog.

This script asks you questions to help create a basic configuration on the switch.
When posing questions, the setup script uses brackets ([]) to indicate default values.
Leaving an answer blank result in the script accepting the value indicated in brackets for the configuration component.

In the script, you can configure the switch's hostname, set up a privileged EXEC password, assign a password for the virtual type terminals (VTYs), and set up an IP address for a VLAN interface to manage the switch remotely.

### Basic Settings

You can change the configuration settings of your Cisco switch at any time using IOS commands.

#### Naming the device

```
Switch>enable
Switch#config t
Switch(config)#hostname VAN-SW1
VAN-SW1(config)#
```

Assigning an IP address

After you change the hostname, you may want to assign an IP address to your switch.

Note that a switch is a layer 2 device and does not need an IP address to perform its job of learning and forwarding frames on the network.

By assigning an IP address to a switch, however, you can remotely connect to the switch using HTTP, telnet, or SSH.
You can remotely manage it instead of depending on connecting through a local console port.

Switches work a bit differently from routers in the sense that you do not assign IP addresses to the ports of the switch.
The devices that are connected to the ports, such as computers have their IP addresses assigned.

To assign an IP address to a switch, you first navigate to a special VLAN interface and then assign the IP to the VLAN of the switch.

```
VAN-SW1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
VAN-SW1(config)#interface vlan1
VAN-SW1(config-if)#ip address 12.0.0.2 255.0.0.0
VAN-SW1(config-if)#no shutdown
VAN-SW1(config-if)#
*Oct 13 21:34:37.554: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
*Oct 13 21:34:38.554: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
VAN-SW1(config-if)#
```

#### Setting Up a Default Gateway

Once you've assigned the Ip address and subnet mask, you can remotely administer the switch as long as you are on the same network as the switch.

If you want to administer the switch from a different network, you must configure a default gateway so that the switch knows hot to send data off the network.

```
VAN-SW1>enable
VAN-SW1#config term
VAN-SW1(config)#ip default-gateway 12.0.0.1
```

### Exercise 9-2: Configuring a Switch

![[Pasted image 20251013213646.png]]

* Change Hostname
* Assign Ip address to switch (VAN-SW1: 12.0.0.2, LA-SW1: 14.0.0.2)
* setting up a default gateway (12.0.0.1, 14.0.0.1)
* verify (show interface vlan1)

**VAN-R1**

```
### check interfaces
# S1/0 -> to another router
# GigabitEthernet0/0 -> to switch
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
Ethernet0/0                unassigned      YES unset  administratively down down
GigabitEthernet0/0         unassigned      YES unset  administratively down down
Serial1/0                  unassigned      YES unset  administratively down down
Serial1/1                  unassigned      YES unset  administratively down down
Serial1/2                  unassigned      YES unset  administratively down down
Serial1/3                  unassigned      YES unset  administratively down down
FastEthernet2/0            unassigned      YES unset  administratively down down
FastEthernet2/1            unassigned      YES unset  administratively down down
GigabitEthernet3/0         unassigned      YES unset  administratively down down

### change hostname
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#hostname VAN-R1

### S1/0
VAN-R1(config)#interface S1/0
VAN-R1(config-if)#ip addr 13.0.0.1 255.0.0.0
VAN-R1(config-if)#no shutdown

### G0/0
VAN-R1(config-if)#interface G0/0
VAN-R1(config-if)#ip addr 12.0.0.1 255.0.0.0
VAN-R1(config-if)#no shutdown

### telnet configuration
VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#password telnetpass
VAN-R1(config-line)#login
VAN-R1(config-line)#

### save changed configuration
VAN-R1(config-if)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
[OK]
VAN-R1(config-if)#
```

**LA-R1**

```
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.

### Change hostname
R2(config)#hostname LA-R1

### S1/0
LA-R1(config)#interface S1/0
LA-R1(config-if)#ip addr 13.0.0.2 255.0.0.0
LA-R1(config-if)#no shutdown
LA-R1(config-if)#
*Oct 13 21:48:03.251: %LINK-3-UPDOWN: Interface Serial1/0, changed state to up
*Oct 13 21:48:04.259: %LINEPROTO-5-UPDOWN: Line protocol on Interface Serial1/0, changed state to up

### G0/0
LA-R1(config-if)#interface G0/0
LA-R1(config-if)#ip addr 14.0.0.1 255.0.0.0
LA-R1(config-if)#no shutdown
*Oct 13 21:48:38.367: %LINK-3-UPDOWN: Interface GigabitEthernet0/0, changed state to up
*Oct 13 21:48:39.367: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

### telnet config
LA-R1(config-if)#line vty 0 15
LA-R1(config-line)#password telnetpass
LA-R1(config-line)#login

### save changed configuration
LA-R1(config-line)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
[OK]
LA-R1(config-line)#
```

**serial connection between Routers check & telnet test**

**VAN-R1**

```
### PING TEST
VAN-R1#ping 13.0.0.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/20/28 ms

### TELNET TEST
VAN-R1#telnet 13.0.0.2
Trying 13.0.0.2 ... Open


User Access Verification

Password:
LA-R1>exit

[Connection to 13.0.0.2 closed by foreign host]
VAN-R1#
```

**LA-R1**

```
### PING TEST
LA-R1#ping 13.0.0.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/13/20 ms

### TELNET TEST
LA-R1#telnet 13.0.0.1
Trying 13.0.0.1 ... Open


User Access Verification

Password:
VAN-R1>exit

[Connection to 13.0.0.1 closed by foreign host]
LA-R1#
```

**VAN-SW1**

```
### set hostname
IOU1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU1(config)#hostname VAN-SW1

### set ip address
VAN-SW1(config)#

### Assign ip address
VAN-SW1(config)#interface vlan1
VAN-SW1(config-if)#ip address 12.0.0.2 255.0.0.0
VAN-SW1(config-if)#no shutdown
*Oct 13 21:55:02.178: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
*Oct 13 21:55:03.182: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

### set default gateway (12.0.0.1)
VAN-SW1(config-if)#exit
VAN-SW1(config)#ip default-gateway 12.0.0.1

### verify
VAN-SW1#show interface vlan1
Vlan1 is up, line protocol is up
  Hardware is Ethernet SVI, address is aabb.cc80.0100 (bia aabb.cc80.0100)
  Internet address is 12.0.0.2/8
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive not supported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     2 packets output, 120 bytes, 0 underruns
     0 output errors, 0 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     
### save changed configuration
VAN-SW1#copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
Compressed configuration from 1597 bytes to 924 bytes[OK]
VAN-SW1#
```

**LA-SW1**

```
### change hostname
IOU2#
IOU2#config t
Enter configuration commands, one per line.  End with CNTL/Z.
IOU2(config)#hostname LA-SW1

### assign ip address
LA-SW1(config)#interface vlan1
LA-SW1(config-if)#ip address 14.0.0.2 255.0.0.0
LA-SW1(config-if)#no shutdown
*Oct 13 21:59:19.740: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
*Oct 13 21:59:20.744: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up

### set default gateway
LA-SW1(config-if)#exit
LA-SW1(config)#ip default-gateway 14.0.0.1

### verify
LA-SW1(config)#do show interface vlan1
Vlan1 is up, line protocol is up
  Hardware is Ethernet SVI, address is aabb.cc80.0200 (bia aabb.cc80.0200)
  Internet address is 14.0.0.2/8
  MTU 1500 bytes, BW 1000000 Kbit/sec, DLY 10 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive not supported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts (0 IP multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     2 packets output, 120 bytes, 0 underruns
     0 output errors, 0 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out

### Save changed configuration
LA-SW1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
Compressed configuration from 1534 bytes to 884 bytes[OK]
LA-SW1(config)#
```

### MAC Address Table

You can view the MAC address table by using the `show mac address-table` command:

```
VAN-SW1#show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0050.7966.6800    DYNAMIC     Et1/1
   1    0050.7966.6801    DYNAMIC     Et1/0
   1    ca01.0545.0000    DYNAMIC     Et0/0
Total Mac Addresses for this criterion: 3
VAN-SW1#
```

In this example, you can see that three MAC addresses are stored in the CAM table.
Remember these are automatically created based on the switch receiving traffic trough these ports.

To clear dynamically learned entries from the CAM table, use the `clear mac address-table` command.

> On older Cisco switches, use the `show mac-address-table` and `clear mac-address-table` commands.

### Static MAC Address

You can manually create static entries.
The benefit of static entries is that they are part of your switch configuration, so they are retained even if the switch is rebooted (whereas dynamic entries are lost after a reboot and must be learned again).

To add a static entry in the MAC address table:

```
Switch(config)#mac address-table static MAC_ADDR
                     vlan VLAN_#
                     interface TYPE
```

```
Switch(config)#mac address-table static 0000.1111.2222 vlan 1 int g1/0/8
```

In addition to specifying the MAC address of the device and the interface where the device is located, you must also specify the VLAN in which the device located.

Use the `show mac-address-table` command to view your new entries.
To remove a static entry from the CAM table, preface the command with `no` parameter.

> Statically configuring MAC addresses on the switch is not commonly done today.
> If configured, static entries are typically used for network devices, such as servers and routers.
> If you are concerned about controlling what device is connected to a specific port on the switch, use the port security feature.

### Exercise 9-3: Working with the MAC Address Table

* View MAC address table
* Add a static MAC address to the MAC address table

```
VAN-SW1#show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    ca01.0545.0000    DYNAMIC     Et0/0
Total Mac Addresses for this criterion: 1

### ADD STATIC
VAN-SW1(config)#mac address-table static ca01.0545.0000 vlan 1 int Et0/0

### verify
VAN-SW1(config)#do show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    ca01.0545.0000    STATIC      Et0/0
Total Mac Addresses for this criterion: 1

### save configuration
VAN-SW1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
Compressed configuration from 1667 bytes to 971 bytes[OK]
VAN-SW1(config)#
```

---

## Interface Configuration

### Configuring Ports

You'll use several common commands to configure ports on a switch.

#### Adding a Port Description

You may want to add a description to the port that specifies what the port is used for.

```
VAN-SW1>enable
VAN-SW1#config term
VAN-SW1(config)#interface G1/0/1
VAN-SW1(config-if)#description UpLink Port
```

Once you have added a description to a port, you will see that lavel when you view the status of the interface with the `show interface g1/0/1` command.

#### Configuring Switch Speed

Most switches today have ports that supports 10 Mbps (Ethernet), 100 Mbps (Fast Ethernet), and 1000 Mbps (Gigabit Ethernet).

The switch will detect the speed of the device that is connected to it and run the port at that speed.
This *autodetect feature* sets the speed of the port.

To configure the speed on the port manually:
```
VAN-SW1>enable
VAN-SW1#config term
VAN-SW1(config)#interface g1/0/1
VAN-SW1(config-if)#speed 1000
```

```
VAN-SW1(config-if)#speed ?
  10    Force 10 Mbps operation
  100   Force 100 Mbps operation
  1000  Force 1000 Mbps operation
  auto  Enable AUTO speed confiruation
```

To configure any of these settings on multiple ports at one time, use the `interface range` command:
```
VAN-SW1(config)#interface range g1/0/1 - 24
VAN-SW1(config-if-range)#speed 1000
```

#### Configuring Duplex Setting

You can configure the duplex setting on your ports by using the `duplex` command on the interface.

This setting also has an autodetect feature that detects the duplex setting of the device connected and then sets the duplex setting on the port to match it.

Note that you can set the duplex setting to `full` to send and receive data on the port at the same time, or set it to `half` to send and receive data, but not at the same time.

```
VAN-SW1#config term
VAN-SW1(config)#interface g0/1
VAN-SW1(config-if)#duplex ?
  auto  Enable AUTO duplex configuration
  full  Force full duplex operation
  half  Force half-duplex operation

VAN-SW1(config-if)#duplex full
```

#### Enabling and Disabling Ports

You will want to disable or enable a port on the switch from time to time.

For example, you may decide to disable port for security reasons, so that no one can use the port until you enable it.

##### Disable interfaces

To disable a port, navigate to the interface of the port you want to disable and then use the `shutdown` command.

```
VAN-SW1(config-if)#do show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  up                    up
Ethernet0/1            unassigned      YES unset  up                    up
Ethernet0/2            unassigned      YES unset  up                    up
Ethernet0/3            unassigned      YES unset  up                    up
Ethernet1/0            unassigned      YES unset  up                    up
Ethernet1/1            unassigned      YES unset  up                    up
Ethernet1/2            unassigned      YES unset  up                    up
Ethernet1/3            unassigned      YES unset  up                    up
Ethernet2/0            unassigned      YES unset  up                    up
Ethernet2/1            unassigned      YES unset  up                    up
Ethernet2/2            unassigned      YES unset  up                    up
Ethernet2/3            unassigned      YES unset  up                    up
Ethernet3/0            unassigned      YES unset  up                    up
Ethernet3/1            unassigned      YES unset  up                    up
Ethernet3/2            unassigned      YES unset  up                    up
Ethernet3/3            unassigned      YES unset  up                    up
Vlan1                  12.0.0.2        YES manual up                    up

### Single interface down
VAN-SW1(config-if)#interface E2/0
VAN-SW1(config-if)#shutdown
*Oct 13 23:18:25.732: %LINK-5-CHANGED: Interface Ethernet2/0, changed state to administratively down
*Oct 13 23:18:26.736: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet2/0, changed state to down

### ranged
VAN-SW1(config)#interface range E3/0 - 3
VAN-SW1(config-if-range)#shutdown
VAN-SW1(config-if-range)#
*Oct 13 23:18:58.254: %LINK-5-CHANGED: Interface Ethernet3/0, changed state to administratively down
*Oct 13 23:18:58.254: %LINK-5-CHANGED: Interface Ethernet3/1, changed state to administratively down
*Oct 13 23:18:58.254: %LINK-5-CHANGED: Interface Ethernet3/2, changed state to administratively down
*Oct 13 23:18:58.254: %LINK-5-CHANGED: Interface Ethernet3/3, changed state to administratively down
*Oct 13 23:18:59.254: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/0, changed state to down
*Oct 13 23:18:59.254: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/1, changed state to down
*Oct 13 23:18:59.254: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/2, changed state to down
*Oct 13 23:18:59.254: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/3, changed state to down

### verify
VAN-SW1(config-if-range)#do show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  up                    up
Ethernet0/1            unassigned      YES unset  up                    up
Ethernet0/2            unassigned      YES unset  up                    up
Ethernet0/3            unassigned      YES unset  up                    up
Ethernet1/0            unassigned      YES unset  up                    up
Ethernet1/1            unassigned      YES unset  up                    up
Ethernet1/2            unassigned      YES unset  up                    up
Ethernet1/3            unassigned      YES unset  up                    up
Ethernet2/0            unassigned      YES unset  administratively down down
Ethernet2/1            unassigned      YES unset  up                    up
Ethernet2/2            unassigned      YES unset  up                    up
Ethernet2/3            unassigned      YES unset  up                    up
Ethernet3/0            unassigned      YES unset  administratively down down
Ethernet3/1            unassigned      YES unset  administratively down down
Ethernet3/2            unassigned      YES unset  administratively down down
Ethernet3/3            unassigned      YES unset  administratively down down
Vlan1                  12.0.0.2        YES manual up                    up
VAN-SW1(config-if-range)#
```

##### Enable Interfaces

If a port has been disabled (administratively down), you can enable it with the `no shutdown` command.

```
VAN-SW1(config)#do show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  up                    up
Ethernet0/1            unassigned      YES unset  up                    up
Ethernet0/2            unassigned      YES unset  up                    up
Ethernet0/3            unassigned      YES unset  up                    up
Ethernet1/0            unassigned      YES unset  up                    up
Ethernet1/1            unassigned      YES unset  up                    up
Ethernet1/2            unassigned      YES unset  up                    up
Ethernet1/3            unassigned      YES unset  up                    up
Ethernet2/0            unassigned      YES unset  administratively down down
Ethernet2/1            unassigned      YES unset  up                    up
Ethernet2/2            unassigned      YES unset  up                    up
Ethernet2/3            unassigned      YES unset  up                    up
Ethernet3/0            unassigned      YES unset  administratively down down
Ethernet3/1            unassigned      YES unset  administratively down down
Ethernet3/2            unassigned      YES unset  administratively down down
Ethernet3/3            unassigned      YES unset  administratively down down
Vlan1                  12.0.0.2        YES manual up                    up

### single interface enable
VAN-SW1(config)#interface E2/0
VAN-SW1(config-if)#no shutdown
*Oct 13 23:20:59.244: %LINK-3-UPDOWN: Interface Ethernet2/0, changed state to up
*Oct 13 23:21:01.250: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet2/0, changed state to up

### ranged interfaces enable
VAN-SW1(config)#interface range E3/0 - 3
VAN-SW1(config-if-range)#no shutdown
*Oct 13 23:21:25.399: %LINK-3-UPDOWN: Interface Ethernet3/0, changed state to up
*Oct 13 23:21:25.399: %LINK-3-UPDOWN: Interface Ethernet3/1, changed state to up
*Oct 13 23:21:25.399: %LINK-3-UPDOWN: Interface Ethernet3/2, changed state to up
*Oct 13 23:21:25.399: %LINK-3-UPDOWN: Interface Ethernet3/3, changed state to up
*Oct 13 23:21:27.407: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/0, changed state to up
*Oct 13 23:21:27.407: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/1, changed state to up
*Oct 13 23:21:27.407: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/2, changed state to up
*Oct 13 23:21:27.407: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet3/3, changed state to up

### verify
VAN-SW1(config)#do show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  up                    up
Ethernet0/1            unassigned      YES unset  up                    up
Ethernet0/2            unassigned      YES unset  up                    up
Ethernet0/3            unassigned      YES unset  up                    up
Ethernet1/0            unassigned      YES unset  up                    up
Ethernet1/1            unassigned      YES unset  up                    up
Ethernet1/2            unassigned      YES unset  up                    up
Ethernet1/3            unassigned      YES unset  up                    up
Ethernet2/0            unassigned      YES unset  up                    up
Ethernet2/1            unassigned      YES unset  up                    up
Ethernet2/2            unassigned      YES unset  up                    up
Ethernet2/3            unassigned      YES unset  up                    up
Ethernet3/0            unassigned      YES unset  up                    up
Ethernet3/1            unassigned      YES unset  up                    up
Ethernet3/2            unassigned      YES unset  up                    up
Ethernet3/3            unassigned      YES unset  up                    up
Vlan1                  12.0.0.2        YES manual up                    up
VAN-SW1(config)#
```

#### Verifying Port Settings

Once you have configured the settings you want on the interface, you must verify the settings are correct.

When troubleshooting communication issues, you typically want to check the status on the interface by using the `show interfaces` command and then speicifying the interface you want to check.

```
VAN-SW1(config)#do show interface E0/0
Ethernet0/0 is up, line protocol is up (connected)
  Hardware is AmdP2, address is aabb.cc00.0100 (bia aabb.cc00.0100)
  MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Auto-duplex, Auto-speed, media type is unknown
  input flow-control is off, output flow-control is unsupported
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input 00:00:03, output 00:00:01, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/2000/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/0 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     550 packets input, 59812 bytes, 0 no buffer
     Received 77 broadcasts (0 multicasts)
     0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 input packets with dribble condition detected
     3340 packets output, 239451 bytes, 0 underruns
     9 output errors, 9 collisions, 0 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
VAN-SW1(config)#
```

### Exercise 9-4: Configuring Interfaces on a Switch

* Add description
	* `VAN-SW(config-if)#description MY_DESC`
* disable port
	* `VAN-SW(config-if)#shutdown`
* enable port
	* `VAN-SW(config-if)#no shutdown`

### Understanding Port Security

*Port security* is a switch feature that enables you to lock down switch ports based on the MAC address or addresses associated with the interfaces; this prevents unauthorized access to a LAN.

For example, you could configure port security on port g0/5 for the MAC address of aaaa.aaaa.1111, specifying that the system with that MAC address is the only authorized device for that port.
If any other system connects to that port, a security violation results.

As an administrator, you control what should happen when a violation occurs, be it generateing a notification about the issue, dropping traffic for the MAC address that causes the violation, or completely disabling the port where the violation occured.

The port security feature will not work on trunk ports, Switch port Analyzer (SPAN) ports, and EtherChannel ports.
However, it is compatible with 802.1X and voice VLANs.

#### Port Security Configuration

The port security feature is configured per interface with a number of `switchport` commands.

```
VAN-SW1(config)#interface E1/0
VAN-SW1(config-if)#switchport mode access
VAN-SW1(config-if)#switchport port-security
VAN-SW1(config-if)#switchport port-security maximum ?
  <1-4097>  Maximum addresses

VAN-SW1(config-if)#switchport port-security maximum 1
VAN-SW1(config-if)#switchport port-security violation ?
  protect   Security violation protect mode
  restrict  Security violation restrict mode
  shutdown  Security violation shutdown mode

VAN-SW1(config-if)#switchport port-security violation protect
VAN-SW1(config-if)#do show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0050.7966.6800    DYNAMIC     Et1/1
   1    ca01.0545.0000    STATIC      Et0/0
Total Mac Addresses for this criterion: 2
VAN-SW1(config-if)#switchport port-security mac-address 0050.7966.6800
VAN-SW1(config-if)#
```

First, you must enter the appropriate interface where you want to set up port security.

The second command, `switchport mode access`, places the interface in access mode, which is used by a host instead of as a trunk port.

The third command on the interface, `switchport port-security` enables port security (it is disabled by default).

The fourth command, `switchport port-security maximum`, specifies the maximum number of devices that can be associated with the interface.
This defaults to 1 and can range from 1 to 132.

The fifth command on the interface specifies what should occur if a security violation occurs. (a different MAC address is connected to the port)
Three options are possible:
* **Protect**
	* This command sends an alert to the administrator when an unauthorized device is connected to the port.
* **Restrict**
	* The `restrict` setting results in the port being able to forward frames for the authorized device only.
	* If an unauthorized device connects to the port, the switch will drop those frames.
* **Shutdown**
	* With this command, the port is disabled the second an authorized device connects to the port.
	* The port is disabled until the administrator issues the `no shutdown` command.
	* This is the default violation mode if you don't specify the mode.

The las command lets you specify the exact MAC address that is allowed to be associated with this interface.

#### Sticky Learning

Port security is a great feature and very common on networks to prevent unauthorized devices from connecting an enabled port on the switch.
The problem is, however, that is poses a huge administrative burden to set up, because you have to specify the MAC address of authrorized devices on each port.

There is a solution to cut down on the administrative burden: use the *sticky* option instead of a MAC address.

When you use the *sticky* option, the switch will dynamically learn the MAC address of the system already connected to the port and then configure the port security feature using that MAC address.

```
VAN-SW1(config)#interface range E1/0 - 3
VAN-SW1(config-if-range)#switchport mode access
VAN-SW1(config-if-range)#switchport port-security
VAN-SW1(config-if-range)#switchport port-security maximum 1
VAN-SW1(config-if-range)#switchport port-security violation shutdown
VAN-SW1(config-if-range)#switchport port-security mac-address sticky
VAN-SW1(config-if-range)#
```

#### Port Security Verification

`show port-security`

```
VAN-SW1#show port-security
Secure Port  MaxSecureAddr  CurrentAddr  SecurityViolation  Security Action
                (Count)       (Count)          (Count)
---------------------------------------------------------------------------
      Et1/0              1            1                  0         Shutdown
      Et1/1              1            0                  0         Shutdown
      Et1/2              1            0                  0         Shutdown
      Et1/3              1            0                  0         Shutdown
---------------------------------------------------------------------------
Total Addresses in System (excluding one mac per port)     : 0
Max Addresses limit in System (excluding one mac per port) : 4096
VAN-SW1#
```

To see the MAC address that are statically defined or dynamically learned with port security, use the `show port-security address` command:
```
VAN-SW1#show port-security address
               Secure Mac Address Table
-----------------------------------------------------------------------------
Vlan    Mac Address       Type                          Ports   Remaining Age
                                                                   (mins)
----    -----------       ----                          -----   -------------
   1    0050.7966.6800    SecureConfigured              Et1/0        -
-----------------------------------------------------------------------------
Total Addresses in System (excluding one mac per port)     : 0
Max Addresses limit in System (excluding one mac per port) : 4096
VAN-SW1#
```

If you want to see a bit more port security detail on a specific port, use the `show port-security interface`

```
VAN-SW1#show port-security interface E1/0
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 1
Sticky MAC Addresses       : 0
Last Source Address:Vlan   : 0050.7966.6804:1
Security Violation Count   : 0

VAN-SW1#
```

### Exercise 9-5: Configuring Port Security on a Cisco Switch

* Enable port security
* verify that port security

```
### mac address check

LA-SW1#show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0050.7966.6802    DYNAMIC     Et1/0
   1    0050.7966.6803    DYNAMIC     Et1/1
   1    ca02.0561.0000    STATIC      Et0/0
Total Mac Addresses for this criterion: 3

### port security enable
LA-SW1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
LA-SW1(config)#interface range E1/0 - 3
LA-SW1(config-if-range)#switchport mode access
LA-SW1(config-if-range)#switchport port-security
LA-SW1(config-if-range)#switchport port-security max 1
LA-SW1(config-if-range)#switchport port-security violation shutdown
LA-SW1(config-if-range)#switchport port-security mac-address sticky
LA-SW1(config-if-range)#exit

### E0/0 (to router) static
LA-SW1(config)#mac address-table static ca02.0561.0000 vlan 1 int E0/0

### verify
LA-SW1(config)#do show port-security
Secure Port  MaxSecureAddr  CurrentAddr  SecurityViolation  Security Action
                (Count)       (Count)          (Count)
---------------------------------------------------------------------------
      Et1/0              1            0                  0         Shutdown
      Et1/1              1            0                  0         Shutdown
      Et1/2              1            0                  0         Shutdown
      Et1/3              1            0                  0         Shutdown
---------------------------------------------------------------------------
Total Addresses in System (excluding one mac per port)     : 0
Max Addresses limit in System (excluding one mac per port) : 4096

### verify with address
LA-SW1(config)#do show port-security address
               Secure Mac Address Table
-----------------------------------------------------------------------------
Vlan    Mac Address       Type                          Ports   Remaining Age
                                                                   (mins)
----    -----------       ----                          -----   -------------
   1    0050.7966.6802    SecureSticky                  Et1/0        -
   1    0050.7966.6803    SecureSticky                  Et1/1        -
-----------------------------------------------------------------------------
Total Addresses in System (excluding one mac per port)     : 0
Max Addresses limit in System (excluding one mac per port) : 4096

### verify in interface-basis
LA-SW1(config)#do show port-security interface E1/0
Port Security              : Enabled
Port Status                : Secure-up
Violation Mode             : Shutdown
Aging Time                 : 0 mins
Aging Type                 : Absolute
SecureStatic Address Aging : Disabled
Maximum MAC Addresses      : 1
Total MAC Addresses        : 1
Configured MAC Addresses   : 0
Sticky MAC Addresses       : 1
Last Source Address:Vlan   : 0050.7966.6802:1
Security Violation Count   : 0

LA-SW1(config)#
```

---

## Working with VLANs

A *virtual LAN* (VLAN) is a logicla grouping of network devices in the same broadcast domain that can span across multiple switches.

**Simple VLAN**
![[Pasted image 20251014021508.png]]

Every device is i a both the same collision and broadcast domains.
In this example, a hub is providing the connectivity, witch represnets, to the devices connected to it, that the segment is a logical segment.

**Example of a switch with four PCs connected to it**
![[Pasted image 20251014021629.png]]
One major difference between the switch and the hub is that all devices connected to the hub are in the same collisioin domain, whereas in the switch example, each port of the switch is a separate collision domain.
In this example, however, the configuration of the switch places PC-E and PC-F in one broadcast domain (VLAN) and PC-G and PC-F in another broadcast domain.

Switches are used to create VLANs, or separate broadcast domains.
VLANs are not restricted to any physical boundary in the switched network, assuming that all the devices are interconnected via switches and that there are no interventing layer 3 devices.

For example, a VLAN could be spread across multiple switches, or it could be contained in the same switch.

![[Pasted image 20251014022017.png]]
This example shows three VLANs.
Notice that VLANs are not tied to any physical location: PC-A, PC-B, PC-E, and PC-F are in the same VLAN but are connected to different ports of different switches.

However, a VLAN could be contained to oen switch, as PC-C and PC-D are connected to SwitchA.

The switches in your network maintain the integrity of your VLANs.
For example, if PC-A generates a broadcast, SwitchA and SwitchB will see the broadcast, and that other devices will not, and that holds true even across switches.

### Subnets and VLANs

Logically speaking, VLANs are also subnets. A subnet, or a network, is a contained broadcast domain.
A broadcast that occurs in one subnet will not be forwarded, by default, to another subnet.

Routers, or layer 3 devices, provide this boundary function.
Each of these subnets requires a unique network number.
And to move from one network number to another, you need a router.

In the case of broadcast domains and switches, each of these separate broadcast domains is a separate VLAN; therefore, you still need a routing function to move traffic between different VLANs.

**Logical topology using VLANs**
![[Pasted image 20251014170227.png]]

From the user's perspective, the devices know that to reach another VLAN (subnet), they must forward their traffic to the default gateway address in their VLAN (the IP address on their router's interface).

Switch can handle multiple VLANs on a single port, and a router can route between those VLANs on the same sinel port if that port is designated as a *trunk* port.
VLAN is a broadcast domain, so if you want to optimize traffic, it is recommended that a VLAN not exceed 500 devices.

### Scalability

Through segmentation of broadcast domains, VLANs increase your network's scalability.
Because VLANs are a logical construct, a user can be located anywhere in the switched network and still belong to the same broadcast domain.

If you move a user from one switch to another switch in the same switched network, you can still keep the user in his or her original VLAN.

This includes a move from one floor of a building to another floor or from one part of the campus to another.
The limitation is that user, when moved, must still be connected to the same layer 2 network.

> VLANs provided for location independence in a switched network: many logical network can use the same network infrastructure.
> This flexivility makes adding, changing, and moving of networking devices a simple process.
> It also enables you to group people together, perhaps according to their job function, which makes implementing your security policies easeir.
> Logically separating people using VLANs provides additional security, since traffic must traverse a layer 3 device to go from one VLAN to another, where you can use an access control list to filter traffic.

### VLANs and Traffic Types

VLANs not only to separate different types of user traffic (commonly separated  by job function), but also to separate based on the type of traffic, placing network management, multicast, and voice over IP (VoIP) traffic into their own distinctive VLANs.

Network management traffic is traffic generated by the different protocols and features of network devices in order to help discover, monitor, and maintain devices on the network.

Some examples of network management traffic may be SNMP traffic, CDP traffic, and syslog traffic.
Network management traffic may also involve device configuration backups and network upgrade traffic.

Multicast traffic is commonly used by video applications to transmit video streams intelligently from a server to one or more clients interested in seeing it, where UDP is used as a transport for the video stream.
An example of a video solution that uses multicasts is Cisco's IP/TV server.

Video traffic is delay sensitive, too much delay can be noticeable by the end user, because the actual video picture looks jumpy and jagged.
By separating this traffic from other types through VLANs, and by setting up the necessary quality of Service (QoS) for this VLAN traffic, you can help minimize or prevent dealy issues.

VoIP traffic includes two kinds of traffic: signaling information sent from the VoIP phones to the VoIP gateway products, and the actual voice conversations, which use UDP as a transport between VoIP phone and/or digital phones connected to VoIP PBXs.

One issue with VoIP traffic is that it is delay-sensitive, so mixing this kind of traffic with other data types can cause performance issues that are very noticeable on voice connections.
Therefore, separating this traffic in its own VLAN and using QoS to ensure that this kind of traffic is given higher priority than other types is an important design consideration.

Some Cisco Catalyst switches support a specical type of VLAN, called a *voice VLAN*.
With the voice VLAN feature, switches will automatically place a Cisco VoIP phone into the voice VLAN once the VoIP phone is plugged into the switch.
The advantage of this approach is that when a VoIP phone is added to the network, you, as administrator, no longer have to worry about configuring the switch to place the phone into the correct VLAN.

### VLAN Membership

A device's membership in a VLAN can be determined by one of three methods: static, dynamic, or voice.
These methods affect how a switch will associate a port in its chassis with a particular VLAN.

When you are dealing with static VLANs, you must manually assign a port on a switch to a VLAN using an *interface subconfiguration* mode command.
VLANs configured in this way are typically called *port-based* VLANs.

With dynamic VLANs, the switch automatically assigns the port to a VLAN using information from the user device, such as its MAC address, IP address, or even directory information (a user or group name, for instance).
The switch the consults a policy server, called a *VLAN membership policy server (VMPS)*, which is proprietary to Cisco and contains a mapping of device information to VLANs.
One of the switches in your network must be configured as this server.

Another option is to use 802.1X authentication, which is used to authenticate a device's access to a switch or wireless access point.
The authentication credentials are stored on an authentication server.
One policy you can assign to the user account (associated with the authenticating device) on the authentication server is the VLAN to which the device belongs (the server can pass this to the layer 2 device, which in turn, can associate the VLAN to the port with which the authenticated device is associated).

Dynamic VLANs have one main advantage over static VLANs: they support plug-and-play movability.
For instance, if you move a PC from a port on one switch to a port on another switch and you are using dynamic VLANs, the new switch port will automatically be configured for the VLAN to which the user belongs.
About the only time that you have to configure information with dynamic VLANs is if you hire an employee and the employee leaves the company or changes job functions.

If you are using static VLANs, not only will you have to configure the switch port manually with this updated information, but, if you move the user from one switch to another, you will also have to perform this manual configuraiton to refect the user's new port.
One advantage, though, that static VLANs have over dynamic VLANs is that the configuration process is easy and straightforward.
Dynamic VLANs require a lot of initial preparation involving matching users to VLANs.

Voice VLANs are unique. They are associated to ports that have VoIP phones attached.
Some VoIP phones may have a multiport switch attached to them to enable other devices to connect to the switch via the phone.
In this instance, the phone may tag frames to indicate which device is sending the traffic so that the switch can then deal with the traffic correctly.


---

## VLAN Connections

When dealing with VLANs, switches support two types of switch ports: access ports and trunk ports.

When setting up your switches, you will need to know what type of connection an interface should use and then configure it appropriately.

### Access Ports

An *access port* provides a connection to a device that has a standardized Ethernet NIC that understands only standardized Ethernet frames, in other words, a normal NIC that understands IEEE 802.3 and Ethernet II frames.

Access port connections can be associated only with a single VLAN (voice VLAN ports are an exception to this).
This means that any device or devices connected to this port will be the same broadcast domain.

For example, if ten users are connected to a hub, and you plug the hub into access port interface on a switch, then all of these users will belong to the same VLAN that is associated with the switch port.

If you wanted five users on the hub to belong to one VLAN and the other five to a different VLAN, you would need to purchase and additional hub and plug each hub into a different switch port.
Then, on the switch, you would need to configure each of these ports with the correct VLAN identifier.

> Access port is used to connect an end-point device, such as a server, a workstation, or a laptop, to the network via that port.
> An access port is typically associated with a single VLAN.

### Trunk Ports for Interswitch Connectivity

Unlike access ports, *trunk* ports are capable of carring traffic for multiple VLANs and are configured on ports that are connecting to other switches.

To support trunking, the original Ethernet frame must be modified to carry VLAN information, commonly called a *VLAN identifier* or number.
This ensures that the broadcast integrity is maintained.

For instance, if a device from VLAN 1 has generated a broadcast and the connected switch has received it, when this switch forwards it to other switches, these switches need to know the VLAN origin so that they can forward this frame out only VLAN 1 ports and not other VLAN ports.

Cisco supports two Ethernet trunking methods:
* Cisco's proprietary InterSwitch Link (ISL) protocol for Ethernet
* IEEE 802.1Q, commony referred to as *dot1q* for Ethernet

#### Trunk Tagging

Trunking methods create the illusion that instead of a single physical connection between the two trunking devices, a separate logical connection exists for each VLAN between them.

When trunking, the switch adds the source port's VLAN identifier to the frame so that the device (typically a switch) at the other end of the trunk understands what VLAN originated this frame and the destination switch can make intelligent forwarding decisions on not just the destination MAC address, but also the source VLAN identifier.

Since information is added to the original Ethernet frame, normal NICs will not understand this information and will typically drop the frame.
Therefore, you need to ensure that when you set up a trunk connection on a switch's interface, the device at the other end also supports the same trunking protocol and has it configured.

The modification of these frames, commonly called *tagging*, is done in harware by application-specific circuits (ASICs).
Since tagging is done in hardware at faster than wire speeds, no latency is involved in the actual tagging process.
And to ensure compatibility with access port devices, switches will strip off the tagging information and forward the original Ethernet frame to the device or devices connected to access port connections.

From user's perspective, the source generates a normal Ethernet frame and the destination receives this frame, which is an Ethernet 802.3 or II frame coming in and the same going out.
In reality, this frame is tagged as it enters the switched infrastructure and sheds the tag as it exits the infrastructure; the process of tagging and untagging the frame is hidden from the users connected to access ports.

#### Trunk-Capable Devices

Trunk links are common between certain types of devices, including switch-to-switch, switch-to-rotuer, and switch-to-file server connections.

Using a trunk link on a router is a great way of reducing your layer 3 infrastrucutre costs.
For instance, in the old days of bridging, in order to route between different broadcast domains, you needed a *separate* physical router interface for each broadcast domain.

So if you had two broadcast domains, you needed two router ports; if you had 20 broadcast domains, you needed 20 router ports.
As you can see, the more broadcast domains you had with bridges, the more expensive the router would become.

Today, with the advent of VLANs and trunk connections, you can use a single port on a router to route between your multiple broadcast domains.

Whether you have 2 or 20 broadcast domains, you can use just one port on the router to accomplish the routing between these different subnets.
Of course, you need a router and an interface that support trunking.
Not every Cisco router supports trunking.
If your router doesn't support trunking, you would need a separate router interface for each VLAN you created to route between the VLANs.
Therefore, if you have a lot of VLANs, it makes sense to economize and buy a router and the correct type of interface that supports trunking.

You can also purchase specialized NICs for PCs or servers, such as file servers or virtualization servers, that support trunking.
For instance, suppose you want multiple VLANs to access a file server.

You could use normal NIC and set it up with an access port connection to a switch. Because this is an access port connection, the server could belong only to one VLAN.
The users in the same VLAN, when accessing the server, would have all their traffic switched via layer 2 devices to reach it.
Users in other VLANs, however, would require that their traffic be routed to this server via a router, since the file server is in a different broadcast doamin.

> If the same VLANs are on two connected switches, use a trunk connection between the switches to enable the associated VLANs on each side to communicate with each other.
> Trunk connections are commonly used on routers so that routers, via subinterfaces, can route between the VLANs.
> The trunking encapsulation, however, must match between the two trunking devices (such as using 802.1Q on both sides, or Cisco's proprietary ISL on both sides).

It throughput is a big concern, you may want to buy a trunk NIC for the file server.

Configuring this NIC is different from configuring a normal NIC on a file server.
For each VLAN in which you want the file server to participate, you would create a virtual NIC, assign your VLAN identifier and layer 3 addressing to the virtual NIC for the specific VLAN, and then associate it with the physical NIC.

Once you have created all of these logical NICs on your file server, you need to set up a trunk connection on the switch to the server.
And once you have done this, members of VLANs in the switched network will be able to access the file server directly without going through a router.

> A good example of a device that may need a trunk-capable NIC is DHCP server, because it may need to assign IP addresses to users across multiple VLANs.
> If you don't have a trunk-capable NIC, but users are spread across multiple VLANS, you could use the IP helper feature on a Cisco router connected to the users' VLANs and have the router forward the DHCP broadcasts to the DHCP server located in a different VLAN.
> Another example of a device that may need a trunk-capable NIC is a server in a data center: this is commonly necessary to support the many VMs running on the server.

#### Trunking Example

**Example of trunk connection between SwitchA and SwitchB in a network**
![[Pasted image 20251014184137.png]]

In this example, PC-A, PC-F, and PC-H belong to one VLAN; PC-B and PC-c, PC-D, and PC-E belong to a thrid VLAN.

The trunk between the two switches is also tagging VLAN information so that the remote switch understands the source VLAN of the originator.

**Broadcast Traffic**
![[Pasted image 20251014184521.png]]

In this example, PC-C generates a local broadcast.
When SwitchA receives the broadcast, it examines the incomming port and knows that the source deivce is from gray VLAN (the access port connections are marked with dots).
Seeing this, the swith knows to forward this frame only out of ports that belong to the same VLAN: this includes access port connections with the same VLAN identifier and trunk connections.
On this switch, one access port connection belongs to the same VLAN, PC-D, so the switch forwards the frame directly out this interface.

The trunk connection between SwitchA and SwitchB handles traffic for multiple VLANs.
A VLAN tagging mechanism is required to differentiate the source of traffic when moving it between the switches.
For instance, assume that no tagging mechanism took place between the switche. PC-C geneartes a braodcast frame, and SwitchA forward it unaltered to PC-D and then SwitchB across the trunk.

The problem with this process is that when SwitchB receives the original Ethernet frame, it has no idea what port or ports to forward the broadcast to, since it dosen't know the origin VLAN.

SwitchA tags the broadcast frame, adding the source VLAN to the original Ethernet frame (the broadcast frame is tagged).
When SwitchB receives the frame, it examines the tag and knows that this is meant only for the VLAN to which PC-E belongs.

Of course, since PC-E is connected via an access port connection, SwitchB first srips off the tagging and then forwards the original Etherenet frame to PC-E.
This is necessary because PC-E has a standard NIC and dosen't understand VLAN tagging.
Through this process, both switches maintain the integrity of the broadcast domain.

#### IEEE 802.1Q

InterSwitch Link (ISL), a Cisco proprietary protocol, is being phased out in Cisco's products and being replaced with the IEEE 802.1Q trunking standard, which was introduced in 1998.

One of the advantages provided by the IEEE standard is that it allows trunks between different vendors' devices, whereas ISL is supported only on certain Cisco devices.
Therefore, by using 802.1Q you should able to implement a multivendor trunking solution without having to worry about whether or not a specific type of trunk connection is or is not supported.

The 2960 and better switches, along with Cisco's higher-end switches such as the 6500 series, support 802.1Q.
Actually, the new switch models support *only* 802.1Q trunking, they don't support ISL at all.

802.1Q trunking is supported on switch ports that are capable of either Fast Ethernet or Gigabit Ethernet speeds.

802.1Q trunks support two types of frames: tagged and untagged.
An untagged frame does not carry andy VLAN identification information in it, basically, this is a standard, unaltered Ethernet frame.

The VLAN membership for the frame is determined by the switch's port configuration: if the port is configured in VLAN 1, the untagged frame belongs to VLAN 1.
This VLAN is commonly called a *native* VLAN.

A tagged frame contains VLAN information, and only other 802.1Q-aware devices on the trunk will be able to processthis frame.

One of the unique aspects of 802.1Q trunking is that you can have *both* tagged and untagged frames on a trunk connection.

**trunk and native VLAN**
![[Pasted image 20251014194049.png]]

In this example, the withe VLAN (PC-A, PC-B, PC-E, and PC-F) uses tagged frames on the trunk line would need to have 802.1Q trunking enabled to see the tag inside the frame to determine the source VLAN of the frame.

In this network, a third device is connected to the trunk connection: PC-G.
This example assumes that a hub connectes the two switches and the PC together.

PC-G has a normal Etherenet NIC and obviously wouldn't understand th tagging and would drop these frames.
However, this presents a problem: PC-G belongs the dark VLAN, where PC-C and PC-D are also members.
Therefore, in order for frames to be forwarded among these three members, the trunk must also support untagged frames so that PC-G can process them.

To set this up, you would configure the switch-to-switch connection as an 802.1Q trunk but set the native VLAN as the dark one, so that frames from this VLAN would go untagged across it and would allow PC-G to process them.

One restriction placed on an 802.1Q trunk configurition is that it must be the *same* on both sides.
In order words, if the dark VLAN is the native VLAN on one switch, the switch at the other end must have the native VLAN set to the dark VLAN.
Likewise, if the white VLAN is having its frames tagged on one switch, the other switch must also be tagging the white VLAN frames with 802.1Q information.

With the 802.1Q tagging method, the original Ethernet frame is modified.
A 4-byte *tag* field is *inserted* into the header of the original Ethernet frame, and the original frame's FCS (checksum) is recomputed on the basis of this change.

The first 2 bytes of the tag are the protocol identifier.
For instance, an Ethernet type frame has a protocol identifier value of 0x8100, indicating that this is an Ethernet tagged frame.

The next 3 bits are used to prioritize the frame, which is defined in the IEEE 802.1p standard.

The fourth bit indicates if this is an encapsulated Token Ring frame, and the last 12 bits are used  for the VLAN identifier.

**802.1Q framing process**
![[Pasted image 20251014194849.png]]

Step 1 is the normal, untagged Ethernet frame header.
Step 2 inserts the tag and recomputes a new FCS value.
Below step 2 is a blowup of actual TAG field.

The tag is inserted directly after the source and destination MAC addresses in the Ethernet header.

One advantage of using this tagging mechanism is that, since you are adding only 4 bytes, your frame size will not exceed 1518 bytes, and thus you could actually forward 802.1Q frames through the access port connections of switches, since these switches would forward the frame as a normal Ehternet frame.

### Configuring Trunks

Configuring a port as a trunk port enables it to carry VLAN traffic from one switch to another across the trunk port.

You should first familiar with a protocol that is used to form a trunk between two devices: the Dynamic Trunk Protocol.

#### Dynamic Trunk Protocol

Cisco's proprietary *Dynamic Trunking Protocol (DTP)* is used to form and verify a trunk connection dynamically between two Cisco switches using a trunk connection.

If supports five trunking modes:

| mode         | Generate DTP Messages | Default Frame Tagging |
| ------------ | --------------------- | --------------------- |
| On or trunk  | Yes                   | Yes                   |
| Desirable    | Yes                   | No                    |
| Auto         | No                    | No                    |
| No-negotiate | No                    | Yes                   |
| Off          | No                    | No                    |

If the trunk mode is set to *on* or *trunk* for an interface, it causes the interface to generate DTP messages on the interface and to tag frames on the interface, based on the trunk type (802.1Q).

When set to *on*, the trunk interface always assuems the connection is trunk, even if the remote end does not support trunking.
Most newer Cisco switchs use term *trunk* instead of *on*.

If the trunk mode is set to *desirable*, the interface will generate DTP messages on the interface, but it will make the assumption that the other side is not trunk-capable and will wait for a DTP reply message from the remote side.
In this state, the interface stars as an access port connection.

If the remote side sends a DTP message, and this message indicates that trunking is compatible between the two switches, a trunk will be formed and the switch will start tagging frames on the interface.

If the other side does not support trunking, the interface will remain as an access port connection.

If the trunk mode is set to *auto*, the interface passively listens for DTP messages from the remote side and leaves the interface as an access port connection.

If the interface receives a DTP message, and the message matches trunking capabilities of the interface, then the interface will change from an access port connection to a trunk connection and start tagging frames.
This is the default DTP mode for a Cisco switch interface that is trunk-capable.

If an interface is set to *no-negotiate*, the interface is set as a trunk connection and will automatically tag frames with VLAN information; however, the interface will not generate DTP message: DTP is disabled.

This mdoe is typically used when connecting trunk connections to non-Cisco devices that don't understand Cisco's proprietary trunking protocol and thus won't understand the contents of these messages.

If an interface is set to *off*, the interface is configured as an access port.
No DTP messages are generated in this mode, nor are frames tagged.

**Forming Trunks**

| Your Switch  | Remote Switch       |
| ------------ | ------------------- |
| On           | On, desirable, auto |
| Desirable    | On, desirable, auto |
| Auto         | On, desriable       |
| No-negotiate | No-negotiate        |

In this table, one side needs to be configured as either *on* or *desirable* and the other side as *on*, *desirable*, or *auto*, or both switches need to be configured as *no-negotiate*.

Note that if you use the no-negotiate mode, trunking is formed but DTP is not used, whereas if you use on, desirable, or auto, DTP is used.

One advantage that DTP has over no-negotiate is that DTP checks for the trunk's characteristics: if they don't match on the two sides (for instance, as to the type of trunk or a mismatch with the natvie VLAN), then the trunk will not come up and the interfaces will remain as an access port connection.

With no-negotiate, if the trunking characteristics don't match on the two sides, the trunk connection will probably fail.

#### Switch Trunk Configuration

```
switch(config)#interface TYPE
switch(config-if)#switchport trunk encapsulation dot1q
switch(config-if)#switchport mode ?
  access        Set trunking mode to ACCESS unconditionally
  dot1q-tunnel  set trunking mode to TUNNEL unconditionally
  private-vlan  Set private-vlan mode
  trunk         Set trunking mode to TRUNK unconditionally
switch(config-if)#switchport mode trunk
```

Remember that newer Cisco switches support only 802.1Q trunking, so you must set up a trunk connection only to other 802.1Q trunking devices.

If you want to a trunk to be in an *on* state, use the `trunk` parameter.
For a *desirable* DTP state, use `dynamic auto`. The default mode is auto. If you don't want to use DTP but still want to perform trunking, use the `nonegotiate` parameter.
For 802.1Q trunks, the native VLAN is VLAN 1. You can change this with the `switchport trunk native vlan` command:

```
LA-SW1(config-if)#switchport trunk native ?
  vlan  Set native VLAN when interface is in trunking mode

LA-SW1(config-if)#switchport trunk native vlan ?
  <1-4094>  VLAN ID of the native VLAN when this port is in trunking mode
```

But, then you'll need match up the native VLAN on all switches in the layer 2 network.

If two interconnected switches have a different native VLAN on the connecting trunks, then traffic from one VLAN on one switch will end up in a different VLAN on the remote switch, which can create all kinds of problems.

After you have configured your trunk connection, you can use this command to verify it:
```
switch#show interface TYPE switchport|trunk

---------------------------------------------------------------------

LA-SW1(config-if)#do show interface E2/0 switchport
Name: Et2/0
Switchport: Enabled
Administrative Mode: trunk
Operational Mode: trunk
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: dot1q
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
Administrative Native VLAN tagging: enabled
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk Native VLAN tagging: enabled
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk associations: none
Administrative private-vlan trunk mappings: none
Operational private-vlan: none
Trunking VLANs Enabled: ALL
Pruning VLANs Enabled: 2-1001
Capture Mode Disabled
Capture VLANs Allowed: ALL

Appliance trust: none

LA-SW1(config-if)#do show interface E2/0 trunk

Port        Mode             Encapsulation  Status        Native vlan
Et2/0       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Et2/0       1-4094

Port        Vlans allowed and active in management domain
Et2/0       1

Port        Vlans in spanning tree forwarding state and not pruned
Et2/0       1
```

> When executing the `show mac address-table` command, if you can see multiple MAC addresses associated with a single interface, this can indicate that the interface is a trunk connection or that the interface is an access port connection to another switch or hub.

### Creating VLANs

* The number of VLANs you can create is dependent on the switch model and IOS software
* Some VLANs are preconfigured on every switch, including VLAN 1 and 1002-1005 (1002-1005 are used in Token Ring and FDDI networks only).
	* These VLANs cannot be deleted
* To add or delete VLANs, your switch must use either VTP server or transparent mode.
* VLAN names can be changed, but VLAN numbers can't; you must delete a VLAN and re-add it in order to renumber it.
* All interfaces, by default, belong to VLAN 1.
* CDP, DTP, and VTP advertisements are sent in the native VLAN, which is VLAN 1 by default.
* Before you delete a VLAN, reassign any ports the current VLAN to another; if you don't any ports from the deleted VLAN will be inoperable.
* Unknown destination MAC addresses are flooded only in the VLAN in which the source MAC address resides.

You can create VLANs with the `vlan` command:

```
switch(config)# vlan VLAN_#
switch(config-vlan)# name VLAN_NAME
```

When you execute the `vlan` command, you have access to the VLAN subconfiguration mode, where you can enter your configuraiton parameters for the VLAN, such as its name.
Use the `no` parameter in front of the `vlan` command to delete the VLAN at any time.

Once you have created a VLAN, you need to assign the interfaces you want be part of that VLAN.
To assign a port to a VLAN, navigate to the port, ensure that it is running as an access port, and then assign it to a VLAN:
```
switch(config)# interface TYPE
switch(config-if)# switchport mode access
switch(config-if)# switchport access vlan VLAN_#
switch(config-if)# switchport voice vlan VLAN_#
```

Configure the port as an access port with the `switchport mode access` command.
The `switchport access vlan` comand assigns the port to a VLAN, while the `switchport voice vlan` command is used to specify the VLAN to be used for VoIP devices connected to the port.

This configuration enables you to connect a VoIP phone to the port and then have a computer connected to the phone(all sending data through the same port on the switch, but with different types of traffic going to different ports).

Note that the voice VLAN line of code is optional; if you just want to assign the port to a data VLAN, you need only the first three lines of code in the preceding code listing.

Once you have created and assigned your VLANs, you can use various `show` commands to review and verify your configuration.
The `show vlan` command display the list of VLANs and which ports are assigned to them:
```
LA-SW1(config-if)#do show vlan

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
                                                Et1/0, Et1/1, Et1/2, Et1/3
                                                Et2/1, Et2/2, Et2/3, Et3/0
                                                Et3/1, Et3/2, Et3/3
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
1    enet  100001     1500  -      -      -        -    -        0      0
1002 fddi  101002     1500  -      -      -        -    -        0      0
1003 tr    101003     1500  -      -      -        -    -        0      0
1004 fdnet 101004     1500  -      -      -        ieee -        0      0
1005 trnet 101005     1500  -      -      -        ibm  -        0      0

Primary Secondary Type              Ports
------- --------- ----------------- ------------------------------------------

LA-SW1(config-if)#
```

Add the `brief` parameter to this command, and it will not display the details for each VLAN at the bottom of the display.

```
LA-SW1(config-if)#do show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/0, Et0/1, Et0/2, Et0/3
                                                Et1/0, Et1/1, Et1/2, Et1/3
                                                Et2/1, Et2/2, Et2/3, Et3/0
                                                Et3/1, Et3/2, Et3/3
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
LA-SW1(config-if)#
```

You can also use the `show interface switchport` command to see a specific interface's VLAN membership information.

```
LA-SW1(config-if)#do show interface E0/0 switchport
Name: Et0/0
Switchport: Enabled
Administrative Mode: dynamic desirable
Operational Mode: static access
Administrative Trunking Encapsulation: negotiate
Operational Trunking Encapsulation: native
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
Administrative Native VLAN tagging: enabled
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk Native VLAN tagging: enabled
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk associations: none
Administrative private-vlan trunk mappings: none
Operational private-vlan: none
Trunking VLANs Enabled: ALL
Pruning VLANs Enabled: 2-1001
Capture Mode Disabled
Capture VLANs Allowed: ALL

Appliance trust: none
LA-SW1(config-if)#
```

### Basic Troubleshooting of VLANs and Trunks

Now that you know how to set up a VLAN-based network, you will probably eventually run into a problem that is related to your VLAN configuration.
Basically, you should check the following, in order, to determine the cause of the problem:

1. Check the status of your interface to determine whether it is a physical layer problem.
2. Check your switches' and routers' configurations to make sure nothing was added or changed.
3. Verify that your trunks are operational.
4. Verify that your VLANs are configured correctly and that the STP is functioning correctly.

#### Performance Problems

If you are experiencing slow performance or intermittent connection problems, you should first check statistics on the interfaces of your switch with the `show interfaces` command.

A few things can cause high number of errors or collisions. The most common is a mismatch is either the duplexing or the speed on a connection.
Examine the settings on both sides of the connection.
Also make sure that you are using the correct cableing type: DTE-to-DCE connection and crossover for a DTE-to-DTE or DCE-to-DCE connectiion.

And make sure that the cable does not exceed the maximum legal limit.
Also, make sure that the connected IC is not experiencing a hardware problem or failure.

#### Local Connection Problems

If you are attempting to access the console port of a switch or router, and all you see is garbage in your terminal session, this could indicate an incorrect terminal setting.
Usually the culprit is an incorrect baud rate.

Some devices allow you to perform an operating system upgrade via the console port, and an administrator might change it to the highest possible value but forget to change it back to 9600 bps.
If you suspect this, keep on changing your baud rate until you find the right speed.

If you are having problems accessing devices in the switched network, you can look at a few options.
First, is the device you are trying to reach in the same VLAN? If so, make sure that you are using the correct IP addressing scheme in the VLAN and that the two devices trying to share information have their ports in the same VLAN.

If the two devices are Cisco devices, you can use CDP to elicit some of this information, for instance the IP address, by using the `show cdp` command.

Is the switch learning about the devices in your network? You may want to examine your CAM tables and make sure that a port security violation is not causing your connectivity problem.

For VLAN information, use the `show` commands on your switches to check your VLAN configuration.
Also check the VLAN configuration on each switch and make sure the VLANs are configured with the same parametrs by using the `show vlan` command.

If the port LED is solid amber, your problem could be that the port's VLAN was deleted and the port wasn't reassigned.
Other problems can also cause the port LED to turn amber, such as STP placing the port in a blocking state or port security disabling the port because of a security violation.
Actually, if you see that a lot of port LEDs are amber, a deleted VLAN is probably the problem.

Use the `show interface switchport` command to determinie whether a deleted VLAN is the problem: if you see that the VLAN assigned to the port is inactive, like this, then you've identified the culprit:
```
switch#show interface fastEthernet0/1 switchport

....
Access Mode VLAN: 5 (Inactive)
....

```
Notice in this example that VLAN 5 is inactive, indicating that the interface is assigned to the VLAN, but the VLAN was deleted, making the interface inoperable.

If you are using trunks between the switches, make sure that the trunks are configured correctly: `show interface trunk`.
Make sure that the native VLAN number matches on both ends of the trunk: if they are mismatched, a trunk will not form.

Also check VTP (if you are using it) by executing `show vtp` command.
Make sure you have trunk connections between your switches, since VTP messages only traverse trunks.
When using a server/client implementation, make sure that the doamin name and, if using the password option, the password match among the VTP swtiches.
Also all switches must be running the same VTP version (by default this is version 1).

#### Inter-VLAN Connection Problems

If you are having problem reaching devices in other VLANs, make sure that, first, you can ping the default gateway (router) that is your exit point from the VLAN.
A common misconfiguration on a user's PC is a misconfigured default gateway.

If you *can't* ping the default gateway, then go back to the preceding section and check local VLAN connectivity issues.

If you *can* ping the gateway, check the router's configuration and its interface.
Also make sure that the router has a route to the destination VLAN (`show ip route`).
If you do have a router to the destination, make sure the destination VLAN is configured correctly and that the default gateway in that VLAN can reach the destination device.

### Exercise 9-6: Configuring VLANs

* Configuring VLANs across two Cisco switches.
* After creating the VLANs, you will need to creat the trunk ports so that VLAN traffic can travel between the two switches.

![[Pasted image 20251015015538.png]]

* Computer A: 12.0.0.5 (PC1) (VAN-SW1, E3/0)
* Computer B: 14.0.0.5 (PC2) (VAN-SW1, E3/1)
* Computer C: 14.0.0.15 (PC3) (VAN-SW2, E3/0)
* Computer D: 12.0.0.15 (PC4) (VAN-SW2, E3/1)

**VAN-SW1**
```
VAN-SW1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### VLAN MKT
VAN-SW1(config)#vlan 2
VAN-SW1(config-vlan)#name MKT

### VLAN SALES
VAN-SW1(config-vlan)#vlan 3
VAN-SW1(config-vlan)#name SALES
VAN-SW1(config-vlan)#exit
VAN-SW1(config)#exit

### verify
VAN-SW1#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/2, Et0/3, Et1/0, Et1/1
                                                Et1/2, Et1/3, Et2/0, Et2/1
                                                Et2/2, Et2/3, Et3/0, Et3/1
                                                Et3/2, Et3/3
2    MKT                              active
3    SALES                            active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
VAN-SW1#

## Place Computer A into MKT VLAN
VAN-SW1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
VAN-SW1(config)#interface E3/0
VAN-SW1(config-if)#switchport mode access
VAN-SW1(config-if)#switchport access vlan 2

## Place Computer B into SALES VLAN
VAN-SW1(config-if)#interface E3/1
VAN-SW1(config-if)#switchport mode access
VAN-SW1(config-if)#switchport access vlan 3


### verify
VAN-SW1#show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/2, Et0/3, Et1/0, Et1/1
                                                Et1/2, Et1/3, Et2/0, Et2/1
                                                Et2/2, Et2/3, Et3/2, Et3/3
2    MKT                              active    Et3/0
3    SALES                            active    Et3/1
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

### save configuration
VAN-SW1#copy running-config startup-config
```

**VAN-SW2**

```
VAN-SW2#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### Create VLAN
VAN-SW2(config)#vlan 2
VAN-SW2(config-vlan)#name MKT
VAN-SW2(config-vlan)#vlan 3
VAN-SW2(config-vlan)#name SALES
VAN-SW2(config-vlan)#exit

### Verify
VAN-SW2(config)#do show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/2, Et0/3, Et1/0, Et1/1
                                                Et1/2, Et1/3, Et2/0, Et2/1
                                                Et2/2, Et2/3, Et3/0, Et3/1
                                                Et3/2, Et3/3
2    MKT                              active
3    SALES                            active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

### Place Computer D into MKT
VAN-SW2(config)#interface E3/1
VAN-SW2(config-if)#switchport mode access
VAN-SW2(config-if)#switchport access vlan 2

### Place Computer C into SALES
VAN-SW2(config-if)#interface E3/0
VAN-SW2(config-if)#switchport mode access
VAN-SW2(config-if)#switchport access vlan 3

VAN-SW2(config-if)#exit

### verify
VAN-SW2(config)#do show vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/2, Et0/3, Et1/0, Et1/1
                                                Et1/2, Et1/3, Et2/0, Et2/1
                                                Et2/2, Et2/3, Et3/2, Et3/3
2    MKT                              active    Et3/1
3    SALES                            active    Et3/0
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

### save configuraiton
VAN-SW2(config)# do copy running-config startup-config
```

**VAN-SW1, trunk configuration**

```
VAN-SW1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### trunk configuration in E0/0
VAN-SW1(config)#interface E0/0
VAN-SW1(config-if)#switchport trunk encap dot1q
VAN-SW1(config-if)#switchport mode trunk

### trunk configuration in E0/1
VAN-SW1(config-if)#interface E0/1
VAN-SW1(config-if)#switchport trunk encap dot1q
VAN-SW1(config-if)#switchport mode trunk

VAN-SW1(config-if)#exit

### verify
VAN-SW1(config)#do show interfaces trunk

Port        Mode             Encapsulation  Status        Native vlan
Et0/0       on               802.1q         trunking      1
Et0/1       on               802.1q         trunking      1

Port        Vlans allowed on trunk
Et0/0       1-4094
Et0/1       1-4094

Port        Vlans allowed and active in management domain
Et0/0       1-3
Et0/1       1-3

Port        Vlans in spanning tree forwarding state and not pruned
Et0/0       1-3
Et0/1       none
VAN-SW1(config)#
```

**verify (ping)**

``` bash
### PC-A (PC-1, VLAN 2) to PC-D (PC-4, VLAN 2)
PC1> ping 12.0.0.15

12.0.0.15 icmp_seq=1 timeout
84 bytes from 12.0.0.15 icmp_seq=2 ttl=64 time=1.539 ms
84 bytes from 12.0.0.15 icmp_seq=3 ttl=64 time=1.354 ms
12.0.0.15 icmp_seq=4 timeout
12.0.0.15 icmp_seq=5 timeout

### PC-B (PC-2, VLAN 3) to PC-C (PC-3, VLAN 3)
PC2> ping 14.0.0.15

14.0.0.15 icmp_seq=1 timeout
84 bytes from 14.0.0.15 icmp_seq=2 ttl=64 time=7.176 ms
14.0.0.15 icmp_seq=3 timeout
84 bytes from 14.0.0.15 icmp_seq=4 ttl=64 time=2.533 ms
14.0.0.15 icmp_seq=5 timeout
```

**see mac address table**

```
### VAN-SW1
VAN-SW1(config)#do show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0050.7966.6800    DYNAMIC     Et0/0
   1    0050.7966.6801    DYNAMIC     Et0/0
   2    0050.7966.6800    DYNAMIC     Et3/0
   2    0050.7966.6803    DYNAMIC     Et0/0 # PC-C
   3    0050.7966.6801    DYNAMIC     Et3/1
   3    0050.7966.6802    DYNAMIC     Et0/0 # PC-D
Total Mac Addresses for this criterion: 6

### VAN-SW2
VAN-SW2(config)#do show mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    aabb.cc00.0100    DYNAMIC     Et0/0
   2    0050.7966.6800    DYNAMIC     Et0/0 # PC-A
   2    0050.7966.6803    DYNAMIC     Et3/1
   3    0050.7966.6801    DYNAMIC     Et0/0 # PC-B
   3    0050.7966.6802    DYNAMIC     Et3/0
Total Mac Addresses for this criterion: 5
```

---

## Chapter Review

* Meanings of the LEDs and the use of the mode button
* core functions of the switch and the switch operation modes.
* basic configuraiton settings on a switch.
* port security feature
* VLAN
* trunk port

---

## Quick Review

### Understanding Switch Features

* The switch has three core functions: address learning, filtering/forwarding, and loop avoidance.
* Layer 2 swithces have three operation modes: store-and-forward, cut-through, and fragment-free.
	* Cisco switches use fragment-free.

#### Identifying Switch Components

* The System LED will be amber if the switch experiences a malfuncction during startup.
* Use the Mode button to change between display modes on the switch.
* While in STAT display mode, if a port LED is amber, the port has been disabled because of a shutdown, STP blocking, or port security violation.
	* If the port is green, it means there is network activity on that port
* When in DUPLX display mode, if a port LED is showing a solid green light, then the prot is running in full duplex.
	* If the port LED is off, it means the port is in half-duplex mode.

#### Basic Switch Configuration

* An IP address can be assigned to a VLAN interface on a switch to access it remotely via telnet or SSH.
* The `ip default-gateway` command assigns a router address the switch should use to access other subnets.
* The `show mac address-table` command displays the MAC address table of the switch and any addresses that have been learned.

### Interface Configuraiton

* Port security is used to prevent unauthorized access to a LAN on access interfaces (non-trunk connections)
* The `switchport port-security` commands are used to configure port security.
* The defualts for port security are learning one MAc address on the interface with a violation mode of shutdown.
* Sticky learning enables a switch to dynamically learn which MAC addresses are connected to an interface and then configure those as the port security addresses that are authorized to access the port.

### Working with VLANs

* A VLAN is a group of devices, in the same broadcast domain, that have the same network or subnet number.
	* VLANs are not restricted to physical locations, so users can be physically located anywhere in the switched network.
* Static, or port-based, VLAN membership is manually assigned by the administrator.
* Dynamic VLAN membership is determined by information from the user device, such as its MAC address or 802.1x authentication credentials.
* An access port is a connection to another device that supports standard Ethernet frames and supports only a single VLAN.
* A trunk port is a connection that tags frames and allows multiple VLANs.
* Trunking is supported only on ports that are trunk-capable; not all Ethernet ports support trunking.
* IEEE 802.1Q is a standardized trunking method. Newer Cisco switches support only this trunking protocol.
	* The 802.1Q method inserts a VLAN tag in the middle of the frame and reomputes the frame's checksum.
	* It supports a native VLAN (this is a VLAN that is not tagged on the trunk link). On Cisco switches, this defaults to VLAN 1.
* DTP is a Cisco-proprietary protocol that determines whether two connected interfaces can become a trunk link. There are five modes: on, desirable, auto-negotiate, off, and no-negotiate. If one side's mode is on, desirable, or auto, and the other side's mode is on or desirable, a trunk will from. No-negotiate mode enables trunking but disables DTP.
* To enable trunking on a switch interface, use the `switchport trunk encap dot1q` command and then `switchport mode trunk`.
	* To verify trunking, use the `show itnerfaces switchport|trunk` command.
* All ports on a switch are automatically placed in VLAN 1. To add a VLAN on a switch, use the `vlan` command. To assign an interface to a VLAN, use `switch mode access` and `switchport access vlan`. To view your VLANs and the ports assigned to them, use `show vlan`.

---

### Questions

1.  The System LED will be `__________` if the switch has experienced a malfunction during startup.

A. green
B. off
**C. amber**
D. red

2.  You use the Mode button to switch to the Duplex display mode. You notice that all of the ports except for one are showing a green LED. What does the green LED mean?

A. The port is running half duplex.
B. Full duplex is disabled.
C. The port is running simplex.
**D. The port is running full duplex.**

3.  Which of the following is not asked for during the System Configuration Dialog script?

**A. Enabling interfaces**
B. Default gateway address
C. VLAN interface to use for management functions
D. Enable secret password

4.  In which configuration mode is the default gateway address configured for a switch?

A. Interface
B. Line
**C. Global**
D. Port

5.  By default, an IP address is not assigned to a switch. Under what circumstances may you want to assign an IP address to a switch?

A. In order for the switch to forward frames
**B. To remotely administer the switch remotely**
C. In order for the switch to flood frames
D. In order for the switch to route IP packets

6.  Enter the switch command that enables you to see the contents of the CAM table: `show mac address-table`

7.  Examine the following MAC address table on a switch. What will happen if a switch sees a frame with a destination MAC address of 0000.1111.DDDD?

![[Pasted image 20251015024014.png]]

**A. Flood to all ports**
B. Drop the frame
C. Forward it out Gig0/1
D. Forward it out Gig0/1 and Gig0/2

8.  Which switch feature is used to prevent unauthorized access to a LAN?

**A. Port security**
B. Port security and 802.1Q
C. VTY passwords
D. Enable password

9.  You are configuring port security on interface Gig0/6. You would like the switch to configure port security for whichever MAC address is currently using the port. What command would you use?

A. port-security mac-address dynamic
B. switchport port-security mac-address cccc.cccc.3333
**C. switchport port-security mac-address sticky**
D. switchport port-security violation shutdown

10.  You arrive to work on Monday morning and receive a complaint from a user who says she no longer has access to the network. You view the status on the interface her workstation is connected to using the following command. What is the problem?

![[Pasted image 20251015024745.png]]

A. The port has been disabled due to a security violation.
B. The line protocol is bad.
C. The port is missing a description.
**D. The port has been disabled by an administrator.**

11.  What Cisco switch command would you use to enable trunking on an interface?

**A. switchport mode trunk**
B. trunking on
C. trunking enable
D. switchport trunk on

12.  What Cisco switch command would you use to assign port 10 to VLAN ID 5?

A. vlan-membership static 10
B. vlan 5
**C. switchport access vlan 5**
D. switchport mode access

### Performance-based Questions

1.  You are responsible for configuring the LA-SW1 switch in the LA office so that it can be remotely administered from the other networks. Drag the appropriate set of commands into the switch configuration section that you would use to configure the switch.

![[Pasted image 20251015024052.png]]

```
VAN-SW1(config)#interface vlan1
VAN-SW1(config-if)#ip address 192.168.35.98 255.255.255.224
VAN-SW1(config-if)#no shutdown
VAN-SW1(config-if)#exit
VAN-SW1(config)#ip default-gateway 192.168.35.65
```


2.  Looking at the command on the left side of the following exhibit, draw a line to connect it to the description of what that command does.

![[Pasted image 20251015024106.png]]

* **`hostname VAN-SW1`**
	* Sets the device name
* **`no shutdown`**
	* Enables an interface
* **`ip default-gateway 12.0.0.1`**
	* Sets the default gateway on the device
* **`show mac address-table`**
	* Displays the MAC address associated with each port
* **`switchport port-security mac-address sticky`**
	* Configures port security to learn only one MAC address for a port
* **`switchport port-security maximum 1`**
	* Configures port security for the MAC address of the currently connected device.
