
## Understanding Routing

*Routing* is the process of sending data from one network to another along a chosen path.

After we divided a network into segments, it is up to the routers to move the data from one network segment to another.

The router is responsible for routing information to the destination network, and it does this by using information stored in a *routing table*.

A routing table is a list of destination networks that resides in memory on the router; the router uses this information to identify where to send data to reach a destination.

If a destination is not included in the routing table, the router will not be able to send the information to the destination.

![[Pasted image 20251017044227.png]]

In this example, Computer A is trying to send data off the network by first sending it to Router A.
Router A looks in its routing table to see whether the destination of 192.168.4.0 is listed, and as you can see in the figure, the router does not know how to reach that destination, so it returns an error.

Look at the third entry in the routing table: you can see that Router A includes 192.168.3.0 network desintaion in its routing table.
Therefore, if any systems on the 192.168.1.0 network send data to the 192.168.3.0 network, the router will send the information to the next *hop value* for that entry (shown as the "Gateway" column in the table).

The *hop value* determines where the router needs to send data to reach a particular destination.
In this case. it will send data to the 192.168.2.2 hop value, and it will get to 192.168.2.2 by sending the data out the interface 192.168.2.1 on Router A.

### Routing Concepts

* **Loopback interface**
	* Routers have network interface cards installed that provide network connections so that data can be sent (routed) from one network to another.
	* The router can also include a loopback interface, which is a virtual network interface card configured on the router.
	* You might configure a loopback interface for testing purposes or because a router feature may require the use of a loopback interface
		* For example, the routing protocol OSPF uses the IP address of the loopback interface as its router ID.
		* To control the router ID, you can configure a loopback interface and then assign an IP address to it.
* **Routing loops**
	* A routing loop occurs when two routers send a packet back and forth because each belives the packet belongs to the other router's network
		* Because of the destination IP of the packet and the route on the router.
	* Routers use the Time-To-Live (TTL) field as a method to prevent infinite routing loops by decresing the TTL every time a packet reaches a router.
	* Once the TTL reaches 0, the packet is removed from the network.
* **Routing tables**
	* The routing table is a list of destinations the router is aware of.
	* It indicates the route by which data should travel in order to reach a destination.
	* The router compares the destination IP address of the packet against the destination networks in its routing table.
		* If there is a match, the router sends the packet to the IP address of the packet to the IP address specified with that entry in the routing table
		* If the destination network is not included in the routing table, the router sends an error message
* **Static vs. dynamic routes**
	* Routes are either manully added to a routing table by the network administrator (static routes), or they are automatically learned from other routers (dynamic routes) using a routing protocol.
* **PDU**
	* A *protocol data unit* is a single unit of data communication being delivered and typically contains control information such as addressing information or data from an application.
	* The PDU for layer 1 is known as a *bit*, the PDU for layer 2 is a *frame*, the PDU for layer 3 is a *packet*, and the PDU for layer 4 is a *segment*
* **MTU**
	* The *maximum transmission unit* is the maximum size of a packet on the network.
	* With Ethernet networks, the MTU is typically 1514 bytes.

### Interface Configuration

Routers are used to connect networks and route data between these networks.
A rotuer connects to different networks via network cards, which are *interfaces* built into the router.
Each interface is assigned IP address and is connected to a network.

![[Pasted image 20251017044227.png]]

Assumte that on Router A, the interface assigned the IP address of 192.168.1.1 is an Ethernet interface (which connects to an Ethernet network).
Assume that the interface on Router A that is assigned the IP address of 192.168.2.1 is a serial interafce.

Serial interfaces are used either to connect to your wide area network (WAN) or to serve as a point-to-point link (a direct connection between two routers).

#### Configuring an Ehternet interface

To assign IP address to the Ethernet interface on Router A (ROUTERA in the following code example), you type the following commands:

```
ROUTERA> enable
ROUTERA# configure t
ROUTERA(config)# interface fastetherenet0/0
ROUTERA(config-if)# ip address 192.168.1.1 255.255.255.0
ROUTERA(config-if)# no shutdown

### Save configuration
ROUTERA# copy running-config startup-config
```

#### Configuring a Serial Interface

To assign IP address to the Serial 0 port on ROUTERA:

```
ROUTERA> enable
ROUTERA# config t
ROUTERA(config)# interface serial0
ROUTERA(config-if)# ip address 192.168.2.1 255.255.255.0
ROUTERA(config-if)# encap hdlc
ROUTERA(config-if)# no shutdown

### save configuration
ROUTERA# copy running-config startup-config
```

Notice that comands here are basically the same as those used to configure the Ethernet interface, except that we navigate to the serial0 interface instead of the fastethernet0/0 interface.

After you assign the IP address with the `ip address` command, you then set the encapsulation protocol for the serial link.
Popular encapsulation protocols over a serial link are *High-level Data Link Control (HDLC)* and *Point-to-Point Protocol (PPP)*.

You need to ensure that you are using the same protocol that is used on the other end of the serial link.

#### Configuring the Bandwidth Parameter

Each interface has a *bandwidth* value assigned to it.
A bandwidth value is used by certain routing protocols, such as OSPF and Ennaced Interior Gateway Routing Protocol (EIGRP), when making routing decisions.

For LAN-based interfaces, the speed of the interface becomes the bandwidth value, where the bandwidth is measured in kilobits per sends (Kbps).
However, for serial interfaces, the bandwidth defaults to 1554 Kbps, or speed of a T1 link.
This is true no matter what the pysical clock rate is on the interface.

To change the bandwidth value for an interface, use the `bandwidth`  command:

```
Router(config)# interface serial [slot_#/port_#]
Router(config-if)# bandwidth RATE_IN_KBPS

Router(config)# interface serial 0
Router(config-if)# bandwidth 56
```

### Viewing the Routing Table

Once you have assigned the IP address to each interface, you will need to ensure that routing is enabled on the router:

```
Router> enable
Router# config t
Router(config)# ip routing
```

Once routing has been enabled, the router will automatically add a route for each of the networks it is directly connected to.

To view the routing table and verify that the routers are added:

```
Router# show ip route
```

### Configuring Static Routing

When administrating a Cisco router, you will need to add any required routes that do not already exist in the routing table.

![[Pasted image 20251017044227.png]]

For example, Router A knows abut the 192.168.1.0 and 192.168.2.0 networks by default, but not the 192.168.3.0 network.

If you want configure Router A so that it knows about the 192.168.3.0 network, you need to add the route manually by creating a static route or using a dynamic routing protocol.

```
RouterA(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2
```

The command `ip route` adds a route to the routing table.
The 192.168.3.0 is the address of the destination network you are adding, and its subnet mask, 192.168.2.2, is the *next hop*, the address to which Router A will send data to reach the 192.168.3.0 network.

Notice that 192.168.2.2 is the address of an interface on Router B that Router A can communicate directly with.
The idea here is that in order for Router A to send data to the 192.168.3.0 network, it will pass the data to Router B via the interface at 192.168.2.2, which will then send the data on the 192.168.3.0 network.

If you view the routing table by using the `show ip route` command, you will notice that certain routes in the routing table are included because the router is connected to that network, as indicated with a letter C.

#### Deleting a Static Route on a Cisco Router

```
Router# config t
Router(config)# no ip route 192.168.3.0 255.255.255.0
```

#### Components of the Routing Table

![[Pasted image 20251018041806.png]]

* **Routing code**
	* The routing code, or routing protocol code, indicates how knowledge of the route occured.
		* Logically connected route
		* Static route
		* Route learned through a routing protocol such as RIP (R), OSPF(O).
* **Prefix**
	* The network prefix indicates the number of bits that make up the network ID.
* **Destination/network mask**
	* This identifies the network ID in the destination network.
* **Next hop**
	* This indicates where data is to be sent in order to reach that particular network destination.
* **Administrative distance**
	* The administrative identifies how the route was learned
		* directly connected, through RIP, thorugh OSPF, or a static route
	* Each type of route has a different administrative distance, which indicates how trustworthy the knowledge of the route is.
	* The lower administrative distance number, the more trustworthy the information is.
* **Metric**
	* When multiple routes are available to the same destination, with the same administrative distance, the router will choose a route based on a *metric*
	* The metric value indicates which routes are more eiffcient than others.
* **Gateway of last resort (GWLR)**
	* The GWLR references an IP address where the rotuer is to send all traffic for which it does not have a route.
* **Outbound interface**
	* The outbound interface is the local interface on the router that the router sends the data out in order to reach the destination.

### Exercise 11-1: Configuring Cisco Routers

* Configure IP addresses

![[Pasted image 20251018050908.png]]

**VPC**

```
PC1> ip 12.0.0.5 255.0.0.0
Checking for duplicate address...
PC1 : 12.0.0.5 255.0.0.0

PC2> ip 12.0.0.10 255.0.0.0
Checking for duplicate address...
PC2 : 12.0.0.10 255.0.0.0

PC3> ip 14.0.0.5 255.0.0.0
Checking for duplicate address...
PC3 : 14.0.0.5 255.0.0.0

PC4> ip 14.0.0.15 255.0.0.0
Checking for duplicate address...
PC4 : 14.0.0.15 255.0.0.0
```

**Switch configure & ping test**

```
### VAN-SW1
IOU1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### set hostname
IOU1(config)#hostname VAN-SW1

### save configuration
VAN-SW1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
Compressed configuration from 1501 bytes to 860 bytes[OK]

### PC-A, PC-B test
PC1> ping 12.0.0.10

84 bytes from 12.0.0.10 icmp_seq=1 ttl=64 time=0.227 ms
84 bytes from 12.0.0.10 icmp_seq=2 ttl=64 time=0.330 ms
84 bytes from 12.0.0.10 icmp_seq=3 ttl=64 time=0.334 ms
84 bytes from 12.0.0.10 icmp_seq=4 ttl=64 time=0.314 ms
84 bytes from 12.0.0.10 icmp_seq=5 ttl=64 time=0.375 ms

### LA-SW1

IOU2#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### set hostname
IOU2(config)#hostname LA-SW1

### save configuration
LA-SW1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
Compressed configuration from 1500 bytes to 860 bytes[OK]
LA-SW1(config)#

### PC-C, PC-D test
PC3> ping 14.0.0.15

84 bytes from 14.0.0.15 icmp_seq=1 ttl=64 time=0.238 ms
84 bytes from 14.0.0.15 icmp_seq=2 ttl=64 time=0.396 ms
84 bytes from 14.0.0.15 icmp_seq=3 ttl=64 time=0.344 ms
84 bytes from 14.0.0.15 icmp_seq=4 ttl=64 time=0.305 ms
84 bytes from 14.0.0.15 icmp_seq=5 ttl=64 time=0.366 ms
```

**VAN-R1**

```
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### set hostname
R1(config)#hostname VAN-R1

### to switch
VAN-R1(config)#interface F0/0
VAN-R1(config-if)#ip address 12.0.0.1 255.0.0.0
VAN-R1(config-if)#no-shutdown

### to router
VAN-R1(config-if)#interface S1/0
VAN-R1(config-if)#ip address 13.0.0.1 255.0.0.0
VAN-R1(config-if)#encap hdlc
VAN-R1(config-if)#no-shutdown

VAN-R1(config-if)#exit

### save configuration
VAN-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
[OK]
```

**LA-R1**

```
R2#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### set hostname
R2(config)#hostname LA-R1

### to switch
LA-R1(config)#interface F0/0
LA-R1(config-if)#ip address 14.0.0.1 255.0.0.0
LA-R1(config-if)#no shutdown

### to rotuer
LA-R1(config-if)#interface S1/0
LA-R1(config-if)#ip address 13.0.0.2 255.0.0.0
LA-R1(config-if)#encap hdlc
LA-R1(config-if)#no shutdown

LA-R1(config-if)#exit

### save configuration
LA-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Warning: Attempting to overwrite an NVRAM configuration previously written
by a different version of the system image.
Overwrite the previous NVRAM configuration?[confirm]
Building configuration...
[OK]
```

**ping test**

```
### VAN-R1 to LA-R1
VAN-R1(config)#do ping 13.0.0.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/22/36 ms
VAN-R1(config)#

### LA-R1 to VAN-R1
LA-R1(config)#do ping 13.0.0.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/19/40 ms
LA-R1(config)#
```

**verify**

```
### VAN-R1
VAN-R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      12.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        12.0.0.0/8 is directly connected, FastEthernet0/0
L        12.0.0.1/32 is directly connected, FastEthernet0/0
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.1/32 is directly connected, Serial1/0

### LA-R1
LA-R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.2/32 is directly connected, Serial1/0
      14.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        14.0.0.0/8 is directly connected, FastEthernet0/0
L        14.0.0.1/32 is directly connected, FastEthernet0/0
```

**Add static route**

* 14.0.0.0 route in VAN-R1
* 12.0.0.0 route in LA-R1

```
### 14.0.0.0 route in VAN-R1
VAN-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
VAN-R1(config)#ip route 14.0.0.0 255.0.0.0 13.0.0.2
VAN-R1(config)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      12.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        12.0.0.0/8 is directly connected, FastEthernet0/0
L        12.0.0.1/32 is directly connected, FastEthernet0/0
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.1/32 is directly connected, Serial1/0
S     14.0.0.0/8 [1/0] via 13.0.0.2  ### static route

### save changed configuration
VAN-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]

### 12.0.0.0 route in LA-R1
LA-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
LA-R1(config)#ip route 12.0.0.0 255.0.0.0 13.0.0.1
LA-R1(config)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

S     12.0.0.0/8 [1/0] via 13.0.0.1  ### static route
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.2/32 is directly connected, Serial1/0
      14.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        14.0.0.0/8 is directly connected, FastEthernet0/0
L        14.0.0.1/32 is directly connected, FastEthernet0/0

### save changed configuration
LA-R1(config)#do copy running-config startup-config
Destination filename [startup-config]?
Building configuration...
[OK]
```

**static route ping test**

```
VAN-R1#ping 14.0.0.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 14.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 16/22/36 ms
VAN-R1#

LA-R1#ping 12.0.0.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 12.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/13/20 ms
LA-R1#
```

---

## Understanding Dynamic Routing

Dynamic routing protocols are used to share routes between routers so that administrators do not need to add the routers manually.

Managing the entries in routing tables on a large internetwork could be a time-consuming task.
To help administrator with this, *dynamic* routing protocols are enabled.

These protocols enable the routers to share information contained within their routing tables with one another.
As a result, routes that are known by one router will be shared with other routers, thus saving administrator from having to add all the routes manually.

*Convergence* also known as steady state, occurs when all routing tables (routes) have been shared with all other routers and all routers have updated their routing tables with that new information.

There are two major categories of routing protocols:

* **Interior gateway protocols (IGPs)**
	* An IGP shared routing table information with other routers located inside your network, known as an *autonomous system* (AS).
	* An example of an IGP is the Routing Information Protocol (RIP) or the Enhanced Interior Gateway Routing Protocol (EIGRP).
* **Exterior gateway protocols (EGPs)**
	* An EGP that is loaded on a router will share routing table information to other routers outside your network.
	* An example of an EGP is the Border Gateway Protocol (BGP)

### Routing Metrics

* **Hop count**
	* Some routing protocols use hop count as a metric value, which means that the best route is determined based on how many hops away the network is.
	* Every router that data must pass through is considered a hop, and the lowest hop count is the best route to take with this metric.
* **MTU or bandwidth**
	* Some routing protocols determine the best route to take based on the MTU or bandwidth of the link.
	* Routes with more bandwidth would be preferred over lower bandwidth routes.
* **Costs**
	* Some routing protocols choose the bset route based on the lowest cost.
	* A cost value is considered a preference value on the link, and the link with the lowest cost value will be selected as the route to the destination.
* **Latency**
	* Some routing protocols use the latency of the link as the metric value.
	* Latency refers to how long it takes a packet to travel from one place to another.
	* Lower latency routes are preferred over higher latency routes with this metric criterion
* **Administrative distance**
	* The administrative distance is the "trustworthiness" of the route that is in the routing table.
	* Each different method od adding a route to a routing table has an administrative distance value
	* If the router was to lean about a route two or more different ways, when the route with the lower administrative distance is the one the router would use.

When discussing the different routing protocols, it is important to note that there are two major classes: *distance vector* and *link state*.

Each routing protocol is either a distance vector protocol or a link state protocol.

### Configuring a Routing Protocol

You need to perform two basic steps when setting up IP routing on your router:

* Enable the routing protocol
* Assign IP address to your router's interfaces

#### The `router` Command

Enabling an IP routing protocol is a two-step process.

First, you must go into router subconfiguraiton mode. This mode determines the routing protocol that you'll be running.
Within this mode, you'll configure the characteristics of the routing protocol.

To enter the routing protocol's configuration mode:

```
Router(config)# router NAME_OF_THE_IP_ROUTING_PROTOCOL
Router(config-router)#
```

The `router` command is used to access the routing protocol that you want to configure; it doesn't enable it.
If you are not sure of the name of the routing protocol that you want to enable, use the context-sensitive help feature:

```
VAN-R1(config)#router ?
  bgp       Border Gateway Protocol (BGP)
  eigrp     Enhanced Interior Gateway Routing Protocol (EIGRP)
  isis      ISO IS-IS
  iso-igrp  IGRP for OSI networks
  lisp      Locator/ID Separation Protocol
  mobile    Mobile routes
  odr       On Demand stub Routes
  ospf      Open Shortest Path First (OSPF)
  ospfv3    OSPFv3
  rip       Routing Information Protocol (RIP)
```

#### The `network` command

Once you enabled the routing protocol, you need to specify what interfaces are to participate in the routing process.
By default, no interfaces participate in the routing process. To specify which interfaces will participate, use the `network` mode command:

```
Router(config-rotuer)3 network IP_NETWORK_#
```

As soon as you enter a network number, the routing process becomes *active*

### Distance Vector Protocols

*Distance vector* routing protocols measure the best route to use based on the lowest hop count.
The hop count is increased by 1 for every router between the source and the destination.

With distance vector routing protocols, the route with the lowest hop count is typically selected as the destination path for the data.

> Distance vector protocols include RIP and IGRP.

#### RIP/RIPv2

RIP is a distance vector protocol that is responsible for sharing its routing table information with neighboring routers by broadcasting the information over User Datagram Protocol (UDP) every 30 seconds.
This broadcasting, or *advertising*, of routing table information with neighboring routers exempts the network administrator from having to add the routes manually.

RIP is an industry-standard routing protocol, which means that it is supported by many different vendors, so you could use it as a routing protocol to share routing table information between routers from different manufacturers.
RIP will choose the route with the lowest hop count, but if two different routes have the same hop count, RIP will load-balance the traffic over those two routes.

Be aware that RIP is limited to 15 hops, so it is used only on small networks.

RIPv1 works only with classful addresses because it dosen't send subnet mask information with the routing table.
RIPv2 is an update to RIPv1 and dose support classless addressing and variable-length subnet masks, because it sends the subnet mask information with the routing table.

![[Pasted image 20251017044227.png]]

Assume you are the administrator for Router A. Router A will have routes to the 192.168.1.0 and 192.168.2.0 networks by default.
If you wanted to configure RIP on Router A to advertise knowledge of those two networks, you would type the following commands on Router A:

```
ROUTERA> enable
ROUTERA# config t
ROUTERA(config)# router rip
ROUTERA(config-rotuer)# version 2
ROUTERA(config-rotuer)# network 192.168.1.0
ROUTERA(config-rotuer)# network 192.168.2.0
```

Once RIP, or any other routing protocol, has been enabled on both Router A and Router B, the two rotuers will share knowledge of any networks they know about.

Router A receives knowledge of the 192.168.3.0 network and builds the new network into its routing table; this is called *convergence*.

```
### RIP example
VAN-R1(config)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      12.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        12.0.0.0/8 is directly connected, FastEthernet0/0
L        12.0.0.1/32 is directly connected, FastEthernet0/0
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.1/32 is directly connected, Serial1/0
R     14.0.0.0/8 [120/1] via 13.0.0.2, 00:00:03, Serial1/0 ### RIP


LA-R1(config)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

R     12.0.0.0/8 [120/1] via 13.0.0.1, 00:00:03, Serial1/0 ### RIP
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.2/32 is directly connected, Serial1/0
      14.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        14.0.0.0/8 is directly connected, FastEthernet0/0
L        14.0.0.1/32 is directly connected, FastEthernet0/0
```

#### IGRP

IGRP is a classful routing protocol that was built by Cisco, so you will use it only on networks where you have only Cisco rotuers.

IGRP was designed to improve on RIP limitations; it has maximum hop count of 255 and uses the concepts of an *autonomous system (AS)*.
An autonomous system is a grouping of routers that share routing table information.
Routers using IGRP will share the routers only with other routers in the AS.

Another improvement is that the full routing table is advertised every 90 seconds instead of 30 seconds, as is the case with RIP.

To enable IGRP on your Cisco router:

```
ROUTERA> enable
ROUTERA# config t
ROUTERA(config)# router igrp 10
ROUTERA(config-rotuer)# network 192.168.1.0
ROUTERA(config-rotuer)# network 192.168.2.0
```

In this code listing, notice that enabling IGRP on a Cisco router is similar to enabling RIP.
The difference however, is that when you enable IGRP, you specify the AS number for the router.

### Link State Protocols

Link state routing protocols are a little more advanced than distance vector routing protocols in the sense that a link state routing protocol knows about the entire network topology.

A link state protocol is reponsible for monitoring the state of the link between the routers.
This lnk state information is then used to determine the optimal route to a destination network.
Although protocols such as RIP have knowledge of neighboring routers, link state protocols have knowledge of the entire network topology and multicast the routing table information to the entire network.

One of the benefits of the link state routing protocols is that if a link is down, that information is stored in the routing table and that pathway will not be used.
Because a distance vector routing protocol does not store link state informatin, it is possible that it will not know that a link is unavailable for some time and could still send traffic through that pathway.

#### OSPF

*Open Shortest Path First (OSPF)* is an example of a link state protocol.
OSPF is an industry-standard protocol, which means that it is available to routers built by different manufactueres, and you can use it to share routing information between dissimiar routers.

Like IGRP, OSPF uses autonomus systems, but it also has the capability of dividing the AS into logical groups, called *areas*.
OSPF supports Variable Length Subnet Masks (VLSMs) and has un unlimited hop count.

#### IS-IS

The *Intermediate System-Intermediate System (IS-IS)* routing protocol competes with OSPF by being a link state routing protcol for inside the network (interior gateway).
IS-IS was developed by Digital Equipment Corporation (DEC) and has become an industry-standard protocol, although it's not as popular as OSPF.

Like OSPF, IS-IS uses a link state algorithm to maintain status information on all the links and routes on the network so that each router running the IS-IS protocol will have knowledge of the entire network topology.

### Hybrid Protocols

Hybrid routing protocols combine the features of distance vector and link state.

Cisco uses two hybrid protocols: EIGRP and BGP.

#### EIGRP

As a popular hybrid routing protocol that was built by Cisco, EIGRP improves upon IGRP by being a *classless* routing protocol that supports VLSM and both IPv4 and IPv6.
EIGRP also has a maximum hop count of 255 hops.

To configure EIGRP:
```
ROUTERA> enable
ROUTERA# config t
ROUTERA(config)# router eigrp 10
ROUTERA(config-rotuer)# network 192.168.1.0
ROUTERA(config-rotuer)# network 192.168.2.0
```

#### BGP

BGP is an EGP that is responsible for sharing routing table information with routers *outside* your autonomus system.

The protocols such as RIP, EIGRP, and OSPF are known as interior gateway protocols, which are responsible for sharing routing tables within your autonomus system (or network).

BFP is designed to send changes made to the routing table when they occur, versus at a regular interval as RIP does.
BGP sends only the change, while other routing protocols such as RIP send the entire table.
BGP is also a classless routing protocol that supports Classless Interdomain Routing (CIDR).

> BGP is newer version of EGP

---

## The Routing Process

### Types of Routes

A number of different types of routes can exist in the routing table of a Cisco router (static routes, network routes, default routes, host routes, and floating static routes).

#### Network Route

A network route points to the network ID of a network or subnet.

For example, in order for the router to send data to a server with an IP address of 14.0.0.10, the router would look in its routing table for a route to the 14.0.0.0/8 network.

A network route may appear in the routing table because the network is connected to the router (a connected route) or because the administrator added it manually (static route).

##### Connected Route

To determine a connected or directly connected route, a router will look at its active interfaces, examine the address configured on the interfaces and determine the corresponding network numbers, and populate the routing table with this information.

#### Static Route

A *static route* is a manually configured route on your router.
Static routes are typically used in smaller networks and when few networks or subnets exist, or with WAN links that have little available bandwidth.

With a network that has hundreds of routes, static routes are not scalable, since you would have to configure each route and any redundant paths for each route on each router.

To configure a static route for IP:

```
Router(config)# ip route DEST_NETWORK_# [SUBNET_MASK] 
				IP_ADDR_OF_NEXT_HOP [ADMINISTRATIVE_DISTANCE] [permanent]

or

Router(config)# ip route DEST_NETWORK_# [SUBNET_MASK] 
				EXIT_INTERFACE_NAME [ADMINISTRATIVE_DISTANCE] [permanent]
```

The first parameter that you must specify is the destination network number.
If you omit the subnet mask for the network number, it defaults to the Class A (/8), B (/16), or C (/24) default subnet mask, depending on the network number of the destination.

After the subnet mask parameter, you can specify how to reach the destination network in one of two ways: you can tell the router the next-hop neighbor's IP address, or indicate the interface the router should exit to reach the destination network.
Use the former method for a multi-access link, Use the latter method for a point-to-point link.

Optionally, you can change the administrative distance of a static route.
If you omit this value, it will use one of two default values, depending on the configuration of the previous parameter: If you specified the next-hop neighbor's IP address, the administrative distance defaults to 1. If you specified the interface on the router it should use to reach the destination, the router treats the route as a connected route and assigns it an administrative distance of 0.

Note that you can create multiple static routes to the *same* destination.
For instance, you may have primary and backup paths to the destination. For the primaty path, you could use the default administrative distance value. For the backup path, you could use a number higher than this, such as 2.

Once you have configured a backup path, the router will use the primary path, and if the interface on the router fails for the priamry path, the router will use the backup route.

The `permanent` parameter will keep the static route in the routing table even when the interface the router uses for the static route fails.
If you omit this parameter, and the interface used by the static route fails, the router will remove this route from its rouing table and attempt to find an alternative path to place in the routing table.
You may want to use the `permanent` parameter if you never want packets to use another path to a destination, perhaps because of security reasons.

#### Default Route

One special type of static route is a *default route*, commonly called the *gateway of last resort (GWLR)*.
If the specified destination is not listed in the routing table, the default route can be used to route the packet.
A default route has an IP address of 0.0.0.0 and a subnet mask of 0.0.0.0, often represented as 0.0.0.0/0.
Default routes are commonly used in small networks on a perimeter router pointing to the directly connected ISP router.

To set up a default route:

```
router(config)# ip route 0.0.0.0 0.0.0.0
				ip_address_of_next_hop_neighbor
				[administrative_distance] [permanent]

or

router(config)# ip route 0.0.0.0 0.0.0.0
				exit_interface_name
				[administrative_distance] [permanent]
```

#### Default Network Configuration

An alternative way to configure a default route is to define a default network.
When you configure the `ip default-network` command, the router consideres routes to that network for installation as the GWLR on the router.

This command is used when no other route exists in the routing table (connected, static, or dyanmic).

```
VAN-R1(config)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      12.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        12.0.0.0/8 is directly connected, FastEthernet0/0
L        12.0.0.1/32 is directly connected, FastEthernet0/0
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.1/32 is directly connected, Serial1/0
R     14.0.0.0/8 [120/1] via 13.0.0.2, 00:00:03, Serial1/0
```

Between the code table at the top of the output and the routes at the bottom is the line `Gateway of last resort is not set`.
This is the default configuration.

To define a GWLR,

```
Router(config)# ip default-network NETWORK_NUMBER_TO_USE
```

The network number you define is the network the router should access as a last resort.
Note that your routing table will need an entry indicating how to reach this default network, such as a next-hop address.
This is typically done via a static route.

> Use an address and subnet mask of 0.0.0.0 0.0.0.0 when creating default route when no other specific route is available to a destination within the routing table.
> The GWLR is defined the `ip default-network` command.

#### Host Route

A host route references the full IP address of a computer on the network.
You may see an entry that appears in the routing table with a /32, meaning that all bits are network bits, you should treat the entire address as a network ID.

#### Floating Static Route

A floating static route is a backup route to a destination to which you have a primary route.
The floating static route will not appear in the routing table until the priamry route fails, and then the floating static route will appear.

You configure a floating static route by creating a static route with an administrative distance that is higher than the route you are trying to back up (whether it be another static route or route learned bia a dynamic routing protocol).

```
### Adds floating static route by setting the administrative distance to 10
Router(config)# ip route 14.0.0.0 255.0.0.0 12.0.0.100 10
```

### Selecting a Route

When the Cisco device selects a route to use for a particular destination, it uses a number of criteria: it first checks for a longest matching network prefix, then it selects a route based on the administrative distance, and finally it may look at the metric value if the network prefix and administrative distance are equal on multiple routes.

#### Longest Match

The first routing criteria used by a router is the longest matchin prefix.

It essentially chooses the route to a destination network with the longest network or subnet ID.
This ensures that if the network is subnetted, the more specific route is being used.

#### Administrative Distance

Each router needs to choose a *best* path to a destination.
This process can become somewhat complicated if the router is receiving routing update information for a single network from multiple sources, such as connected, static, and IGP routing protocols, and must choose *one* of these sources as the best and place this choice in the router's routing table.

After choosing routes based on network ID matching, the router looks at the administrative distance to determine a trustworthiness for the knowledge of a route (the lower administrative distance, the more trustworthy the route).

For example, suppose a connected route has an administrative distance of 0, while a static route has an administrative distance of 1.
if you added a static route for a network ID that already existed because the router was connected to that network, the router would use the connected route over your static route.

**Administrative Distance Value**

| Value | Route Type                                                       |
| ----- | ---------------------------------------------------------------- |
| 0     | Connected interface route                                        |
| 1     | Static route                                                     |
| 90    | Internal EIGRP router (within the same AS)                       |
| 110   | OSPF route                                                       |
| 120   | RIPv1 and v2 route                                               |
| 170   | External EIGRP (from another AS)                                 |
| 255   | Unknown route (considered an invalid route and will not be used) |

#### Routing Protocol Metric

The route selection process so far chooses a route based on the network destination ID first, and then the administrative distance.

But what if there are multiple routes the same administrative distance? If a situation arises where two paths to the destination network exist, and the *same* routing protocol is being used to share that knowledge to your router, the router will use a measurement called *metric* to determine which path is the best path to place in the routing table

**Routing Protocol Metrics**

| Metric      | Protocol | Desc                                                     |
| ----------- | -------- | -------------------------------------------------------- |
| Bandwidth   | EIGRP    | The capacity of the link in Kbps                         |
| Cost        | OSPF     | Measurement in the inverse of the bandwidth of the links |
| Delay       | EIGRP    | Times it takes to reach the destination                  |
| Hop count   | RIP      | How many layer 3 hops away from the destination          |
| Load        | EIGRP    | The path with the least utilization                      |
| MUT         | EIGRP    | The path that supports the largest frame sizes           |
| Reliability | EIGRP    | The path the least amount of errors or downtime          |

---

## Routing Troubleshooting Commands

Once you have configured your routing protocol, you can use a variety of commands to verify and troubleshoot the routing configuration.

### The `clear ip route` Command

The `clear ip route *` command is a privileged EXEC mode command.
This command clears and rebuilds the IP routing table.

Any time you make a change to a routing protocol, you should clear and rebuild the routing table with this command.

You can replace the astrisk (`*`) with a specific network number; if you choose to do so, this will clear only the specified route from the routing table.

Note that `clear` command clears only routes learned from a routing protocol (dynamic routes); static and directly connected routes cannot be cleared from the routing table unless the interface they are associated with is not operational.

### The `show ip protocols` Command

The `show ip protocols` command displays all the routing protocols, including RIP, which you have configured and are running on your router.

```
VAN-R1(config)#do show ip protocols
*** IP Routing is NSF aware ***

Routing Protocol is "application"
  Sending updates every 0 seconds
  Invalid after 0 seconds, hold down 0, flushed after 0
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Maximum path: 32
  Routing for Networks:
  Routing Information Sources:
    Gateway         Distance      Last Update
  Distance: (default is 4)

Routing Protocol is "rip"
  Outgoing update filter list for all interfaces is not set
  Incoming update filter list for all interfaces is not set
  Sending updates every 30 seconds, next due in 24 seconds
  Invalid after 180 seconds, hold down 180, flushed after 240
  Redistributing: rip
  Default version control: send version 2, receive version 2
    Interface             Send  Recv  Triggered RIP  Key-chain
    FastEthernet0/0       2     2
    Serial1/0             2     2
  Automatic network summarization is in effect
  Maximum path: 4
  Routing for Networks:
    12.0.0.0
    13.0.0.0
  Routing Information Sources:
    Gateway         Distance      Last Update
    13.0.0.2             120      00:00:21
  Distance: (default is 120)
```

In this example, RIPv2 is runing on the router. The routing update interval is 30 seconds, with the next update being sent in 24 seconds.

RIPv2 is being use to generate and receive updates on FastEhternet0/0 and Serial1/0 interfaces.

### The `show ip route` Command

To view the routing table, use the `show ip route` command.

```
VAN-R1(config)#do show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route, H - NHRP, l - LISP
       a - application route
       + - replicated route, % - next hop override

Gateway of last resort is not set

      12.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        12.0.0.0/8 is directly connected, FastEthernet0/0
L        12.0.0.1/32 is directly connected, FastEthernet0/0
      13.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        13.0.0.0/8 is directly connected, Serial1/0
L        13.0.0.1/32 is directly connected, Serial1/0
R     14.0.0.0/8 [120/1] via 13.0.0.2, 00:00:03, Serial1/0
```

### The `debug ip <protocol>` Command

Remeber that the `show` commands show a static display of what the router knows, and they sometimes don't display enough information concerning a specific issue or problem.
For instance, you might be looking at your routing table with the `show ip route` command and expect a certain RIP route to appear from a connected neighbor, but this network is now shown.
Unfortunately, the `show ip route` command won't tell you why a route is or isn't in the routing table.
However, you can resort the `debug` commands to assit you in your troubleshooting.

For more detailed information about the events and packets being sent or received with a routing protocol that can be used to troubleshoot routing protocol problems, you can use the `debug ip <protocol>` command, where `<protocol>` can be RIP, EIGRP, or OSPF.

```

VAN-R1#debug ip rip
RIP protocol debugging is on
VAN-R1#
*Oct 19 07:44:11.341: RIP: sending v2 update to 224.0.0.9 via Serial1/0 (13.0.0.1)
*Oct 19 07:44:11.341: RIP: build update entries
*Oct 19 07:44:11.341:   12.0.0.0/8 via 0.0.0.0, metric 1, tag 0
VAN-R1#
*Oct 19 07:44:13.609: RIP: sending v2 update to 224.0.0.9 via FastEthernet0/0 (12.0.0.1)
*Oct 19 07:44:13.609: RIP: build update entries
*Oct 19 07:44:13.609:   13.0.0.0/8 via 0.0.0.0, metric 1, tag 0
*Oct 19 07:44:13.609:   14.0.0.0/8 via 0.0.0.0, metric 2, tag 0
VAN-R1#
```

> When using `debug` commands, you must be in privileged EXEC mode.
> To disable a specific `debug` command, negate it with the `no` parameter.
> To turn off debugging for all `debug` commands, use either `undebug all` or the `no debug all` command.

---

## Router-on-a-Stick

VLANs can be used to configure communication boundaries on the network.
To enable communication between VLANs, you can either connect a router interface to each VLAN or use the router-on-stick method.

Typically, we think of routing as traffic entering one physical interface and leaving another physical interface.

However, trunks can be used to support multiple VLANs, where each VLAN has a unique layer 3 network or subnet number.
Certain router models and interface combinations, such as the 1800 series, support trunk connections.

A *router-on-stick* is a router that has a single trunk connection to a switch and routes between the VLANs on this trunk connection.
You could easily do this without a trunk (access-link connection), but each VLAN would require a separate access-link (physical) interface on the router, and this would increase the price of the router solution.

For instance, if you had five VLANs and your router didn't support trunking, you would need five physical LAN interfaces on your router, and on your switch, to route between the five VLANs.
However, with a trunk connction, you can route between all five VLANs on a *single* interface.

Because of cost and scalability, most administrators prefer using a router-on-a-stick approach to solve their routing problems in switched networks.

> A router-on-a-stick is a router that has a single trunk connection to a switch and routes between multiple VLANs on this trunk.
> Subinterfaces are used on the router to desginate the VLAN with which they are associated.
> Each VLAN needs a different IP subnet configuration.

### Subinterface Configuration

To set up a router-on-a-stick, you need to break up your router's physical interface into multiple logical interfaces, or *subinterfaces*.
Cisco supports up to 1000 interfaces on a router, including both physical and logical interfaces.

Once you create a subinterface, a router will treat this logical interface just lik a physical interface: you can assign a layer 3 addressing to it, enable it, disable it, and do many other things.

To create subinterface, use the following command:

```
Router(config)# interface type port#.subinterface_# [point | multipoint]
Router(config-subif)#
```

After entering the physical interface type and port identifier, follow this with a dot (.) and a subinterface number.

The subinterface number can range from 0 to 4,294,967,295.
The number that you use for the subinterface number is only for reference purposes within IOS, and the only requirement is that when creating a subinterface, you use a unique subinterface number.
Many administrators perfer to use the VLAN number that the subinterface will handle for the subinterface number; however, this is not a requirement and the two numbers are not related in any way.

At the end of the statement, you must specify the type of connection *if* the interface is of type serial; otherwise, you can omit it.
The **point** parameter is used for point-to-point serial connections, and **multipoint** is used for multipoint connections.

The **multipoint** parameter is used for connections that have more than one device connected to them (physically or logically).
For a router-on-a-stick configuraiton, you can omit the connection type, since the default is **multipoint** for LAN interfaces.

### Interface Configuration

Once you create a subinterface, you'll notice that your CLI prompt has changed and that you are now in subinterface configuration mode.

If you are routing between VLANs, you'll need an interface that supports trunking.
Some things are configured on the major interface, and some things are configured on the subinterface.

Configurations such as duplexing and speed are done on the major (or physical) interface.
Most other tasks are done on the subinterface (the logical interface), including to which VLAN the subinterface belongs and its IP addressing information.

When setting up your subinterface for a router-on-a-stick, you must configure the type of trunking (InterSwitch Link, 802.1Q) and the VLAN with which the subinterface is associated.

```
Router(config-subif)#encapsulation isl|dot1q VLAN_#
```

Use the `encapsulation` command to specify the trunk type and the VLAN associated with the subinterface.
The VLAN number you specify here *must* correspond to the correct VLAN number in your switched network.

You must also set up a trunk connection on the switch for the port to which the router is connected.
Once you do this, the switch will send tagged frames to the router, and the router, using your encapsulation, will understand how to read the tags.
The router will be able to see from which VLAN the frame came and match it up with the appropriate subinterface that will process it.

### Router-on-a-Stick Example Configuration

![[Pasted image 20251019153446.png]]

Assume that the Fast Ethernet interface on the router is the first instance in the first slot and that the switch is using 802.1Q trunking on the connected interface.

```

VAN-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.

### interface duplex config
VAN-R1(config)#interface F0/0
VAN-R1(config-if)#duplex full
VAN-R1(config-if)#no shutdown
VAN-R1(config-if)#exit

### F0/0.1 subinterface
VAN-R1(config)#interface F0/0.1
VAN-R1(config-subif)#encap dot1q 10
VAN-R1(config-subif)#ip address 172.16.1.1 255.255.255.0
VAN-R1(config-subif)#exit

### F0/0.2 subinterface
VAN-R1(config)#interface F0/0.2
VAN-R1(config-subif)#encap dot1q 20
VAN-R1(config-subif)#ip address 172.16.2.1 255.255.255.0
VAN-R1(config-subif)#exit
VAN-R1(config)#
```

Notice in this example that the subinterface numbers in the `interface` command do not match the VLAN numbers in the `encapsulation` command; remember that the subinterface numbers are used by IOS only to reference the particular subinterface and do not have to match any configuration on the subinterface.

---

## Router High Availability

With layer 3 redundancy, you're normally dealing with having multiple paths to a destination and using a dynamic routing protocol to find the best or an alternative path.

This section, however, deals with another type of layer 3 redundancy: default gateways and server load balancing.
These are issues typically found at the access and distribution layers.

### Problems of Traditional Default Gateway Redundancy Solutions

You can easily place two routing devices at the distribution layer of each switch block to provide redundancy for end stations to leave their VLAN.

However, this may not provide a true fault-tolerant solution. This is especially true for situations in which end stations do not support a router discovery protocol to learn which routers they can use or which routers can't be configured to use more than one default gateway address.

#### Proxy ARP Issues

Some end stations can use Proxy ARP to discover the IP address of the default gateway.
In this situation, the end station dynamically acquires the IP address and MAC address of the default gateway and sends all of its inter-VLAN traffic to this routing device.

To begin, the end station doesn't know how to reach the destination and generates an ARP request for the destination.
Obviously, if the destination is not in the same VLAN, no one responds and the end station assumes that the destination is not reachable.

However, a Cisco router can proxy this ARP by sending back its own MAC address to the end station, and the end station can then use the router to send traffic out of the subnet.
From the end station's perspective, it thinks it's sending trafic directly to the destination, but is's actually being relayed by the router.
On Cisco IOS devices with routing enabled, Proxy ARP is enabled, by default, on the routing interfaces.

A problem arises, however, when the default gateway fails, In this situation, the end station still sends its information to the failed default gateway, where the traffic is dropped.
Sometimes a client re-preforms the ARP after a length period of time to verify the destination's (default gateway's) existence. (At this point, it will have discovered that the default gateway has failed, and then another routing device can perform the proxy.)
However, in most implementations of ARP, the end station continues to use the same failed default gateway MAC address unless it is rebooted.

#### ICMP Router Discovery Protocol Issues

The Internet Control Message Protocol Router Discovery Protocol (IRDP) is not a routing protocol like OSPF or RIP; instead, it is an extension to ICMP that enables an end station to automatically discover the default gateways connected to the same VLAN.
IDRP is covered in RFC 1256.

In this environment, the routing devices periodically generates special multicast packets that announce the router's existence to the clients.
The time period is usally between 5 and 10 minutes. Learned information usally has a maximum lifetime of 30 minutes on the client if no more IRDP messages are received from the advertising routing device.
The multicast packet included the routing device's address and a lifetime value.

With IRDP, end stations can dynamically discover other routing device when their primary default gateway fails.
However, this may take up to 30 minutes, based on the lifetime value in the original multicast packet from the routing device.
And even if you may consider using IRDP with your access layer devices, most end-station IP stacks do not support IRD.

#### Routing Protocol Issues

To overcome two previous problems, you may be able to run a routing protocol on the end station (if the client support this type of function).

With IP, the only routing protocol that most end stations *might* support is RIP or OSPF.
In RIP or OSPF, the end station could make intelligent decisions about which layer 3 routing device to use to access other subnets.

However, the issue with RIP is that its convergence is very slow, it could take up to 180 seconds before an alternative routing device is chosen when the current primary routing device fails.
With TCP sessions, this would cause timeout.
Because of this, as well as all the additional overhead that RIP creates, this solution is not very desirable for your end stations, and this assumes that your end stations and other network devices support a routing protocol such as RIP.

#### User Device Issues

In most campus environments, end stations are assigned a single IP address for the default gateway (which is usually done via DHCP).
In this environment, if the routing device (default gateway) were to fail, the end station would lose its capability to access other network devices outside of its VLAN.

Unfortunately, there is no redundancy in this implementation, because an end station can have only one default gateway address configured

### Hot Standby Router Protocol

HSRP is a Cisco-proprietary protocol that provides a single definition of a default gateway on the end station and provides layer 3 redundancy for overcoming the issues of IRDP, Proxy ARP, and end-station routing protocols.

Unlike the four previous solutions, HSRP is completely transparent to the end stations. (you do not have to perform any additional configuration on the end stations themselves)
HSRP enables Cisco routing device to monitor one another's status, which provides a very quick failover when a primary gateway fails. This is done by establishing HSRP groups.

With HSRP, a group of routing devices represents a single virtual default gateway.
This virtual default gateway has a virtual IP address and a virtual MAC address.
If the primary routing device fails, another routing device in the HSRP group takes over and processes the frames sent by the end stations to the virtual MAC address.

An advantage of HSRP groups is that different subnets (VLSNs) can have different default gateways, thus providing load balancing. Also, within each HSRP group is a primary default gateway and the capability to use multiple routers to perform a backup function.
You can have up to 256 standby groups per routing device, providing up to 255 default gateways.
Routing devices can provide backup for multiple primary default ageways.
Each standby group keeps track of the primary routing device that's currently forwarding traffic sent to the virtual MAC address.
Note that only one routing device is actually forwarding traffic with HSRP.

Another nice feature of HSRP is that you can customize it based on the size of your network.
For instance, if you have a VLAN with 1000 devices in it, you can set up two HSRP groups: on group for 500 devices and another group for the other 500 devices.
You can then assign routing device to each group.
For example, if you had only two routing device, you could h ave the first routing device be the active routing device for group 1 but the standby for group 2, and vice versa for the second routing devie.
Through this process, you can have both of your routing devices forwarding traffic while still providing redundancy. (if the active routing device in either group fails, the other routing device promptes itself to an active state)

#### HSRP Operation

Only one routing device actually forwards traffic for an HSRP group.
Using a priority scheme, one routing device is elected as the forwarding router and the others perform as backups for a group.
Each routing device has a default priority of 100, which you can manipulate.
The routing device with the highest priority in the group is eleced as the active router, and the other routing devices are placed in standby mode.
The active rouign device reponds to any ARP packets from end stations and replies with the virtual MAC address of the group.

Each HSRP group must have a unique virtual IP address and a virtual MAC address, which means these addresses must be unique across different groups.
This MAC addressis 0000.0c07.acXX. The 0000.0c is Cisco's vendor code. The 07-ac is HSRP's well-known address. The XX is the group number (in hex) for the HSRP group.
Therefore, each HSRP group must have a unique address to ensure that MAC address is uniuqe in a VLAN.

With HSRP, the end stations would perform an ARP with the virtual IP address, requesting the virtual MAC address of the default gateway routing device.
Note that in this setting, the end stations are completely unaware of the actual routing devices handling traffic destined for a virtual router.
Even when the primary fails and the standby routing device starts handling traffic for the broadcast domain, the end stations still think they're talking to the same routing device.

#### Types of Routing Devices

Every HSRP group contains the following types of routing devices that perform certain roles:

* Virtual routing device
* Active routing device
* Standby routing device
* Other HSRP routing devices

The role of the virtual routing device is to provide a single RP that's always avilable to the end stations.
It is not a real RP because the IP and MAC address of the virtual RP are not physically assigned to any one interface on any of the routing devices in the broadcast domain.

The role of the active and standby routing devices is based on the priority of the routing devices in the HSRP group.
The routing devices with the *highest* priority is elected as the standby routing device.
If the priority is the same, the IP address of the routing device is used as a tiebreaker.
In this situation, the routing device with the *higher* IP address is elected for the role.

The active routing device is responsible for forwarding all traffic destined to the virtual routing device's MAC address, and the standby routing device keeps tabs on the active routing device by looking for HSRP multicast messages, called *HSRP hellos*.
The active routing device generates a hello every 3 seconds. If the standby routing device does not see any hellos for 10 seconds from the active routing device, the standby device promotes itself and begins performing the functions of the active device.
Like the active device, the standby device also announces itself every 3 seconds so taht if it fails, one of the other HSRP routers in the standby group can assume the standby routing device role.

The other routing devices in the HSRP group, if any exist, listen for the hello multicasts from the standby and active routing devices to ensure that they are performing their respective roles.
When the active routing device fails, the view from the end stations' perspective is the same, they're still forwarding their frames to the virtual MAC address.
When this happens, the standby routing device starts processing the frames sent to the virtual MAC address, and one of the other HSRP routers in the group is elected to the standby role.

> If any end stations uses a real MAC address of one of the routing devices in the broadcast domain, that specific routing device, wheter it is active, standby, or another routing device, processes and forwards the frame.

#### HSRP Multicast Messages

To declare which routing devices will become the active and standby routing devices, all the routing devices in the HSRP group initially send out HSRP multicast messages.
These UDP messages, using port number 1985, are addressed to the all-router multicast address (224.0.0.2) with a TTL value of 1.
A TTL of 1 ensures that any multicast routing protocol that's running will not forward the message to a different subnet.

The HSRP message contains the following information:

* HSRP version number
* Opeartion code (opcode) message type:
	* **Hello messages**
		* Used by the routing devices for the election process and by the active and standby routing devices when they have been elected
	* **Resign messages**
		* Used by an RP when it wants to stop performing the function of the active RP
	* **Coup messages**
		* Used by an RP that wants to become the active RP
* Current HSRP state
* Hello time interval of HSRP messages (defaults to 3 seconds)
	* How often HSRP message is considered valid
* Hold-down time interval (default to 10 seconds)
	* The length of time that a hello message is considered valid
* Priority of the RP
	* Used to elect the active and stand by routing devices
* Standby group number (0-255)
* Authentication password, if configured
* Virtual Ip address of the HSRP group
	* The default gateway IP address that your end stations should use

#### HSRP States

HSRP supports six different states. A routing device may go through all these states or only a few of them, depending on whether it becomes an active or standby routing device:

* Initial
* Learn
* Listen
* Speak
* Standby
* Active

When the routing devices are enabled, they start in an *inital state*.
Note that they hvae not begun the HSRP process in an initial state, only the routing devices themselves and their associated interfaces have been activated.

In a *learn state*, a routing device listens for an active routing device.
The routing device initially has no knowledge of any other HSRP routers. In this state, its purpose is to discover the current active and standby routing devices and the virtual IP address for the group.

After the routing device sees a multicast from the active/standby routing device, it learns about the virtual IP address. This is called the *listen state*.
In this state, the routing device is neither the active nor the standby routing device.
If there's already a standby and active routing device, the listening routing device remains in this state and does not proceed to any of the next three states.
The exception to this is if you've configured *preemption*. With preemption, a new routing device with a higher priority can usurp an existing active or standby routing device.

If the routing device enters the *speak state*, the device propagates multicast messages so that it can participate in the election process for the standby or active role.
These hellos are sent out periodically so that other routing devices in the group know about everyone's existence.
Note that for a routing device to enter this state, it must have the virtual IP address configured on it.

Based on the routing device's priority, it becomes either a *standby* or *active* device.
In a standby state, the routing device is the next in line to assume the role of the active routing device if the active routing device fails.
In an active state, the routing device is responsible for forwarding all traffic sent to the virtual MAC address of the broadcast domain.
There can be only one active and one standby routing device.
Both of these routing devices generate periodic hellos to other routing devices in the group to guarantee that end stations always have a default gateway that can forward their traffic if either of them fails.

It's important to point out that if you don't configure preemption, the first routing device that comes up takes on the active role and the second routing device takes on the standby role.
Therefore, if you're setting up load balancing between routing devices so that certain routing devices handle traffic for certain VLANs and other routing devices handle traffic for other VLANs, you'll want to use preemetion so that whenever a filed routing device comes back online, it resumes its former role.

#### HSRP Configuration

##### Basic Configuration

Only one command, `standby`, is necessary to enable HSRP.

```
### Routing device's interface
Router(config-if)# standby [group_#] ip IP_ADDR

or 

### Subinterface for a trunk port and a VLAN interface for an internal routing device, such as layer 3 switch
Switch(config-if)# standby [group_#] ip IP_ADDR
```

Each interface supports 256 HSRP groups. After you execute the `standby` command on an active interface, the routing device enters the learning state.
In this command, *group_#* is optional. If you omit it, it defaults to 0.
Note that *group_#* is required if you have mutliple standby groups. Remeber that the IP address you specify in the `standby` command is not the actual IP address that's on the interface, but rather the virtual IP address.
You need to take the virtual IP address and either hard-code it as the default gateway address on end stations or put it in your DHCP server configuration.

To ensure that the end stations do not discover the real MAC address of the rougin device's LAN interface, enabling HSRP disable ICMP redicrects.
You'll see the `no ip redirects` command on the routing devic's interface.

##### Load Balancing

To influence which routing devices perform the active and standby roles, you can increase the routing device priorites.
To do so, execute the following `standby` command on the routing device's interface:

```
IOS(config-if)# standby [group-number] priority NEW_PRIORITY
```

Remember that the higher the priority, the more likely it is that the routing devices will become a standby or active routing device.
The priority defaults to 100 but can be set to a value from 0 to 255.
To configure a routing device so that it can preemt the current standby or active routing device, use the `preemet` parameter:

```
Switch(config-if)# standby [group-number] preempt [delay DELAY_VALUE]
```

The default delay is 0 seconds, which causes the routing device to begin the preemption process immediately.
You can delay this by putting in a delay value of 0 to 3600 seconds (1 hour).
The one problem with preeption, however, is that it causes a slight disruption in traffic, because the currently active routing device demotes itself and the new routing device promotes itself.

To modify the hello and hold-down times:

```
Switch(config)# standby [group_#] timers HELLO_TIME HOLDDOWN_TIME
```

Here, `HELLO_TIME` defaults to 3 seconds and can range from 0 to 255 seconds, and `HOLDDOWN_TIME` defaults to 10 seconds and has the same range of valid values.

If you want to configure authentication:

```
Router(config-if)# standby [group_#] authentication PASSWORD
```

The `PASSWORD` can be up to eight characters; if omitted, the password defaults to `cisco`.
The password needs to match on all HSPR routers in the same group.

#### Interface Tracking

In certain cases, it may be necessary for the active routing device to step down from its role and let another routing device assume the role.

![[Pasted image 20251021034822.png]]

In this example, RP-B is the active RP for VLAN 20. If RP-B fails, RP-A notices this after missing the hello messages from RP-B. Then RP-A promotes itself and starts forwarding frames that are destineed to the virtual MAC address.

Assume, that RP-B does not fail but instead its interface vlan40 fails (connected to the core).

![[Pasted image 20251021035015.png]]

Without HSRP running, RP-B would detect the failure and generate an ICMP redirect message to RP-A.
This would enable RP-A to handle the redirected traffic. However, if RP-A and RP-B are participating in an HSRP group, ICMP redirects are disabled.
This means that RP-B still functions as the active routing device and handles all traffic sent to the virtual MAC address. The problem, however, is that after the layer 3 routing protocol has converged, the traffic still reaches its destination. But to reach the destination, the traffic must pass through both RP-B and RP-A, thus introducting unnecessary latency.

To overcome this problem and still be able to deploy HSRP, you can employ the HSRP interface tracking feature.
Interface tracking enables the active routing device to lower its priority when one of the interfaces that its' tracking fails.
This would enable another RP to assume the active role.

RP-B, with interface tracking configured, would lower its priority, essentially telling other routing devices that it no longer wants to serve as the active routing device.
When RP-A sees that RP-B advertising a lower priority than it self, RP-A promotes itself and handles all traffic destined for the virtual MAC address.

The advantage of this approach is that the traffic from the user will traverse only one RP: RP-A.

To configure interface tracking:

```
Switch(config-if)# standby [group_#] track INTERFACE_TYPE INTERFACE_#
					[decrement_value]
```

The `track` parameter is used to enter the interface that you want the HSRP RP to track.
If the interface fails, for whatever reason, the active routing device decrements its HSRP priority by the configured value.

Note that `decrement_value` is optional and, if omitted, defaults to a decrement of 10 for the priority.

#### HSRP Verification

To verify the overall operation of HSRP, use the `show standby` command on the RP.
For a shorter description, add the `brief` parameter the precedding command: `show standby brief`

For additional troubleshooting, you can use `debug standby` command. This command displays all HSRP messages that have been sent and received by the RP.

### Other Protocols

#### VRRP (Virtual Rotuer Redundancy Protocol)

VRRP performs a similar function as HSRP. The one major downside to HSRP is that it is a proprietary protocol.
VRRP, however, is an open standard and is defined in IETF RFC 2338.

Like HSRP, VRRP has end stations that use a virtual router for a default gateway. VRRP is supported for Ethernet media types as well as in VLANs and multiprotocol label switching (MPLS) VPNs.

VRRP and HSRP are very similar protocols, One main difference between VRRP and HSRP, however, is that HSRP uses a virtual IP address for a default gateway, whereas VRRP can use either a virtual IP address or the interface address of the master router.
If a virtual address is used, an election process takes place to choose a master router.
The router with the highest priority is chosen as the master.
All other routers are backup routers.
If a real IP address is used, the router that has that address assigned to its interface must be the master router.

VRRP is an IP protocol and has an IP protocol number of 112. The VRRP master router is responsible for generating VRRP multicast messages.
It sends these messages to a multicast address of 224.0.0.18. The master typically generates these messages every second.
If the master VRRP rotuer fails, a backup VRRP router seamlessly process the traffic sent to the master router's IP address.
This process is selected as the master of the group based on priority and interface tracking.
VRRP supports preemption so that a failed master, after it has been repaired, can resume its role as master.

#### GLBP (Gateway Load Balancing Protocol)

GLBP is a Cisco-proprietary protocol, like HSRP, One of the limitations of HSRP and VRRP is that only one router in the HSRP group is active and can forward traffic for the group, the rest of the routers sit idle.

This is not an efficient process, because one or more routing devices are not processing any traffic and you are not taking advantage of the bandwidth of the connections that these other routing devices are connected to.

Cisco designed GLBP to rectify this issue. GLBP enables the dynamic assignment of a *group* of virtual addresses to end stations.
With GLBP, up to four routing devices in the group can participate in the forwarding of traffic.
Plus, if a GLBP routing device fails, fault detection occurs automatically and another GLBP routing device picks up the forwarding of packets for the failed routing device.

**Some benefits of GLBP**

* Like HSRP, GLBP supports clear-text and MD5 password authentication between GLBP routing devices.
* GLBP supports up to 1024 virtual routers on a routing device.
* GLBP can load balance traffic via four forwarding routing devices in a subnet or VLAN.

#### GLBP Operation

In GLBP, there are two types or routers: active virtual gateways (AVGs) and active virtual forwarders (AVFs).

THE AVG is the master gateway device and is responsible for assigning virtual MAC address to end stations when the end stations perform an ARP for the GLBP default gateway address.
Basically, the AVG is responsible for address management in the GLBP group.

An AVF is a routing device that forwards traffic for a GLBP group. The AVG is also an AVF.
Basically, up to four routing devices configured in the same GLBP group are AVFs.

**Basic illustration of how GLBP works**
![[Pasted image 20251021164757.png]]

In this example, RP-A is the master (AVG).

When PC-A sends an ARP request for the default gateway MAC address, the AVG is responsible for responding with a virutal MAC address to the end station.

In this example, it responds with its own virtual MAC address. PC-B then ARPs for the same gateway address. RP-A responds with a virutal MAC address. Based on the load-balancing algorithm used by GLBP, RP-A responds with a different virtual MAC address (RP-B's address).

Both RP-A and RP-B are forwarding traffic for the same VLAN.

GLBP also supports interface tracking. With interface tracking, if a tracked interface on a AVF fails, the AVF demotes itself and ahs another AVF pick up the processing associated with this failed interface.
This process is similar to HSRP's interface tracking feature.

#### Load Balancing with GLBP

Multiple RPs can be used to forward traffic with GLBP to perform load balancing.
GLBP supports three methods of load balancing:

* Round-robin
* Weighted
* Host-dependent

The default method of load balancing is round-robin, in which the AVG assigns a different AVF deafult gateway address to each client.
If you have two routing devices and six clients, three clients will use the AVG and three will use the AVF.

With weighted load balancing, a weighting factor is used to determine which AVF's address the AVG routing device assigns to an end stateion.
This enables you to tune GLBP so that a certain amount of hosts use one routing device rather than another if there is a difference in processing power between the routing devices.

With host-based load balancing, a host is assigned the same virtual gateway address each time.
However, if the routing device associated with this address fails, another routing device within GLBP can pick up the processing so that redundancy is provided.

---

## Chapter Review

`ip route`
`show ip route`

---

## Quick Review

### Understanding Routing

* There are different types of routes: With a *connected* route, the router establishes a direct connection to the network. You must manually configure a *static* route.
* Use the *ip route* command to configure a static route
* use the *show ip route* command to view the routing table.

### Understanding Dynamic Routing

* There are two major types of routing protocols: *distance vector* and *link state*.
* Distance vector routing protocols share routing information with neighboring routers and measure the best route according to the number of hops required to reach destination.
* Link state routing protocols share routing information with all routers on the network and include information on the state of the link.
* RIP and IGRP are examples of distance vector routing protocols.
* OSPF and IS-IS are examples of link state routing protocols.
* Use the `router` and `network` commands to set up dynamic routing protocols.

### The Routing Process

* A floating static route is used as a backup to a primary route.
* You configure a floating static route by creating a static route with an administrative distance higher than the primary route.
* Routes are first selected based on the network ID with the longest network prefix.
* After the router selects the routes that match the destination network with the longest prefix, if there are still multiple routes to the destination, the router will select the one with the lowest administrative distance value.
* If there are multiple routes because they have the same administrative distance value, the router will select the route based on the metric value.

### Routing Troubleshooting Commands

* `clear ip route`
	* rebuild the routing table
* `show ip route`
	* view the routing table
* `show ip protocols`
	* view details about the dynamic routing protocol being used.

### Router-on-a-Stick

* A router-on-a-stick is a router with a single trunk connection to a switch; a router routes between the VLANs on this trunk connection.
* To route between VLANs with a router-on-a-stick, use subinterfaces and specify the VLAN with the `encapsulation isl|dot1q` command on the subinterface.

### Router High Availability

* To enable HSRP, use the `standby ip` command on a routting device's interface.
* HSRP is a proprietary and VRRP is an open standard. Both accomplish the same thing: default gateway redundancy within a VLAN.
* HSRP uses a virtual address as the default gateway address; VRRP supports the use of a physical or virtual address.
* GLBP, which is a proprietary to Cisco and based on HSRP, enables more than one active routing device in a subnet.

---

### Questions

1.  What is the first technique used by the router in the routing selection process to select a route for a packet?

A. Administrative distance
B. Dynamic routing protocol used
C. Routing protocol metric
**D. Longest matching prefix**

2.  What command is used to add the gateway of last resort of 192.168.9.1 to the router?

A. ip route 192.168.9.1 0.0.0.0 0.0.0.0
**B. ip route 0.0.0.0 0.0.0.0 192.168.9.1**
C. network route 0.0.0.0 0.0.0.0 192.168.9.1
D. default route 192.168.9.1

3.  Your router is running RIP and OSPF, and both routing protocols are learning 192.168.1.0/24. Which routing protocol will your router use for this route?

A. Both
B. RIP
**C. OSPF**
D. Neither

Your router would select the route using OSPF, because it has a lower administrative distance than RIP.
OSPF uses an administrative distance of 110, while RIP has an administrative distance of 120.

4.  Which of the following is a valid virtual MAC address for an HSRP group?

A. 0000.6e00.0014
**B. 0000.0c07.ac18**
C. 0000.ac07.0c0a
D. 0000.0cac.0c0f

HSRP Virtual MAC addresses begin with 0000.0c07.ac

5.  What is the administrative distance of RIP?

**A. 120**
B. 110
C. 1
D. 90

RIP has an administrative distance of 120

6.  How do you create a floating static route?

A. Add a static route with a smaller AD.
B. Add a dynamic route with a smaller AD.
C. Add RIP with an AD of 1.
**D. Add a static route with a larger AD.**

To create a floating static route, which is a backup route for an existing primary route, you simply add a static route but increase the administrative distance so it is higher than the primary route.

7.  What is the administrative distance value for OSPF?

A. 120
**B. 110**
C. 1
D. 90

OSPF has an administrative distance of 110.

8.  Which router-on-a-stick command defines the VLAN for the interface?

A. vlan
**B. encapsulation**
C. trunk
D. frame-type

Use the `encapsulation` command to specify the trunking, encapsulation, and VLAN number for the subinterface.

9.  Looking at the following network diagram, what is the command to add a static route on VAN-R1 to reach network 14.0.0.0/8?

![[Pasted image 20251021173039.png]]

A. route add 14.0.0.0 255.0.0.0 13.0.0.1
B. ip route 14.0.0.0 13.0.0.1
**C. ip route 14.0.0.0 255.0.0.0 13.0.0.2**
D. ip route 14.0.0.0 13.0.0.2

### Performance-based Questions

1.  Identify the components of the routing table by writing each of the labels in the box at the bottom beside the appropriate number on the left.

![[Pasted image 20251021173901.png]]

1. Destination network
2. Administrative distance
3. Metric
4. Next hop
5. Outbound interface
