
## Configuring Device Passwords

### Enable Password and Secret

Two types of enable passwords can be configured: the `enable password`, which is not encrypted in the configuration file, and the `enable secret`, which is encrypted in the configuratin file.

If both the enable password and the enable secret are set, you will need to use the secret to access privileged EXEC mode.

```
VAN-R1(config)#enable password ciscopass
VAN-R1(config)#enable secret ciscosecret

### verify
VAN-R1(config)#do show running-config
```

### Securing the Console and Auxiliary Port

Administrator would need to supply the console port password before even entering privileged EXEC mode and would need to supply the enable password or enable secret as well.

To configure a console password, navigate to the line con 0 port from global configuration mode and then set the password.

```
VAN-R1(config)#line con 0
VAN-R1(config-line)#password conpass
VAN-R1(config-line)#login
```

With console port password configured, if you connect to the console port on your device, you will notice that you are not prompted for a password.
This is because after setting the password, you must use the `login` command to indicate to the Cisco device that authentication is required on the port to prompt for the password.

Your router may have an auxiliary (AUX) port next to the console port. The auxiliary port is used as a backup line, where a modem can be connected to enable you to access your router remotely and perform administration changes.
Typically, you would remotely access the router with SSH, but if something went wrong with the interface and you could not connect from across the network, you could connect a modem to the router's auxiliary port and then dial into the router.

To configure a password on a auxiliary port, navigate to the AUX line, and set password.

```
VAN-R1(config)#line aux 0
VAN-R1(config-line)#password auxpass
VAN-R1(config-line)#login
```

### Securing VTY Ports

To configure a password on the virtual type terminal (VTY) ports, navigate to the VTY lines and then use the `password` command.

```
VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#password telnetpass
VAN-R1(config-line)#login
```

### Exercise 17-1: Configuring Passwords on the Cisco Routers

![[Pasted image 20251115224043.png]]

**Router configuration**

```
VAN-R1#config t
VAN-R1(config)#interface G0/0
VAN-R1(config-if)#ip addr 12.0.0.1 255.0.0.0
VAN-R1(config-if)#interface S0/3/0
VAN-R1(config-if)#ip addr 13.0.0.1 255.0.0.0
VAN-R1(config-if)#exit
VAN-R1(config)#do copy running-config startup-config

LA-R1#config t
LA-R1(config)#interface S0/3/0
LA-R1(config-if)#ip addr 13.0.0.2 255.0.0.0
LA-R1(config-if)#interface G0/0
LA-R1(config-if)#ip addr 14.0.0.1 255.0.0.0
LA-R1(config-if)#exit
LA-R1(config)#do copy running-config startup-config
```

**exec mode password**

```
#### VAN-R1
### Password
VAN-R1(config)#enable password ciscopass
### secret
VAN-R1(config)#enable secret ciscosecret

### verify
VAN-R1(config)#do show running-config

### save configuration
VAN-R1(config)#do copy running-config startup-config
```

**Console, AUX, VTY password**

```
#### VAN-R1
## Console password
VAN-R1(config)#line con 0
VAN-R1(config-line)#password labconpass
VAN-R1(config-line)#login

## AUX password
VAN-R1(config)#line aux 0
VAN-R1(config-line)#password labauxpass
VAN-R1(config-line)#login

## VTY password
VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#password labvtypass
VAN-R1(config-line)#login

## save configuration
VAN-R1#copy running-config startup-config
```

### Configuring Users

#### Creating User Accounts

You can create a list of user account names and passwords that are stored locally on your Cisco device.

```
VAN-R1(config)#username my_user password mypass
```

Next, use the `login local` command on each of the port types that will use that list for authentication.
In the `login local` command, `login` means force authentication, but `local` means use the local database of usernames and passwords for the authentication (not just the port password).

For example, the following commands would configure the console port to require someone to log on with a username and password to get local access to the device:

```
VAN-R1(config)#line con 0
VAN-R1(config-line)#login local
```

You would use the `login local` command on the VTY ports and the auxiliary port if you wanted to require authentication that is verified against the username and password list.

#### Privilege Levels

There are 16 privilege levels on Cisco device, numbered 0 to 15, with 0 being the lowest amount of privilege and 15 being the highest amount of privilege.

You can assign a privilege level to a user, and then associate that privilege level to command so that the user can execute that command.

```
VAN-R1(config)#username adminguy privilege 3 password adminpass
```

If you want to change the privilege level of a command so the user can execute that command, you assign the command the same privilege level with the `privilege exec` command:

```
VAN-R1(config)#privilege exec level 3 show running-config
```

If you are unsure of your privilege level, you can use the `show privilege` command

```
VAN-R1>show privilege
Current privilege level is 1
```

### Exercise 17-2: Creating Users on Cisco Devices

* Create user account
* modify the console port to require a username and password when logging on to the Cisco device.

```
### create users
VAN-R1(config)#username bob password bobpass
VAN-R1(config)#username sue password suepass

### modify login
VAN-R1(config)#line con 0
VAN-R1(config-line)#login local
VAN-R1(config-line)#line aux 0
VAN-R1(config-line)#login local
VAN-R1(config-line)#line vty 0 15
VAN-R1(config-line)#login local

### save configuration
VAN-R1(config)#copy running-config startup-config
```

### Encrypting Passwords

You can encrypt all passwords in your Cisco configuration files with `service password-encryption`

```
VAN-R1(config)#service password-encryption
VAN-R1(config)#do copy running-config startup-config
```

### Exercise 17-3: Encrypting Passwords on Cisco Devices

```
### check password encryption
VAN-R1#show startup-config

### encrypt passwords
VAN-R1#config t
VAN-R1(config)#service password-encryption

### verify
VAN-R1(config)#do show startup-config

### save configuration
VAN-R1(config)#do copy running-config startup-config
```

### Configuring SSH

> Telnet uses TCP port 23 and does not encrypt the communication.
> SSH uses TCP port 22 and encrypts all communication.

Configuring SSH requires a few perparation steps:

1. Configure a hostname on your router if one does not already exist.
2. Create a username and password that administrators will use to authenticate to the device when they connect using SSH.
3. Configure a domain name on the device, as this domain name is used to generate the cryptographic key used for the encryption.

```
Router(config)#hostname VAN-R1
VAN-R1(config)#username joe password joepass
VAN-R1(config)#ip domain-name joe.com
```

You will also need to verify that the Cisco device is using a crypto-supported IOS version, such as one that has *K9* at the end of the IOS image filename.

After you have completed the preparation steps, you are ready to generate the encryption key with the `crypto key generate rsa` command

```
VAN-R1(config)#crypto key generate rsa
The name for the keys will be: VAN-R1.joe.com

...

How many bits in the modules [512]: 512

...
```

Notice that the name for the key is based on the hostname and the domain name that you configured. When you are asked the bit strength to use, accept the deafult of 512.

Now that you have the encryption key you can configure the VTY ports to only accept a connection if it is using SSH.

```
VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#login local
VAN-R1(config-line)#transport input ssh
```

### Exercise 17-4: Enforcing SSH for Remote Administration

```
### create user
VAN-R1(config)#username user password Pa$$w0rd

### set doamin name
VAN-R1(config)#ip domain-name exer17-4.loc

### create encryption key
VAN-R1(config)#crypto key generate rsa

### enforce ssh
VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#login local
VAN-R1(config-line)#transport input ssh

### write configuration
VAN-R1#copy running-config startup-config
```

---

## Configure Layer 2 Security Features

### Disable Unused Ports

This will help prevent an unauthorized person from connecting to an empty port and gaining network access.
To disable the port, use the `shutdown` command on port:

```
VAN-SW1(config)#interface g0/10
VAN-SW1(config-if)#shutdown

### verify
VAN-SW1#show ip interface brief
```

If you wanted to shut down a number of ports on your switch at one time, you could use the `interface range` command to select the ports.

```
VAN-SW1(config)#interface range g0/12 - 24
VAN-SW1(config-if)#shutdown

### verify
VAN-SW1#show ip interface brief
```

### Port Security

After disabling any unused ports on the switch, your next step in hardening the switch is to configure port security on the used ports.

Port security is a feature that enables you to specify which MAC addresses are authorized to use a port. If an unauthorized device connects to the port, the port security feature can shut down the port until the administrator enables it.

```
VAN-SW1(config)#interface g0/7
VAN-SW1(config-if)#switchport mode access
VAN-SW1(config-if)#switchport port-security
VAN-SW1(config-if)#switchport port-security mac-address sticky
VAN-SW1(config-if)#switchport port-security maximum 1
VAN-SW1(config-if)#switchport port-security violation shutdown
```

### DHCP Snooping

A common problem encountered on enterprise networks today occurs when a rogue DHCP server is placed on the network and gives out bogus IP addresses to network clients. This causes the client computers to be unable to access network resources, because the address the client is assigned is typically on a different subnet.

A rouge DHCP server presents great security risk to the organization, as a hacker could have placed the rouge DHCP server on the network to give out her own iP address range, including the default gateway and DNS server settings. This gives the attacker the ability to perform a man-in-the-middle attack, because she can hvae the default gateway set to her own system, causing all traffic to flow through her system.

You can use a layer 2 switch feature called *DHCP snooping* to mitigate rouge DHCP servers.
With DHCP snooping, you can categorize a port as either a *trusted port* or an *untrusted port*.
You configure the port that your DHCP server is connected to as a trusted port, indicating that the port is under your control is authroized to generate DHCP server messages. You then configure all other ports as untrusted ports, because the DHCP server is not connected to them. Then, if someone connects a rogue DHCP server to one of the untrusted ports, the switch will drop the DHCP server related messages such as DHCPOFFER, DHCPACK, and DHCPNACK, protecting the network from the rogue DHCP server.

#### Configuring DHCP Snooping

The DHCP snooping feature is disabled by default must be enabled globally and then enabled for each VLAN on the switch.

```
### enable DHCP snooping on the switch and then for VLAN 1
Switch(config)#ip dhcp snooping
Switch(config)#ip dhcp snooping vlan 1
```

These two commands should be the last commands you run. The reason these should be the last two commands is because now DHCP snooping has been enabled, but we did not specify any trusted ports, which means that your real DHCP server on the network is currently not allowed to give addresses out to clients until you configure it in a trusted port.

To enable your DHCP server to give addresses out on the network, you configure the switch interface that the DHCP server is connected to as a trusted port.

```
Switch(config)#interface g1/0/2
Switch(config-if)#ip dhcp snooping trust
```

#### DHCP Snooping Binding Database

As the switch is intercepting DHCP messages, it is building up to the *DHCP cnooping binding database*, which is a listing of the untrusted hosts (hosts connected to untrusted ports) that have received IP addresses from the DHCP server.

The DHCP snooping binding database contains an entry for each untrusted interface that has a system connected with details such as the interface ID, the MAC address of the client, the IP address of the system connected to that port, and the VLAN the interface is part of.
If you want to view the DHCP snooping binding database, you can use the `show ip dhcp snooping binding` command.

The DHCP snooping binding database is maintained by the switch, so as DHCPACK message are seen by the switch, it adds the entry to the database, and as DHCPRELEASE messages are seen, it removes the entries from the database.

### Dynamic ARP Inspection

When a device talks to another device on the network, it must first learn the MAC address of the device so that it can send data to that device. That devices use ARP to learn the MAC addresses of devices on the network by broadcasting an ARP request message. The broadcast is seen by all systems but ignored by all except one system that has that specific MAC address. That system sends an ARP reply. When a device receives the ARP reply, it stores that information in an area of memory known as the ARP cache, which is a listing of IP addresses and corresponding MAC addresses.

Devices on the network will trust any information in the ARP cache by default.

Attackers have learned to perform ARP poisoning attacks, which enable them to put incorrect information in the ARP cache unknowlingly that your system will trust.

To improve security and help prevent ARP poisoning attacks (and MITM attacks), Cisco switches include the *Dynamic ARP Inspection (DAI)* feature.
If you enable the DAI feature on the switch, the switch will intercept all ARP messages and then compare the information in the ARP message with the data stored in the DHCP snooping binding database. For example, after you enable DAI, if an attacker sends out an ARP poision message that says he is using the IP address of the default gateway and gives the MAC address of his system, the switch will look up that IP address in the DHCP snooping binding database and verify that it is the correct MAC address to go with that IP address. If is not, the packet is dropped.

DAI performs cheks only on untrusted ports, because it uses the DHCP snooping binding database, which stored information only on untrusted ports.
Also, like DHCP snooping, DAI is configured on a per-VLAN basis.

```
### configure dynamic ARP inspection on the switch for VLAN 1
Switch(config)#ip arp inspection vlan 1
```

If you have a number of switches connected together, you would configure the connected ports of the switches (trunk ports) as trusted ports so that your switches do not verify the ARP messages coming from those ports.

---

## Implementing Access Control Lists

### ACL Overview

ACLs, known for their ability to filter traffic as it either enters or leaves an interface, can also be used for other purposes, including restricting remote access (VTY) to an IOS device, filtering routing information, prioritizing traffic with queuing, triggering phone calls with dial-on-demand rouging (DDR), changing the administrative distance of routes, and specifying traffic to be protected by an IPsec VPN, among many other purposes.

#### Definition

ACLs are basically a set of commands, grouped together by a number or name, which are used to filter traffic entering or leaving an interface.
ACL commands define specifically which traffic is permitted and which is denied. ACLs are created in Global Configuration mode.

Once you create your group of ACL statements, you must activate them. For filtering traffic between interfaces, the ACL is activated in Interface Subconfiguration mode. This can be a physical interface, or a logical interface.
When activating an ACL on an interface, you must specify in which direction the traffic should be filtered:

* **Inbound**
	* As the traffic comes into an interface from an external source, IOS compares the packet to the interface ACL before IOS forwards the packet to another interface.
* **Outbound**
	* The packet is received on an interface and forwarded to the exit interface; before the traffic exits an interface to the network, IOS compares the packet to the ACL.

One restriction that ACLs have is that they cannot filter traffic that the router itself originates. For example, if you execute a ping a traceroute from the router, or if you telnet from the router to another device, ACLs applied to the router's interfaces cannot filter these connections outbound.
However, if an external device tries to ping, traceroute, or telnet to the router or through the router to a remote destination, the router can filter these packets.

#### Types

ACLs come in two varienties: *numbered* and *named*. Numbered and named ACLs define how the router will reference the ACL.

A numbered ACL is assigned a unique number among all ACLs, whereas a named ACL is assigned a unique name among all named ACLs. These are then used by the router to filter traffic.

Each of these references to ACLs supports two types of filtering: *standard* and *extended*.
Standard IP ACLs can filter only on the source IP address inside a packet, whereas extended IP ACLs can filter on the source and destination IP addresses in the packet, the IP protocol (TCP, UDP, ICMP, and so on), and protocol information (such as the TCP or UDP source and destination port numbers or ICMP message types).
With an extended ACL, you can be very precise in your filtering. For example, you can filter a specific telent session from a user's PCs to a remote telnet server. Standard ACLs do not support this form of granularity. With a standard ACL, you can either permit or deny all traffic from a specific source device.

| Filtered Information               | Standard IP ACL | Extended IP ACL |
| ---------------------------------- | --------------- | --------------- |
| Source address                     | Yes             | Yes             |
| Destination address                | No              | Yes             |
| IP Protocol (IP, TCP, or UDP)      | No              | Yes             |
| Protocol Information (port number) | No              | Yes             |

The two types of ACLs can be statically defined on the IOS device or dynamically downloaded via an authentication server.
Dynamic ACLs are typically used when a user authenticates to the network, such as via a switch port using IEEE 802.1X; once a user is successfully authenticated, the switch downloads an ACL from an authentication server and applies it to the user's switch port. The ACL is then used to filter the traffic. Once the user leaves the network, the dynamic ACL is removed from the switch port.

### ACL Processing

When a packet is processed by an ACL, IOS will go through certain steps in finding a match against the ACL statements.
ACLs are processed *top-down* by IOS. A packet is compared to the first statement in the ACL, and if IOS finds a match between the packet and the statement, IOS will execute one of two actions included with the statement: *permit* or *deny*.

If IOS doesn't find a match of packet contents to the first ACL statement, IOS will proceed to the next statement in the list, again going through the same matching process.

If IOS goes through the entire list and doesn't find a match in the ACL statements to the ACL contents, the router will *drop* the packet.

* Once a match is found, no further statements are processed in the lsit.
* The order of statements is important, since after the first match, the rest of the statements are not processed.
* If no match is found in the list, the packet is dropped.

#### Statement Ordering

1. Permit traffic from subnet 172.16.0.0/16
2. Deny traffic from host 172.16.1.1/32

Assume that a packet is received on the router with a source IP address of 172.16.1.1.
Given the preceding ACL, the router compares the packet contents with the first statement. Does the packet have a source address from network 172.16.0.0/16? Yes. Therefore, the result indicates that the router should permit the packet.

1. Deny traffic from host 172.16.1.1
2. Permit traffic from subnet 172.16.0.0/16

If 172.16.1.1 sends traffic through the router, IOS first compares these packets with the first ACL statement. Since the source address matches 172.16.1.1, the router drops the packet and stops processing statements in the ACL.

#### Implicit Deny

If the router compares a packet to every statement in the list and does not find a match against the packet contents, the router will *drop* the packet. This process is referred to as *implicit deny*.

Given this process, it makes no sens to have a list of only deny statements, therefore, every ACL should have at least *one permit* statement: otherwise, an ACL with only deny statements will drop all traffic, given the deny statements and the hidden implicit deny statement.

#### Configuration Guidelines

* Statement order is important. Put the most restrictive statements at the top of the list and the least restrictive at the bottom.
* ACL statements are processed top-down until a match is found, and then no more statements in the list are processed.
* If no match is found in the ACL, the packet is dropped (implicit deny).
* Each grouping of ACL statements needs either a unique number or a unique name.
* The router cannot filter traffic that it, itself, originates.
* Only one IP ACL can be applied to an interface in each direction (inbound and outbound) two or more ACLs cannot be applied inbound or outbound to the same interface.
* Applying an empty ACL to an interface permits all traffic by default. In order for an ACL to have an implicit deny statement, you need at least one actual permit or deny statement in the ACL.

### Creating an ACL

To create a numbered ACL:

```
Router(config)# access-list ACL_# permit|deny conditions
```

Prior to IOS 11.2, you could give an ACL only a number as an identifer. Starting with IOS 11.2, an ACL can be referenced by a number or name.

The purpose of the ACL_# is to group your statements together into a single list or policy. You cannot choose just any number for an ACL. Each layer 3 protocol is assigned its own range or ranges of numbers.

**Valid ACL numbers for IP ACLs**

| Type        | ACL Numbers        |
| ----------- | ------------------ |
| IP Standard | 1-99, 1300-1999    |
| IP Extended | 100-199, 2000-2699 |

Numbered ACLs give you a limited number of lists that you can create, which is based on the range of numbers assigned to a protocol type. However, named ACLs do not have this restriction.
Basically, the number of named ACLs on a router is restricted only by the amount of RAM and NVRAM your router has.

The *conditions* is an ACL statement tell the router what contents in the packet need to match in order for the router to execute the action (`permit` or `deny`).
The conditions can include matching of IP addresses and protocol information.

### Matching on Addresses: Wildcard Masks

When dealling with IP addresses in ACL statements, you can use *wildcard masks* to match on a range of addresses instead of manually entering every IP address that you want to match on.

Wildcard mask is *not* a subnet mask. Like an IP address or a subnet mask, a wildcard mask is composed of 32 bits.

| Bit Value | Subnet Mask       | Wildcard Mask |
| --------- | ----------------- | ------------- |
| 0         | Host Component    | Must match    |
| 1         | Network Component | Ignore        |

With a wildcard mask, a 0 in a bit position means that the coresponding bit position in the address of the ACL statement *must* match the same bit position in the IP address in the examined packet.
A 1 in a bit position means that the corresponding bit position in the address of the ACL statement does *not* have to match the bit position in the IP address in the examined packet.

In reality, a wildcard mask is more an *inverted* subnet mask. For instance, if you want to match on any address in a subnet or network, you can simply take the subnet mask, invert its bit values, and you have a corresponding wildcard mask.

**binary conversion of a subnet mask to a wildcard mask**

255.255.0.0 (subnet mask)
11111111.11111111.00000000.00000000
00000000.00000000.11111111.11111111 (wildcard mask)
0.0.255.255 (wildcard mask)

255.255.240.0
11111111.11111111.11110000.00000000
00000000.00000000.00001111.11111111
0.0.15.255

#### Special Wildcard Masks

Two special types of wildcard masks exist: 0.0.0.0 and 255.255.255.255.

A wildcard mask of 0.0.0.0 tells IOS that all 32 bits of the address in the ACL statemet must match those found in the IP packet in order for IOS to execute the action for the statement.
A 0.0.0.0 wildcard mask is called a *host mask*.
If you configure 192.168.1.1 0.0.0.0, the IOS will convert this to `host 192.168.1.1` (keyword `host` precedes the IP address).

A wildcard mask of 255.255.255.255 tells the router the exact opposite of a 0.0.0.0 mask.
In this mask, all of the bit values are 1s, which tells IOS that it doesn't matter what is in the packet that it is comparing to the ACL statement, any address will match.
If you configure 0.0.0.0 255.255.255.255, the IOS will convert this to the keyword `any`.

#### Wildcard Mask Examples

| IP addr    | Wilcard Mask    | Matches                                                                     |
| ---------- | --------------- | --------------------------------------------------------------------------- |
| 0.0.0.0    | 255.255.255.255 | any                                                                         |
| 172.16.1.1 | 0.0.0.0         | Match only if the address is 172.16.1.1                                     |
| 172.16.1.0 | 0.0.0.255       | Match only on packets that are in 172.16.1.0/24 (172.16.1.0 - 172.16.1.255) |

### Activating an ACL

Once you have built your IP ACL, it will do noting until you apply it to a process in IOS.

```
### activate an ACL on an interface
Router(config)#interface TYPE
Router(config-if)#ip access-group ACL_# in|out
```

At the end of the `ip access-group` command, you must specify which ACL you are activating and in which direction:

* `in`
	* As traffic comes into the interface
* `out`
	* As traffic leaves the interface

Note that you can apply the same ACL to multiple interfaces on a router, or you can activate the same ACl twice on the same interface: inbound and outbound. You can also apply a nonexistent ACL to an interface.
A nonexistent ACL is an ACl that has no statements in it, an empty ACL will permit *all* traffic. For an ACL to have an implicit deny, it needs at least one `permit` or `deny` statement.
It is highly recommended that you do *not* apply nonexistent ACLs to a router's interface. In this situation, when you create the very first statement in the list, the implicit deny is automatically placed at the bottom, which might create reachability issues for your router.

Assume that you have applied an ACL (#10) to a router's ethernet0 interface and this ACL currently doesn't have any permit or deny statements.
You are connected to the router via telnet on this interface, and your PC has an IP address of 192.168.1.1 You create an entry in ACL #10 that permits traffic from 172.16.0.0/16. As soon as do this, you lose your telent connection.
If you guessed that the implicit deny caused the router to drop your connection, you guessed correctly. As soon as the router has one statement in it, the implicit deny is added at the bottom.

### Standard Numbered ACLs

Standard IP ACLs filter on only the *source IP address* in an IP packet.

```
Router(config)#access-list {1-99 | 1300-1999} {permit | deny} 
					SOURCE_IP_ADDR [wildcard_mask] [log]
```

With a standard numbered IP ACL, you can use list number of 1-99 and 1300-1999. Following this is the action the router should take if there is a match on the condition. The condition is based solely on the source IP address. You follow up to source IP address parameter with an optional wildcard mask. If you omit the mask, it defaults to 0.0.0.0, an exact match is required in order to execute the action.
Next is the optional `log` parameter, which was introduced to standard ACLs in IOS 12.0. This parameter will cause any match of this statement to be printed to the console port of the router. These messages, by default, will not appear on a *non-console* connection, such as a VTY or TTY, to the IOS device unless you exeucte the following:

```
Router# terminal monitor
```

> The `terminal monitor` command is good only for your current session: when you log out and then log back into the IOS device, you'll need to re-exectue the command to see logging output on your VTY or TTY session.

You can also forward these ACL logging messages to a syslog server. This setup is useful for debugging and security purposes.

Once you have created your ACL, you can proceed to activate it on an interface with the `ip access-group ACL_# in|out` command.

#### Standard IP ACL Example

```
Router(config)#access-list 1 permit 192.168.1.1
Router(config)#access-list 1 deny 192.168.1.2
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
Router(config)#access-list 1 deny any
Router(config)#interface serial 0
Router(config-if)#ip access-group 1 in
```

```
Router(config)#access-list 1 deny 192.168.1.2
Router(config)#access-list 1 permit 192.168.1.0 0.0.0.255
Router(config)#interface serial 0
Router(config-if)#ip access-group 1 in
```

permit 192.168.1.0/24, and deny others

#### Restricting VTY Access to the Router

First, you need to create a standard ACL that has a list of *permit* statements that allow your corresponding network administrators remote access; include the IP addresses of their PCs in this list.
Next, you need to activate your ACL.

However, you will not do this on any of the router's interfaces. If you were to activate this ACL on an interface, it would allow any type of traffic from your administrators but drop *all* other traffic.

Remember that when someone accesses your router via telnet or SSH, the router associates this connection with a VTY line. Therefore, you'll apply your standard ACL to the VTYs.

```
Router(config)#line vty 0 4
Router(config-line)#acess-class STANDARD_ACL_# in|out
```

You can configure all VTYs simultaneously by specifying the beginning and ending line numbers after the `vty` parameter.
If you don't apply the restriction to all of your VTYs, you are leaving a back-door into your router, which may cause a security problem.

Also notice the command used to apply the ACL to the line: `access-class`. This is different from activating an ACL on a router's interface.
If you use the `in` parameter, you are restricting telnet and SSH access to the router itself.
The `out` parameter is kind of unique. By using this paramter, you are restricting what destinations this router can telnet or SSH to when someone uses the `telnet`, `connect`, or `ssh` command. This creates an exception to a standard ACL and has the router treat the address in the ACL statements as a destination address; it causes the router to compare this address to the address in the `telnet` command before allowing the user on the router to telnet to the specified destination.

```
Router(config)# access-list 99 permit 192.168.1.0 0.0.0.255
Router(config)# line vty 0 4
Router(config-line)# access-class 99 in
```

In this example, only traffic from 192.168.1.0/24 is allowed to telnet or SSH into this router.

You can also use extended ACLs to restrict access to the IOS device, but this configuration is much more complex.
Second, extened ACls are applied to interfaces and thus won't be able to restrict telnet access *from* the router to a remote destination.
And thrid, whenever you apply an ACL to an interface on the router, you'll affect the performance of the router on that interface.
Therefore, if you only want to restrict telnet or SSH access to or from the router, using a standard ACL and the `access-class` statemtnt on your VTYs is the best approach.

### Exercise 17-5: Configuring Standard Numbered ACLs

* Create two standard ACLs in VAN-R1
	* First ACL will block all traffic from the 14.0.0.0 network except traffic from one IP address
	* Second ACL will be used to limit from which remote workstation the administrator is allowed to administer the router.

```
### Create ACL
VAN-R1(config)#access-list 1 permit 14.0.0.5 0.0.0.0
VAN-R1(config)#access-list 1 deny 14.0.0.0 0.255.255.255

VAN-R1(config)#access-list 2 permit 12.0.0.0 0.255.255.255

### apply ACL
VAN-R1(config)#interface g0/0
VAN-R1(config-if)#ip access-group 1 out
VAN-R1(config-if)#line vty 0 15
VAN-R1(config-line)#access-class 2 in
```

### Extended Numbered ACLs

Extended ACLs can match on:

* Source and destination IP addresses
* TCP/IP protocol (IP, TCP, UDP, ICMP, and so on)
* Protocol information, such as port numbers for TCP and UDP, or message types for ICMP

#### Command Syntax

```
Router(config)# access-list {100-199 | 2000-2699} {permit | deny}
					IP_PROTOCOL
					SOURCE_ADDR SOURCE_WILDCARD_MASK
						[PROTOCOL_INFO]
					DEST_ADDR DEST_WILDCARD_MASK
						[PROTOCOL_INFO] [log]
```

Extended IP numbered ACls can use list numbers in ranged 100-199 and 2000-2699.

After the action (permit or deny) comes the IP protocol that you want to match on. This is the first major difference between an extended ACL and a standard one. These IP protocol include the following: `ip`, `icmp`, `tcp`, `gre`, `udp`, `igrp`, `eigrp`, `igmp`, `ipinip`, `nos`, and `ospf`. If Cisco dosen't have a name for the IP protocol you want to specify, use the number of the protocol instead, such as 6 for TCP.

The second major difference is that you must specify both the source and destination addresses and their respective wildcard masks. With a standard ACL, you can specify only the source address, and the wildcard mask is optional. Depending on the IP protocol information, you may be able to add protocol information for the source and/or destination.
For example, TCP and UDP enable you to specify both source and destination port numbers, and ICMP enables you to specify ICMP message types.

As with standard ACLs, you can log messages to the console or a syslog server with the `log` parameter.

Once you have created your extended numbered IP ACL, you must activate it on your router's interface with the `ip access-group` command.

#### TCP and UDP

```
Router(config)# access-list {100-199 | 2000-2699} {permit | deny}
					{tcp | udp}
					SOURCE_ADDR SOURCE_WILDCARD_MASK
						[operator source_port_#]
					DEST_ADDR DEST_WILDCARD_MASK
						[operator dest_port_#]
					[established] [log]
```

##### Operators

With TCP and UDP, you can specify the source, destination, or both source and destination port numbers or names.
To specify how to perform the match, you must configure an operator. The operator tells the router how to match on the port number(s) or names.

**operators**

| Operator | Explanation           |
| -------- | --------------------- |
| lt       | less than             |
| gt       | Greater than          |
| neq      | Not equal to          |
| eq       | Equal to              |
| range    | Range of port numbers |

These operators apply only to TCP and UDP connections. Other IP protocols do not use them. If you omit the port number or name, the ACL looks for a match on all TCP or UDP connections.

##### Port Numbers and Names

For TCP and UDP connections, you can list either the anem or the number of the port. For example, if you wanted to match on telnet traffic, you could either use the keyword `telnet` or the number 23.

**Common TCP port names and numbers**

| Port Name   | Common Parameter | Port Number |
| ----------- | ---------------- | ----------- |
| FTP Data    | ftp-data         | 20          |
| FTP Control | ftp              | 21          |
| Telnet      | telnet           | 23          |
| SMTP        | smtp             | 25          |
| WWW         | www              | 80          |
| POP3        | pop3             | 110         |

**Common UDP port names and numbers**

| Port Name | Common Parameter | Port Number |
| --------- | ---------------- | ----------- |
| DNS Query | dns              | 53          |
| TFTP      | tftp             | 69          |
| SNMP      | snmp             | 161         |
| IP RIP    | rip              | 520         |

##### The established Keyword

The `established` keyword is used only for TCP connections. The assumption behind the use of this keyword is that you are originating TCP traffic on the inside of the network and filtering the returning traffic as it comes back into your network.
In this situation, this keyword allows (or denies) any TCP traffic that has a certain flag or flag bits set in the TCP segment header, indicating that this is returning traffic back into your network.

#### ICMP

```
Router(config)# access-list {100-199 | 2000-2699} {permit | deny}
					icmp
					SOURCE_ADDR SOURCE_WILDCARD_MASK
					DEST_ADDR DEST_WILDCARD_MASK
						[icmp_message] [log]
```

Unlike TCP and UDP, ICMP doesn't use ports. Instead, ICMP uses message types. And where TCP and UDP extended ACLs enable you to specify both source and destination ports, ICMP enables you to enter an ICMP message.

**Common ICMP Messages**

| Message Type                | Message Desc                                        |
| --------------------------- | --------------------------------------------------- |
| administratively-prohibited | Indicates the packet was filtered                   |
| echo                        | Used by ping to check a destination                 |
| echo-reply                  | Response to an echo message created by ping         |
| host-unreachable            | Subnet is reachable, but the host is not responding |
| net-unreachable             | Network/subnet is not reachable                     |
| traceroute                  | Filters on traceroute information when ICMP is used |

> If you execute the `no access-list` command, followed by the ACL number, the entire ACL and its referenced commands are deleted.
> What most administrators don't realize, or forget, is that if you preface any numbered ACL statement with the `no` parameter, it has exactly the same effect: the entire ACL is deleted.
> For example, executing the `no access-list 100 permit tcp any any` command causes the router basically to ignore everything after 100 parameter, causeing the router to execute the command as if it were `no access-list 100`.

#### Extended IP ACL Example

```
Router(config)# access-list 100 permit tcp
					any 172.16.0.0 0.0.255.255
					established log
Router(config)# access-list 100 permit udp
					any host 172.16.1.1 eq dns log
Router(config)# access-list 100 permit tcp
					172.17.0.0 0.0.255.255
					host 172.16.1.2 eq telnet log
Router(config)# access-list 100 permit icmp
					any 172.16.0.0 0.0.255.255
					echo-reply log
Router(config)# access-list 100 deny ip any any log
```

The assumption behind this example is that it is restricting what traffic can come into a network.

The first statement says that if any TCP session has any source address and is destined to 172.16.0.0/16, it will be permitted if certain TCP flag bits are set (established) in the TCP segment header, indicative of returnning traffc.
Since a TCP port isn't specified, all TCP connections will match on this statement.

The second line of this example allows a DNS query from any source device to be sent to an internal DNS server (172.16.1.1).

The third line allows any telnet connection from devices in the 172.17.0.0/16 network if the destination device is 172.16.1.2.

The fourth line allows any replies to a ping to come back to devices with an address of 172.16.0.0/16. Note that only the echo replies are allowed, preventing someone from thie interface from executing pings.

The fifth line isn't necessary because all traffic not matching on the privous `permit` statements will be dropped. However, if you want to log what is dropped, you'll need to configure this statement with the `log` parameter.

```
Router(config)# interface G0/0
Router(config-if)# ip access-group 100 in
```

The last part of the configuration shows the ACL applied inbound on GigabitEthernet0.

### Named ACLs

Starting with IOS 11.2, Cisco routers support both numbered and named ACLs.
One of the original limitations of numbered ACLs was that you could create only so many of them. Originally, you could have only 99 standard IP ACLs and 100 extended IP ACLs.

Unlike in numbered ACLs, in named ACLs you can delete a single entry in the ACL without deleting the entire ACL.

#### Creating Named ACLs

```
Router(config)# ip access-list {standard | extended} ACL_NAME
```

The first thine you must specify is the type of ACL: standard or extended.
Second, you must give the ACL a name that groups the ACL statements together. This name must be unique among all named ACLs.

After you enter this command, you are taken into the appropriate ACL Subconfiguration mode.

```
Router(config-std-acl)#

or

Router(config-ext-acl)#
```

Once you are in Subconfiguration mode, you can enter your ACL commands, For a standard named ACL, use the following configuration:

```
Router(config)# ip access-list standard ACL_NAME
Router(config-std-acl)# permit|deny SOURCE_IP_ADDR [wildcard_mask]
```

For an extended named ACL, use the following configuration:

```
Router(config)# ip access-list extended ACL_NAME
Router(config-ext-acl)# permit | deny IP_PROTOCOL
						SOURCE_IP_ADDR WILDCARD_MASK
							[protocol_information]
						DEST_IP_ADDR WILDCARD_MASK
							[protocol_information] [log]
```

Once you have created your extended numbered IP ACL, you must activate it on your IOS device's interface with the `ip access-group` command, referencing a name instead of a number.

#### Example of a Named Access List

```
Router(config)# ip access-list extended do_not_enter

Router(config-ext-acl)# permit tcp any 172.16.0.0 0.0.255.255
							established log
Router(config-ext-acl)# permit udp any
							host 172.16.1.1 eq dns log
Router(config-ext-acl)# permit tcp 172.17.0.0 0.0.255.255
							host 176.16.1.2 eq telnet log
Router(config-ext-acl)# permit icmp any 176.16.0.0 0.0.255.255
							echo-reply log
Router(config-ext-acl)# deny ip any any log

Router(config)# interface GigabitEthernet 0/0
Router(config-if)# ip access-group do_not_enter in
```

### ACL Remarks

Starting in IOS 12.0(2)T, you can embed remarks or comments within your ACL statements. Remarks work with named or numbered ACLs.

```
Router(config)# access-list ACL_# remark REMARK

or

Router(config)# ip access-list standard|extended ACL_NAME
Router(config-{std|ext}-acl)# remark REMARK
```

The remark can be up to 100 characteres in length

### Access List Verfication

`show running-config`: display your ACL and the interface or interfaces on which it is activated.
`show ip interfaces`: Which ACLs are activated on router's interfaces.
`show access-lists [ACL_# | ACL_NAME]`, `show ip access-list [ACL_# | ACL_NAME]`: View the statements in your ACLs

> It is recommended that you put a `deny ip any any` command at the end of an extende ACL, even though the implicit deny statement will drop the traffic.
> By putting this statement at the end of your ACL, you can see the hit counts of all the denied traffic: since the implicit deny command is invisible, you can't see the hit counts for it.
> 
> `clear access-list counters [ACL_# | ACL_NAME]`: Clear counters

Using the `show access-lists` command displays all ACLs from all protocols on your router. If you want to view only a particular ACL, use `show access-lists [ACL_# | ACL_NAME]` or `show ip access-list [ACL_# | ACL_NAME]`

### ACL Changes

You basically had to make ACL changes in an external text editor such as vim, delete the old ACL on the router, and paste in the new commands.

However, starting in IOS 12.3, you can edit ACls on your IOS device on-the-fly with the *sequenced ACL* feature.
Sequenced ACLs enable you to insert and delete statements and remarks in an existing ACL.

With sequenced ACLs, each ACL command is given a unique sequence number. By default, the sequence numbers start at 10 and increment by 10.

```
Router# show access-lists
Extended IP access list 101
  10 permit ip host 191.168.101.69 any
  20 permit ip host 191.168.101.89 any
```

ACL 101 is using sequenced ACLs. The sequence numbers are added when the router boots up and loads the ACL or when you add or change the ACL from the CLI or Cisco Configuration Professional (CP).
Whenever you save the IOS's configuration to NVRAM, the sequence numbers are not stored with the ACL statements: Cisco implemented this feature for backword compatibility with older IOS versions that do not support sequenced ACLs.

Sequenced ACLs work with both named and numbered ACLs; however to edit a numbered ACL, you must reat it as though it were a named ACL.
Once you enter the ACL subcommand mode, you can delete an entry by prefacing the sequence number with the `no` command:

```
Router(config)# ip access-list {standard|extended} ACL_NAME | ACL_#
Router(config-{std|ext}-nacl)# no SEQUENCE_#
```

To insert a statement in an ACL, enter the ACL subcommand mode and preface the ACL statement with a sequence number that does not currently exist in the list of statements.

```
Router(config-{std|ext}-nacl)# SEQUENCE_# {permit | deny} ACL_CONDITION
```

Since sequence numbers increment by 10, if you need to insert more than nine statements in the same place in your ACL, you'll first need to resequence the entries in the list:

```
Router(config)# ip access-list resequence ACL_NAME | ACL_# 
					STARTING_SEQ_# INCREMENT
```

With this command, you need to specify the initial sequence number, and then the increment.

```
Router(config)# ip access-list resequence 101 100 100
Extended IP access list 101
  100 permit ip host 192.168.101.69 any
  200 permit ip host 192.168.101.89 any
```

---

## Understanding ACL Placement

First, don't go crazy with ACLs and create dozens and dozens of them across all of your router. This makes testing and troubleshooting your filtering rules almost impossible.

The second point is that you will want to limit the number of statements in your ACL.
An ACL with hundreads of statements is almost impossible to test and troubleshoot.

As to where you should place your ACLs, the following two rules hold true in most situlations:

* Standard ACLs should be placed as close to the destination devices as possible
* Extended ACLs should be placed as close to the source devices as possible

### Standard ACLs

You want to place standard ACLs as close to the destination that you want to prevent the source from reaching, since they enable you to filter only on the soruce IP address in the packet headers.

If you put the standard ACL too close to the source, you could be preventing the source from accessing other valid services in your network.
By putting the standard ACL as close to the destination as possible, you are still enabling the source to access other resources, while restricting it from accessing the remote destination device or devices.

**Placement of ACLs**
![[Pasted image 20251117020454.png]]

In this example, the user (192.168.5.1) should be prevented from accessing the server (192.168.1.1).

```
Router(config)# access-list 1 deny host 192.168.5.1
Router(config)# access-list 1 permit any
```

The goal is to prevent 192.168.5.1 from accessing the server at 192.168.1.1, and to allow to everyone else to access the server.

Your first choice is to place this ACL on RouterC. If you placed it here, 192.168.5.1 would not be able to reach 192.168.1.1, but the user wouldn't be ble to access anything else either.

If you placed the ACL on RouterB, the user would be able to access the 192.168.4.0 network, but nothing else.

You actually have two choices for placing the ACL on RouterA: interface E0 and E1.
If you placed it inbound on E1, the user wouldn't be able to access network 192.168.2.0. Therefore, you would have to place it outbound on E0 on RouterA.

Note that there is still an issue with using standard ACLs, any traffic from 192.168.5.1 is dropped as it sttempts to leave this interface. So the user is prevented from reaching not only the server but anything else on this segment.
Another issue with standard ACLs, since you typically place them as colse to the destination as possible, is that they are not very network-friendly: packets travel almost all of the way to the destination and *then* they are dropped. This wastes bandwidth in your network, especially if the source is sending a lot of traffic to the destination.

### Extended ACLs

Extended ACLs, since they can filter on *both* the source and destination addresses in the IP packet headers.
Given this ability, it is recommended that you place extended ACLs as *close* to the source as possible, thus preventing unwanted traffic from traversing your network.

With an extended ACL, since you can filter both addresses, you can prevent a source from accessing a particular destination or destinations but still allow it to access others.

![[Pasted image 20251117020454.png]]

```
Router(config)# access-list 100 deny ip host 192.168.5.1
										host 192.168.1.1
Router(config)# access-list 100 permit ip any any
```

This configuration example is preventing only traffic from 192.168.5.1 to 192.168.1.1.

You should place this ACL on RouterC. RouterC has two interfaces, In this case, placeing the extended ACL as close to the source as possible means placing it on RouterC's E1 interface in the inbound direction.
If you were to place it on E0, and the router had another interface that it could use to reach the destination, the source still might be able to get around the filter.
If you place it on RouterC's E1 interface, 192.168.5.1 can access every location except 192.168.1.1.

---

## Chapter Review

---

## Quick Review

#### Configuring Device Passwords

You can configure either an `enable password` or `enable secret`

Configure passwords on each of the types of ports (console, auxilary, and VTY) so that someone must authenticate to the system when they connect. You can prompt for a password by using the `login` command on the port type.

You can create a user account and password list and force authentication with the user list by using `login local` command.

You can encrypt all password in the configuration file by using the `service password-encryption` command.

To prepare for the configuration of SSH on your device, set the hostname and domain name of the deivce. This information used when you generate the encryption key.

To force SSH as a remote administraton protocol and not allow telnet, you must use the `transport input ssh` command on the VTY port

### Configure Layer 2 Security Features

Disable unused ports on the switch with the `shutdown` command.

Using the port security features, which locks down an enabled port so that can be used only by an authroized device.
Port security associates the MAC address with the port of the authorized system

To prevent rogue DHCP servers from sending out DHCPOFFER messages on the network, use DHCP snooping.

To prevent ARP poisoning attacks on the network, use dynamic ARP inspection, which validates the IP address and MAC address in an ARP message against the DHCP snooping binding database.

### Implementing Access Control Lists

Standard ACls are used to filter traffic by the source IP address only and have an ACL number assigned to them that ranges from 1 to 99 or 1300 to 1999

Extended ACLs are used to filter traffic based on the source and destination IP addresses, source and destination ports, and protocol information as well. Extended ACLs have an ACL number ranging from 100 to 199 or 2000 to 2699.

Each ACL has an implicit deny at the end of the ACL.

You can create an access list with the `access-list` command.

After creating the access lists, you apply it to the interface using `ip access-group` command.

You can apply an access list to the VTY ports with the `access-class` command.

#### Understanding ACL Placement

Standard ACLs should be placed as close to the destination devices as possible
Extended ACLs should be placed as close to the source devices as possible

---

### Questions

1.  What command would you use on a Cisco device to ensure that passwords are encrypted within the configuration files?

A. password-encryption
**B. service password-encryption**
C. password encrypt on
D. enable secret

2.  You have configured an enable password and an enable secret on your Cisco device. Which one will you need to use when you navigate to privileged EXEC mode?

A. The enable password
B. The strongest password of the two
**C. The enable secret**
D. The one that was configured first

3.  Looking at the following configuration performed by one of your network administrators, why are admins not prompted for a password when connecting to the console port?

```
VAN-R1(config)#line con0
VAN-R1(config-line)#password conpass
```

A. Need to configure an enable password
B. Need to configure an enable secret
C. Must add the authenticate command
**D. Missing the login command**

4.  You want to create an access list that filters traffic by the source IP address of the packet only. What type of access list would you use?

A. Extended
**B. Standard**
C. Extension
D. Basic

5.  Your manager is concerned with rogue DHCP servers being added to the network. What switch feature would you use to prevent rogue DHCP servers?

**A. DHCP snooping**
B. Dynamic ARP inspection
C. Access control list
D. Port security

6.  You are configuring SSH on a Cisco switch. What two conditions must exist for your configuration to be successful?

**A. The switch must be running a crypto-supported IOS image.**
B. You must have configured a console password.
C. Routing must be disabled.
**D. You must have run the ip domain-name command.**
E. You must have OSPFv2 running on the switch.

7.  You want to configure an access list that ensures only HTTP traffic is allowed to reach the system with the IP address of 10.0.45.10/24. What type of access list would you use?

**A. Extended**
B. Standard
C. Extension
D. Basic

8.  You have created an access list numbered 100 that you would like to apply to the GigabitEthernet 0/0 interface for inbound traffic. What commands would you use?

```
Router(config)# interface GigabitEthernet 0/0
Router(config-if)# ip access-group 100 in
```

Use the following configuration to answer questions 9 and 10.

```
VAN-R1(config)#enable password ciscopass
VAN-R1(config)#enable secret ciscosecret

VAN-R1(config)#username edtetz password edpass
VAN-R1(config)#useranem glenclarke password glenpass

VAN-R1(config)#line con 0
VAN-R1(config-line)#password conpass

VAN-R1(config)#line vty 0 15
VAN-R1(config-line)#password telnetpass
VAN-R1(config-line)#login
```

9.  In the configuration, administrators are not prompted for usernames and passwords when they try to administer the Cisco device remotely. What can you do to remedy this?

A. Add the login command to con 0.
B. Use stronger passwords on the user accounts.
**C. Change the login command to the login local command.**
D. Add the service password-encryption command.

10.  What password will administrators need to use to enter into privileged EXEC mode?

A. glenpass
**B. ciscosecret**
C. conpass
D. ciscopass

### Performance-based Questions

1.  You have configured an extended access list with the following rules:

```
access-list 120 deny tcp 145.13.45.100 0.0.7.255 any eq 23
access-list 120 deny tcp 145.13.45.100 0.0.7.255 any eq http
access-list 120 permit ip any any
```

Using the following exhibit, identify which packets would be denied and which packets would be permitted by writing the packet information in the boxes on the right.

![[Pasted image 20251117024428.png]]

1. Src IP: 145.13.15.29, Dest Port: 23
2. Src IP: 145.13.42.110, Dest Port: 23
3. Src IP: 145.13.45.10, Dest Port: 21
4. Src IP: 145.13.47.15, Dest Port: 80
	* Permitted
5. Src Ip: 145.13.51.12, Dest Port: 80
	* Permitted
