
## Command-Line Interface

How you access IOS CLI on a Cisco device for the first time depends on the kind of device you are configuring. In almost every case, you will use the console interface initially to interact with the device; however, gaining access to the CLI from the console port can be different from one device to another. On a Cisco router, for instance, you are taken directly to IOS CLI when you log in from the console port. If IOS cannot find a configuration file for the router or switch, IOS takes you through Setup mode (via the System Configuration Dialog), which is a basic configuration script that prompts you for information about how you want to configure your IOS device

Once you have configured your Cisco device via the console port, you can then use other methods of accessing and changing its configuration, such as telnet or Secure Shell (SSH), Cisco calls this virtual type terminal (VTY) access. Or you can use Trivial File Transfer Protocol (TFTP), File Transport Protocol (FTP), Simple Network Manage192ment Protocol (SNMP), or a web-based solution (Cisco Configuration Professional, or CCP, for routers).

A variety of Cisco management products can be used to configure and manage your Cisco device, such as the Cisco Security Manager (CSM)

보통 대부분의 device 에서, console interface (console port) 를 이용해서 처음 device 와 연결을 한 뒤에, 설정을 함 IOS가 default configuration 파일을 찾지 못하는 경우 *Setup Mode*로 진입해서 기본적인 설정을 한 뒤에 Telent, SSH (virtual type terminal, VTY access), TFTP, FTP, SNMP, 웹 기반 Solution (CCP)등으로 장비에 연결할 수 있음

### CLI Access Modes

For CLI interaction, four modes are supported:

* User EXEC
	* Provides basic access to IOS with limited command availability
	* simple monitoring and troubleshooting commands
* Privileged EXEC
	* Provides high-level management access to IOS
	* including all commands available at user EXEC mode
* Global Configuration
	* Enables configuration changes to be made to the device
* ROM Monitor (ROMMON)
	* Loads a bootstrap program that allows for low-level diagnostic testing of an IOS device
	* performing the password recovery procedure, and performing and emergency upgrade

First three apply to IOS. While in ROMMON mode, IOS has not loaded and therefore packets are not moved between interfaces of the device. Both EXEC modes can be password-protected, enabling you to limit who can access your device to perform mangement, configuration, and troubleshooting tasks.

### User EXEC Mode

Your initial access to the CLI is via the user EXEC mode, which has a only a limited number of IOS commands you can execute. Depending on the Cisco device's configuration, you may be prompted for a password to access this mode.

User EXEC mode is typically used for basic troubleshooting of networking problems.

```
IOS>
```

If you see a `>` character at the end of the line, you know that you are in user EXEC mode. The information preceding the `>` is the name of the Cisco device.

For instance, the default name of all Cisco routers is `Router`, whereas the 2960 switch's user EXEC prompt looks like this:

```
Switch>
```

These device names can be changed with the `hostname` command

### Privileged EXEC Mode

Once you have gained access to user EXEC mode, you can use the `enable` command to access privileged EXEC mode:

```
IOS> enable
IOS#
```

Once you enter the `enable` command, if a privileged EXEC password has been configured on the Cisco device, you will be prompted to enter it. Upon successfully authenticating, you will be in privileged EXEC mode. You can tell that you are in this mode by examining the CLI prompt (`>` changed to a `#`)

When you are in privileged EXEC mode, you have access to all of the user EXEC commands as well as many more advanced management and troubleshooting commands. These commands include extended ping and trace abilities, the ability to manage configuration files and IOS images, and the ability to perform detailed troubleshooting using `debug` commands. About the only thing that you can't do from this mode is change the configuration of the Cisco device, this can be done only from configuration mode.

**User EXEC**
* 간단한 troubleshooting 가능, prompt에 `>`
* `exit` 로 logout 가능 (또는 `logout`)

**Privileged EXEC**
* User EXEC 에서 `enable` command 로 진입
* User EXEC 에서 가능했던 command 사용 가능
* 추가적인 troubleshooting 가능
* extended ping, trace
* configuration file management
* IOS image management
* `debug` command 사용 가능
* Cisco deivce configuration 변경 불가능 (configuration mode에서만 변경 가능함)
* `disable` command로 User EXEC 모드로 재진입 가능함

## IOS Basics

### Command Abbreviation and Completion

The CLI of IOS enables you to abbreviate commands and parameters to their most unique characters. (명령어 축약 가능)
```
// enable 축약
IOS> en
IOS#
```
The Cisco device, internally, completes the command for you. However, the characters that you enter must make the command unique.

### Context-Sensitive Help

Context-sensitive help is supported at all modes within IOS, including user EXEC, privileged EXEC, and configuration modes.

If you are not sure what command you need to execute, at the prompt, type ether `help` or `?`.
![[스크린샷 2025-04-30 04.09.02.png]]

If you see `-- More --` at the bottom of the screen, this indicates that more help information is available than can fit on the current screen. On a Cisco device, if you press the `SPACEBAR`, IOS pages down to the next screen of help information; if you press the `ENTER` key, help scrolls down on line at a time. Any other keystroke breaks out of the help text

**`help` `?`**
* `SPACEBAR` 키로 페이지단위 이동 가능
* `ENTER` 키로 한 줄씩 이동 가능
* `any key` 를 누르면, interrupt

For more detailed help, you can follow a command or parameter with a space and a `?`.
![[스크린샷 2025-04-30 04.12.12.png]]

If you're not sure how to spell a command, you can enter the first few characters and immediately follow these characters with a `?`.

```
// shows that three commands begin with the letter e in priviledged EXEC mode.

Router# e?
enable erase exit
Router# e
```

### Error Messages

If you mistype a command, IOS will tell you that it has encountered a problem after it tries to execute the command.

```
% invalid input detected at '^'.
```

You should examine the line between the command that you typed in and the error message. Somewhere in this line, you'll see a `^` character. This is used by IOS to indicate that an error exists in the command line at that spot.

```
% incomplete command.
```

This error indicates that you have not entered all the necessary parameters for the command. The syntax of the command is correct, but more parameters are necessary.

```
% Ambiguous command: "show i"
```

more than one parameter for the `show` command begins with the letter `i`.

```
Router# show i?
idb interface ip ipv6
Router# show i
```

If you enter a command that IOS does not understand,
```
% Unknown command or computer name, or unable to find computer address
```

### Entering Commands

Four key features included in IOS relate to entering commands:
* Symbolic translation
* Command prompting
* Syntax checking
* Command recall

Whenever you enter a command in the CLI, the command-line parser dissects the command, making sure that it is a valid command with valid parameters.

if the CLI parser cannot find the actual command, IOS assumes that you are trying to telent to a machine by that name and attempts a Domain Name System(DNS) resolution of the name to an IP address. This process, (`symbolic translation`) can be annoying at times. But it does make telnetting to a remote machine easier, since you have to type only the name or IP address of the machine instead of using the `telnet` command

Use the `no ip domain-lookup` configuration mode command to disable DNS lookups on your IOS device.


You have already been presented with the command prompting feature this is most commonly seen when using the contect-sensitive help, such as the following:
![[스크린샷 2025-04-30 06.28.23.png]]

after you use the context-sensitive help with the `show` command, the command `show` remains on the command line after the displayed output, IOS is assuming that you are entering one of the parameters of this command and thus re-enters the command on the CLI. This can be annoying if you forget that the router is performing this function and re-enter the command, like this:
```
Router# show show
```

The CLI always parses your commands and checks their validity by using the `syntax checking` feature. Any nonexistent commands or improperly entered commands cause IOS to generate an error message with an appropriate error description.

Whenever you enter a command correctly, rarely will you see any output from IOS, unless the command you typed somehow changes the state of the router or one of its components, such as an interface comming up or going down. Therefore, you sould be concerned primarily enter a command and IOS displays a message you sould assume that a problem may exist.

command `recall` feature is it enables you to recall and edit previously executed commands

### Command-Line History

`show history`

```
IOS# show history
	enable
	show interface
	show version
	show history
IOS#
```

By default, an IOS device stores the last 10 commands that you executed.

you can increase the size of the history buffer size from 10 commands up to 256 by using `terminal history size`

```
IOS# terminal history size #_of_commands
```

### Editing the Command Line
![[스크린샷 2025-04-30 10.49.26.png]]

### IOS Feature Example

`clock` command to illustrate the helpfulness of some of IOS's command-line features. `clock` command is used on a router to set the current date and time.

```
IOS# cl?
clear clock
IOS#
```

```
IOS# clock ?
	set Set the time and date
```

```
IOS# clock set ?
	hh:mm:ss current time
```

```
IOS# clock set 15:00:00 ?
<1-31> Day of the month
MONTH  Month of the year
```

```
IOS# clock set 15:00:00 23 May ?
<1993-2035> Year
```

```
IOS# clock set 15:00:00 23 May 2004 ?
<cr>
IOS# clock set 15:00:00 23 May 2004
IOS#
```

The `<cr>` means that you can press the `ENTER` key and the IOS device will accept the command. On an IOS router, use the `show clock` command to see your current time and date:

```
IOS# show clock
15:00:02.187 UTC Fri May 23 2003
IOS#
```

## Basic IOS Configuration

Many of the configuration commands are the same on Cisco routers and switches, simplifying a basic setup of these devices; and thus each product has unique configuration commands

### Accessing Configuration Mode

All system/operating changes in IOS must occur within configuration mode. To access this mode, you must first be at privileged EXEC mode and use this command
```
IOS# configure terminal
IOS(config)#

or

IOS# conf t
```

This mode is commonly referred to as configuration mode or Global Configuration mode.

In configuration mode, you can execute commands that change your router's or switch's configuration; however, you cannot actually view the changes from within this mode, as this is done from privileged EXEC mode. To exit configuration mode and return to privileged EXEC mode, either type `end` or press `CTRL-Z`

### Device Identification

use the `hostname` command to change the name of the device.
```
Router(config)# hostname Perimeter
Perimeter(config)#
```

To undo changes or negate a command on a Cisco device, you can precede the command with the no parameter.
```
Perimeter(config)# no hostname Perimeter
Router(config)#
```

In certain cases, you don't have to include the parameters of the command when negating it.
```
Perimeter(config)# no hostname
Router(config)#
```

other cases, you must type in `no` and follow it with the entire configuration command.

*name is case-sensitive*

### Subconfiguration Modes

Certain configuration commands on IOS devices take you into a specific subconfiguration mode, commonly referred to as a `subcommand mode`
![[스크린샷 2025-04-30 11.34.39.png]]

> Not all subconfiguration modes are supported on all IOS devices.
> When you are working in a subconfiguration mode, the commands you enter affect only a specific component of the router or switch.

To leave a subconfiguration mode and return to Global Configuration mode, use the `exit` command. Using the `end` command or pressing `CTRL-Z` will always take you back to privileged EXEC mode no matter what configuration mode you are currenty working in.

```
IOS(config)# line con 0
IOS(config-line)# exit
IOS(config)#
```

In many cases, when you are working in a subconfiguration mode and type in a Global Configuration mode command, IOS executes it and the mode changes to Global Configuration mode.
```
IOS(config)# line con 0
IOS(config-line)# hostname 2960
2960(config)#
```

### Line Configuration

Lines on IOS devices provide access to an EXEC shell; sometimes this is called `character mode access`, since it deals with a CLI.
![[스크린샷 2025-04-30 12.38.39.png]]

The `line` command is used to reference a line in configuration mode. You must specify the type of line you want to configure as well as the line number, where line numbers begin at 0 and work their way up. Not that the console and auxiliary lines have only one line number: 0.

When configuring VTYs and TTYs, you can specify a range of numbers. Executing the `line` command takes you into subconfiguration mode, where the commands you enter affect that particular line or possible multiple lines with VTYs and teletype terminals (TTYs).

### Changing the inactivity Timeout

By default, an IOS device automatically logs you off after 10 minutes of inactivity. You can change this using the `exec-timeout` line subconfiguration mode command:
```
IOS(config)# line line_type line_#
IOS(config-line)# exec-timeout minutes seconds

IOS(config)# line console 0
IOS(config-line)# exec-timeout 0 0
```

this changes the configuration only for the line (or lines) you've specified. other lines will still use the default idle time. If you don't want a particular line to time out ever, you can set the minutes and seconds values to 0

*Disabling the timeout for a line is not recommended in a production environment*

If you want to disable the use of a line completely, use this configuration:
```
IOS(config)# line line_type line_#
IOS(config-line)# no exec
```

To verify your line configuration, use the `show line` command
![[스크린샷 2025-04-30 12.46.20.png]]

that the `show` command is not entered from configuration mode. To enter user and privileged EXEC mode commands in configuration mode, preface the commands with the word `do`, `do show line con 0`.

### Restricting VTY Protocol Access
By default, all methods of access are allowed for the VTYs, including telnet and SSH.

Controlling the type of connection allowed on the VTYs is done with the transport input (what protocol can be used to connect to the router) and `transport output` (what protocol can be used to connect from the router) commands:
```
IOS(config)# line vty line_# [line_#]
IOS(config-line)# transport input {all | telnet | ssh}
IOS(config-line)# transport output {all | telnet | ssh}
```

By default all protocols are allowed

In the following example, only the SSH protocol is allowed on the VTYs (to or from the router)
```
Router(config)# line vty 0 15
Router(config-line)# transport input ssh
Router(config-line)# transport output ssh
```

### CLI Output

once nice feature of an IOS device is that when certain types of events occur, such as an interface going down or up, an administrator making a configuration change, or an output of `debug` commands, the IOS device by default, prints an information message on the console line.

you can have IOS display these messages on your screen by executing the privileged EXEC `terminal monitor` command:
```
IOS# terminal monitor
```

You must execute this command after you have logged into IOS from the VTY, TTY, or auxiliary lines. Once you log out, however, this command does not apply to anyone else logging into IOS device on the same line; each individual line session must re-execute this command.

One annoying problem with the information messages displayed on your CLI screen is that if you are typing in an IOS command, when the device displays the message, it starts printing it right where the cursor is, making it difficult to figure out where you left off typing. just keep typing your command, or press `CTRL-C` to abort the command.

A better approach, tough, is to set up IOS so that after the message prints in your window, IOS redisplays what you have already entered on a new CLI prompt. The `logging synchronous` command accomplishes this:
```
IOS(config)# line line_type line_#
IOS(config-line)# loggin syunchronous
```

this command is executed under the line subconfiguration mode. If you want to implement this feature, you'll need to set it up under all the lines from which you'll be accessing your IOS device, including your VTYs and console port. You can also press `CTRL-R` to refresh the screen

### Interface Configuration

* how to configure and Ethernet interface
* how to configure serial interface
* troubleshoot layer 1 and layer 2 issues with the interfaces

To configure and interface, you must first enter interface subconfiguration mode:
```
IOS(config)# interface type [slot_#]port_#
IOS(config-if)#
```

```
// enable 모드에서 show interfaces 출력
R1#show interfaces
FastEthernet0/0 is administratively down, line protocol is down 
  Hardware is DEC21140, address is ca01.4e72.0000 (bia ca01.4e72.0000)
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog
     0 input packets with dribble condition detected
     0 packets output, 0 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     1 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
FastEthernet1/0 is administratively down, line protocol is down 
  Hardware is DEC21140, address is ca01.4e72.001c (bia ca01.4e72.001c)
  .....

// enable 모드 진입
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.

// show interfaces 에서 확인한 interface(FastEthernet0/0) configuration mode 진입
R1(config)#interface FastEthernet0/0

// interface configuration mode 진입성공함
R1(config-if)#
```

You must specify two components to the `interface` command: the `type` and `location`. When you enter the complete `interface` command, notice that the prompt changes, signifying that you are in interface subconfiguration mode for the specified interface (`config-if#`)

```
R1(config)#interface ?
  Async              Async interface
  Auto-Template      Auto-Template interface
  BVI                Bridge-Group Virtual Interface
  CDMA-Ix            CDMA Ix interface
  CTunnel            CTunnel interface
  Dialer             Dialer interface
  FastEthernet       FastEthernet IEEE 802.3
  Group-Async        Async Group interface
  Lex                Lex interface
  Loopback           Loopback interface
  MFR                Multilink Frame Relay bundle interface
  Multilink          Multilink-group interface
  Null               Null interface
  Port-channel       Ethernet Channel of interfaces
  SSLVPN-VIF         SSLVPN Virtual Interface
  Serial             Serial
  Tunnel             Tunnel interface
  Vif                PGM Multicast Host interface
  Virtual-PPP        Virtual PPP interface
  Virtual-Template   Virtual Template interface
  Virtual-TokenRing  Virtual TokenRing
  range              interface range command
  vmi                Virtual Multipoint Interface


R1(config)#interface FastEthernet0?
/  

R1(config)#interface FastEthernet0/?
  <0-1>  FastEthernet interface number

R1(config)#interface FastEthernet0/0?
.  :  <0-1>  

// interface type location
R1(config)#interface FastEthernet0/0

// changed mode to config-if
R1(config-if)#

// 다른 표기법으로도 접근 가능함
R1(config)#interface FastEthernet 0/0
R1(config-if)#exit
R1(config)#interface FastEthernet 0/0
R1(config-if)#exit
R1(config)#interface FastE 0/0
R1(config-if)#exit
R1(config)#interface F 0/0
R1(config-if)#exit
```

### Assign IP Address

After navigating to the interface, you can execute a number of commands to modify the characteristics of the interface. On a Cisco router, for example, you may want to assign an IP address to an interface with the following commands:
```
R1#
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#interface F 0/0
R1(config-if)#ip address 14.0.0.1 255.0.0.0

or

R1(config-if)#ip address dhcp

R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            14.0.0.1        YES manual administratively down down    
FastEthernet1/0            unassigned      YES unset  administratively down down    
Serial2/0                  unassigned      YES unset  administratively down down    
Serial2/1                  unassigned      YES unset  administratively down down    
Serial2/2                  unassigned      YES unset  administratively down down    
Serial2/3                  unassigned      YES unset  administratively down down  
```

### Enable and Disable the Interface

on Cisco routers, the interfaces are `disabled` by default. You can disable interfaces with the `shutdown` command while at the interface subconfiguration prompt, to enable the interface, use the `no shutdown` command

```
// interface down
IOS(config-if)# shutdown

// interface up
IOS(config-if)# no shutdown
```

> When copying and pasting a configuration file into the router, and the router interface is disabled with the `shutdown` command, the pasted configuration file must contain the `no shutdown` command in order to active the interface.

### Description

add a description to any interface by using the `description` command

```
// configuration terminal mode 진입
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
// interface sub-configuration mode 진입
R1(config)#interface F0/0
// Description 작성
R1(config-if)#description FastEthernet Description example

// Privileged EXEC 모드로 진입
// config-if 에서 end(ctrl-z) 로 한번에 out 가능
// do show interface 를 이용해서 Privileged exec 모드로 진입 안해도 실행 가능함
R1(config-if)#exit
R1(config)#exit

// 방금 작성한 description 확인
R1#show interfaces    
FastEthernet0/0 is up, line protocol is up 
  Hardware is DEC21140, address is ca01.4e72.0000 (bia ca01.4e72.0000)
  Description: FastEthernet Description example
  Internet address is 192.168.1.1/24
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output 00:00:03, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog
     0 input packets with dribble condition detected
     545 packets output, 61809 bytes, 0 underruns

// do 사용
R1(config-if)#do show interfaces
FastEthernet0/0 is up, line protocol is up 
  Hardware is DEC21140, address is ca01.4e72.0000 (bia ca01.4e72.0000)
  Description: FastEthernet Description example
  Internet address is 192.168.1.1/24
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output 00:00:07, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog
     0 input packets with dribble condition detected
     592 packets output, 66676 bytes, 0 underruns
```

### `Speed` and `Duplexing` for Ethernet Interfaces

To set the speed and duplexing speeds of Ethernet-based interfaces, use the following configuration:
```
IOS(config-if)# speed 10|100|1000|auto
IOS(config-if)# duplex full|half|auto
```

> For 10/100/1000 Ethernet prots, it is no longer recommanded that you hard-code the spped and duplexing with the `speed` and `duplex` commands;
> instead, let the interface autosense these settings from the directly connected device.

### Serial Interfaces on Routers

Things are a little different when configuring serial interfaces, because you need to configure not only an IP address, but you must also specify a layer 2 protocol to use. First let's assign an IP address and description to the serial interface with the following commands:
```
R1(config)#interface Serial2/0
R1(config-if)#ip address 13.0.0.2 255.0.0.0
R1(config-if)#description LINK-TO-ISP
R1(config-if)#do show interface
...
Serial2/0 is administratively down, line protocol is down 
  Hardware is M4T
  Description: LINK-TO-ISP
  Internet address is 13.0.0.2/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops) 
     Conversations  0/0/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 packets output, 0 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     1 carrier transitions     DCD=down  DSR=down  DTR=up  RTS=up  CTS=down
...
```

After the IP address is assigned to the serial interface, you can choose the layer 2 protocol you want to use to carry traffic across the serial link. On the LAN, the Layer 2 protocol is Ethernet, but that is not used on our serial lines. We need to specify what type of layer 2 frame we want to put the IP packet inside before sending data out the serial port.

Two main serial link protocols are used on Cisco routers:
* HDLC
	* Cisco proprietary protocol
	* used to send data across a serial link
	* that it requires no configuration and is the default encapsulation protocol if you do not specify one
* PPP
	* industry standard protocol
	* if you have a mix of Cisco devices and non-Cisco devices on the network, need this

```
R1(config-if)#encapsulation ?
  atm-dxi         ATM-DXI encapsulation
  bstun           Block Serial tunneling (BSTUN)
  frame-relay     Frame Relay networks
  hdlc            Serial HDLC synchronous
  lapb            LAPB (X.25 Level 2)
  ppp             Point-to-Point protocol
  sdlc            SDLC
  sdlc-primary    SDLC (primary)
  sdlc-secondary  SDLC (secondary)
  smds            Switched Megabit Data Service (SMDS)
  stun            Serial tunneling (STUN)
  x25             X.25

R1(config-if)#encapsulation hdlc
R1(config-if)#encapsulation ppp 
```

One of the benefits of PPP is that you can configure authentication which means that in order to send data over the serial link, other routers must know the password on the serial link. To configure authentication with PPP:
* Set the hostname on each router.
* Create a username and password on each of the routers that matches the name of the other router.
* Enable authentication with the authentication protocol of PAP or CHAP.
	* CHAP is preferred because PAP sends the username and password in clear text

```
/******* ROUTER1 ******/

R1(config)#username R2 password mypass    
R1(config)#interface S2/0
R1(config-if)#encapsulation ppp
R1(config-if)#ppp authentication chap

/********** ROUTER2 **********/

// ip addr
ip address 13.0.0.3 255.0.0.0

R2(config)#username R1 password mypass    
R2(config)#interface S2/0
R2(config-if)#encap
R2(config-if)#encapsulation ppp
R2(config-if)#ppp authentication chap
```

that we have configured the IP address and encapsulation protocol on the serial interface, all we need to do is make sure that the interface is receiving the clocking speed, or timing, of the link.

Setting the clocking speed is the responsiblity of the data communications equipment (DCE). When connecting the router to the ISP, the ISP is the DCE end of the link, and as such the ISP sets the clocking speed of the link. In the ISP example, your router is the data terminal equipment (DTE), so you are not allowed to set the clock speed of link

On the router that has the DCE end of the cable, you will need to set the clock rate with:
```
IOS(config-if)#clock  rate 64000
```

If you try to execute the `clock rate` command when you are configuring the DTE device, you will get a message that the command is performed on DCE devices only.

The last command you configure on the serial interface is to enable the interface by using the no shutdown command

```
// 연결 확인
R1(config-if)#do show controllers S2/0       
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BD3504, ds = 0x66BD464C, ssb=0x66BD4A10
Clock mux=0x0, ucmd_ctrl=0x1C, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: up
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

base0 registers=0x3D000000, base1 registers=0x3D002000
mxt_ds=0x681561AC, rx ring entries=47, tx ring entries=64
rxring=0xE1F32A0, rxr shadow=0x66BDB4B4, rx_head=1
txring=0xE1F3460, txr shadow=0x66BDB728, tx_head=60, tx_tail=60, tx_count=0
throttled=0, enabled=0
halted=0, last halt reason=0
Microcode fatal errors=0
rx_no_eop_err=0, rx_no_stp_err=0, rx_no_eop_stp_err=0
rx_no_buf=0, rx_soft_overrun_err=0, dump_err= 0, bogus=0, mxt_flags=0xC
tx_underrun_err=0, tx_soft_underrun_err=0, tx_limited=1(2)
tx_fullring=0, tx_started=188, mxt_flush_count=0
rx_int_count=162, tx_int_count=148
 Half-duplex hdx=0x66BDB1C0, summary:-
          
invalid_state=0, jigged_sig=0, invalid_timeout=0, tx_drop=0
tx_int_err=0, rx_drop=0, timer_error=0, rts_timeout=0
invalid_rx=0, tx_lost_cts=0, cts_timeout=0, late_rx=0

// Router 2
R2(config-if)#do show controllers S 2/0
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BD3504, ds = 0x66BD464C, ssb=0x66BD4A10
Clock mux=0x0, ucmd_ctrl=0x1C, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: up
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

base0 registers=0x3D000000, base1 registers=0x3D002000
mxt_ds=0x6658FE48, rx ring entries=47, tx ring entries=64
rxring=0xE1F32A0, rxr shadow=0x66BDB4B4, rx_head=6
txring=0xE1F3460, txr shadow=0x66BDB728, tx_head=6, tx_tail=6, tx_count=0
throttled=0, enabled=0
halted=0, last halt reason=0
Microcode fatal errors=0
rx_no_eop_err=0, rx_no_stp_err=0, rx_no_eop_stp_err=0
rx_no_buf=0, rx_soft_overrun_err=0, dump_err= 0, bogus=0, mxt_flags=0xC
tx_underrun_err=0, tx_soft_underrun_err=0, tx_limited=1(2)
tx_fullring=0, tx_started=199, mxt_flush_count=0
rx_int_count=149, tx_int_count=174
 Half-duplex hdx=0x66BDB1C0, summary:-
          
invalid_state=0, jigged_sig=0, invalid_timeout=0, tx_drop=0
tx_int_err=0, rx_drop=0, timer_error=0, rts_timeout=0
invalid_rx=0, tx_lost_cts=0, cts_timeout=0, late_rx=0
```

```
// ROUTER 1

R1(config-if)#do show interfaces S2/0
// 정상 연결 (up up)
Serial2/0 is up, line protocol is up 
  Hardware is M4T
  Description: LINK-TO-ISP
  Internet address is 13.0.0.2/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
 // PPP Encapsulation 작동
 // LCP (Link Control Protocol) 설정됨
  Encapsulation PPP, LCP Open
  // IPCP (IP Control Protocol) 협상 완료 -> IP 할당 및 통신 준비됨
  Open: IPCP, CDPCP, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:08, output 00:00:07, output hang never
  Last clearing of "show interface" counters 00:23:34
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops) 
     Conversations  0/1/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     220 packets input, 8586 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     219 packets output, 8174 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     1 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up

// ROUTER 2

R2(config-if)#do show interfaces S2/0
Serial2/0 is up, line protocol is up 
  Hardware is M4T
  Internet address is 13.0.0.3/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation PPP, LCP Open
  Open: IPCP, CDPCP, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:34, output 00:00:03, output hang never
  Last clearing of "show interface" counters 00:16:11
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops) 
     Conversations  0/1/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     220 packets input, 8196 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     224 packets output, 8650 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     1 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up

```

```
/**** PING TEST ****/

// ROUTER 1 to ROUTER 2 (13.0.0.3)
R1(config-if)#do ping 13.0.0.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/10/16 ms

// ROUTER 2 to ROUTER 1 (13.0.0.2)
R2(config-if)#do ping 13.0.0.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 8/11/16 ms
```

---

### Exercise 7-1: Basic Router Configuration

![[스크린샷 2025-05-02 04.01.23.png]]
![[스크린샷 2025-05-02 04.01.50.png]]

1. 라우터 hostname 변경

```
(user EXEC 모드에서 enable 로 진입 한 상황)

R1#hostname VAN-R1

R2#hostname LA-R1
```

2. 라우터 Ethernet IP할당

```
VAN-R1#configure t
VAN-R1(config)#interface F0/0
VAN-R1(config-if)#ip addr 12.0.0.1 255.0.0.0
VAN-R1(config-if)#no shutdown

LA-R1#configure t
LA-R1(config)#interface F0/0
LA-R1(config-if)#ip address 14.0.0.1 255.0.0.0
LA-R1(config-if)#no shutdown
```

**clock rate 설정**
한 쪽이 DCE인 경우 (`show controllers S2/0`)으로 확인 가능, `clock rate 64000` 으로 clock rate 설정 가능함
```
VAN-R1(config-if)#do show controllers S2/0
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BD3504, ds = 0x66BD464C, ssb=0x66BD4A10
Clock mux=0x0, ucmd_ctrl=0x1C, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: up
// DCE임
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

// clock rate 변경
VAN-R1(config-if)#clock rate 64000
VAN-R1(config-if)#do show controllers S2/0
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BD3504, ds = 0x66BD464C, ssb=0x66BD4A10
Clock mux=0x0, ucmd_ctrl=0x1C, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: up
// 변경된 값 확인 가능
cable type : V.11 (X.21) DCE cable, received clockrate 64000

```

3. 라우터간 serial 연결 (ppp, chap 이용)
```
VAN-R1#configure t
VAN-R1(config)#username LA-R1 password mypassword
VAN-R1(config)#interface S2/0
VAN-R1(config-if)#ip address 13.0.0.1 255.0.0.0
VAN-R1(config-if)#encap ppp
VAN-R1(config-if)#ppp authentication chap
VAN-R1(config-if)#no shutdown

LA-R1#configure t
LA-R1(config)#username VAN-R1 password mypassword
LA-R1(config)#interface S2/0
LA-R1(config-if)#ip address 13.0.0.2 255.0.0.0
LA-R1(config-if)#encap ppp
LA-R1(config-if)#ppp authentication chap
LA-R1(config-if)#no shutdown
```


4. interface 상태 확인
```
VAN-R1#show ip interface brief

또는

VAN-R1(config-if)#do show ip interface brief

LA-R1#show ip interface brief

//// 출력
VAN-R1(config-if)#do show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            12.0.0.1        YES manual up                    up      
FastEthernet1/0            unassigned      YES unset  administratively down down    
Serial2/0                  13.0.0.1        YES manual up                    up      
Serial2/1                  unassigned      YES unset  administratively down down    
Serial2/2                  unassigned      YES unset  administratively down down    
Serial2/3                  unassigned      YES unset  administratively down down

VAN-R1(config-if)#do show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            12.0.0.1        YES manual up                    up      
FastEthernet1/0            unassigned      YES unset  administratively down down    
Serial2/0                  13.0.0.1        YES manual up                    up      
Serial2/1                  unassigned      YES unset  administratively down down    
Serial2/2                  unassigned      YES unset  administratively down down    
Serial2/3                  unassigned      YES unset  administratively down down
```

5. ping
```
LA-R1(config-if)#do ping 13.0.0.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 13.0.0.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/8/12 ms
```

---

## Basic IOS Security Configuration

The Computer Security Institute (CSI) is an organization that provides education and training on network security fundamentals. It periodically performs market research studies on security issues with companies. In one study, more than 70 percent of all the companies polled reported experiencing some kind of security breach. Knowing this information, as a network administrator, one of your roles will be to en sure that access to your networking devices is strictly controlled.

### Physical and Environmental Threats

* Hardware
	* Restricting physical access to the router via physical measures, such as locked doors, key cards, video cameras, ...
* Electrical
	* Ensuring that equipment is protected from tempratures that are too cold or too hot, or from too much humidity
* Maintenance
	* Ensuring that you follow electrostatic discharge procedures when handling sensitive electronic parts, have spares on hand for critical parts, and properly label equipment and cables

### Passwords

The most common way of restricting physical access to IOS device is use some type of user authentication.
* configure passwords to restrict access to the lines on IOS devices (user EXEC mode)

### User EXEC Password Protection

Controlling access to user EXEC mode on an IOS device is accomplished on a line-by-line basis: console, auxiliary, TTYs, and VTYs.

not all devices support auxiliary ports, only routers support TTYs, and the number of VTYs on IOS device supports is product-dependent, ranging from five VTYs (0-4) to almost a thousand

To secure the console port, you must first go into the console's line subconfiguration mode with the `line console 0` command to configure the line password:
```
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#line console 0
R1(config-line)#password password
R1(config-line)#login
R1(config-line)#
```

passwords on IOS devices are case-sensitive that the `password` command, when executed under line console 0, sets the user EXEC password for someone typing to access the IOS device from the console port only

The auxiliary port is typically used as a remote access port with a modem attached to it, which enables you to dial into the router if something has happended to the Internet connection and you cannot remote in via telnet  or SSH.
**Setting up password authentication on the auxiliary port:**
```
R1(config)#line aux 0
R1(config-line)#password password
R1(config-line)#login
```

Again, the `login` command is required; if you forget it, you will have set a password on the port and will not have asked the Cisco device to prompt for that password when someone connects to the port.

To setup a telnet password for your VTYs, use this:
```
R1(config)#line vty 0 15
R1(config-line)#password password
R1(config-line)#login
```

접속되어 있는 유저 확인 (privileged mode)
```
R1#show users
    Line       User       Host(s)              Idle       Location
*  0 con 0                idle                 00:00:00   

  Interface    User               Mode         Idle     Peer Address

R1#show line 
   Tty Typ     Tx/Rx    A Modem  Roty AccO AccI   Uses   Noise  Overruns   Int
*     0 CTY              -    -      -    -    -      0       0     0/0       -
      1 AUX   9600/9600  -    -      -    -    -      0       0     0/0       -
      2 VTY              -    -      -    -    -      0       0     0/0       -
      3 VTY              -    -      -    -    -      0       0     0/0       -
      4 VTY              -    -      -    -    -      0       0     0/0       -
      5 VTY              -    -      -    -    -      0       0     0/0       -
      6 VTY              -    -      -    -    -      0       0     0/0       -
      7 VTY              -    -      -    -    -      0       0     0/0       -
      8 VTY              -    -      -    -    -      0       0     0/0       -
      9 VTY              -    -      -    -    -      0       0     0/0       -
     10 VTY              -    -      -    -    -      0       0     0/0       -
     11 VTY              -    -      -    -    -      0       0     0/0       -
     12 VTY              -    -      -    -    -      0       0     0/0       -
     13 VTY              -    -      -    -    -      0       0     0/0       -
     14 VTY              -    -      -    -    -      0       0     0/0       -
     15 VTY              -    -      -    -    -      0       0     0/0       -
     16 VTY              -    -      -    -    -      0       0     0/0       -
     17 VTY              -    -      -    -    -      0       0     0/0       -
```

`vty`: virtual terminal (telnet or ssh)
`0-15`: each connection is internally tracked by a number, Depending on the router model and IOS software version, this number may range from 5 on up to almost 1000.

IOS enables you to specify multiple VTYs ports with the `line` command, simplifying your  configuration, as in the preceding configuration: `line vty 0 15` You need to specify the beginning and ending VTY numbers on the same line.

Once you are in line subconfiguration mode, use the `password` command to set your password. You also need to enter the `login` command to force authentication on those ports, essentially telling the device to prompt for the password if someone tries to connect via telnet.

### Creating Usernames and Passwords

Other ways of validating access are available, such as a local username database or an external authentication server. A local username database on the router enables you to specify both a username and a password to restrict access to the lines on an IOS device. Using usernames and password is recommanded over using only passwords on lines

the advantage of this approach is that each user can have his or her own password instead of sharing a password, providing for more accountability.

```
IOS(config)#username name {secret | password} password

R1#config t
R1(config)#username my_user password my_password
R1(config)#line vty 0 15
R1(config-line)#login local
```

The main difference between the `secret` and `password` parameters is that the `secret` parameter tells IOS to encrypt the password with MD5 hash, and the `password` parameter doesn't (the password is stored in clear text).

*login local*
can be used on any of the lines on Cisco device to tell the device to perform authentication using the local username and password database.

### Privileged EXEC Password Protection

`enable password Privilege_EXEC_password`
`enable secret Privilege_EXEC_password`

Both of these commands configure the privileged EXEC password.

> without user EXEC and privileged EXEC authentication (passwords), you will not be able to access IOS device remotely via telnet or SSH, by default.

### Password Encryption

Passwords that are not encrypted can be encrypted by using the `service password-encryption` Global Configuration mode command

However, the `enable secret` command's encryption is much stronger than using the `service apssword-encryption` command to do the encryption.

---

### Exercise 7-2: Configuring Passwords

* configure a console password
* configure an auxiliary password
* configure VTY port passwords.

![[스크린샷 2025-05-04 23.42.24.png]]

![[스크린샷 2025-05-04 23.52.08.png]]

**R1 (VAN-R1)**
1. aux password 설정

```
VAN-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
VAN-R1(config)#line aux 0
VAN-R1(config-line)#password auxpass
VAN-R1(config-line)#login
```

2. telnet password 설정

```
VAN-R1(config)#line vty 0 4
VAN-R1(config-line)#password telnetpass
VAN-R1(config-line)#login
```

3. enable password (privileged mode 진입할때)

```
VAN-R1(config)#enable password enablepass 
VAN-R1(config)#enable secret enablesecret
VAN-R1(config)#exit

VAN-R1#
*May  4 14:55:09.483: %SYS-5-CONFIG_I: Configured from console by console
// 설정 저장
VAN-R1#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
VAN-R1#
```

---

### Configuring Banners

common types of banners:
* MOTD banner
	* display a temporary message that may change from day to day
* Login Banner
	* before administrator logs in, but after the MOTD banner appears, and is used to display a more permanent message to the administrator.
* Exec banner
	* used to display message after the administrator authenticates to the system and after he enters user EXEC mode.

```
VAN-R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
VAN-R1(config)#banner
VAN-R1(config)#banner ?
  LINE            c banner-text c, where 'c' is a delimiting character
  exec            Set EXEC process creation banner
  incoming        Set incoming terminal line banner
  login           Set login banner
  motd            Set Message of the Day banner
  prompt-timeout  Set Message for login authentication timeout
  slip-ppp        Set Message for SLIP/PPP
```

### MOTD Banner

```
IOS(config)# banner motd $
motd messages
more message.
$

bannder motd 'my_message'
```

### Login Banner

```
IOS(config)# banner login $
my login banner
something
$
```

### Exec Banner

```
IOS(config)# banner exec $
something
$
```

## IOS Operation and Verification

### Show and Debug Command Overview

* Show
	* Takes a snapshot of a particular process and displays information about it
	* the information displayed is static and will not refresh itself unless you re-execute the command
* debug
	* Displays how a particular process is currently operating
	* showing information as it basically happens, in real time

### Common Show Commands

* `show ip interface brief`
	* Lists of all of the interfaces on the device and offers a quick look at their statuses

```
VAN-R1(config)#do show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            12.0.0.1        YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  administratively down down    
Serial2/0                  13.0.0.1        YES NVRAM  up                    down    
Serial2/1                  unassigned      YES NVRAM  administratively down down    
Serial2/2                  unassigned      YES NVRAM  administratively down down    
Serial2/3                  unassigned      YES NVRAM  administratively down down  
```

* `show interfaces`
	* Lists all the interfaces and detailed specifications on the interfaces

```
VAN-R1#sho interfaces
FastEthernet0/0 is up, line protocol is up 
  Hardware is DEC21140, address is ca01.0237.0000 (bia ca01.0237.0000)
  Internet address is 12.0.0.1/8
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output 00:00:05, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     ....
```

* `show interfaces S2/0`
	* Lists the details of a specific interface

```
VAN-R1#show interfaces S2/0
Serial2/0 is up, line protocol is down 
  Hardware is M4T
  Internet address is 13.0.0.1/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation PPP, LCP Listen, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:01, output 00:00:01, output hang never
  Last clearing of "show interface" counters 00:23:24
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops) 
     Conversations  0/1/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 1 packets/sec
  5 minute output rate 0 bits/sec, 1 packets/sec
     1674 packets input, 31311 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     1853 packets output, 34814 bytes, 0 underruns
     0 output errors, 0 collisions, 399 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     399 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
```

* `show controllers S2/0`
	* Lists information such as the DCE and DTE details on serial interfaces

```
VAN-R1#show controllers S2/0
M4T: show controller:
PAS unit 0, subunit 0, f/w version 3-101, rev ID 0x2800001, version 1
idb = 0x66BD3504, ds = 0x66BD464C, ssb=0x66BD4A10
Clock mux=0x0, ucmd_ctrl=0x1C, port_status=0x7B
Serial config=0x8, line config=0x200
maxdgram=1608, bufpool=48Kb, 96 particles
     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
line state: up
cable type : V.11 (X.21) DCE cable, received clockrate 2015232

base0 registers=0x3D000000, base1 registers=0x3D002000
mxt_ds=0x67374354, rx ring entries=47, tx ring entries=64
rxring=0xE1F32A0, rxr shadow=0x66BDB4B4, rx_head=0
txring=0xE1F3460, txr shadow=0x66BDB728, tx_head=0, tx_tail=0, tx_count=0
throttled=0, enabled=0
halted=0, last halt reason=0
Microcode fatal errors=0
rx_no_eop_err=0, rx_no_stp_err=0, rx_no_eop_stp_err=0
rx_no_buf=0, rx_soft_overrun_err=0, dump_err= 0, bogus=0, mxt_flags=0xC
tx_underrun_err=0, tx_soft_underrun_err=0, tx_limited=1(2)
tx_fullring=0, tx_started=1948, mxt_flush_count=0
rx_int_count=1162, tx_int_count=1747
 Half-duplex hdx=0x66BDB1C0, summary:-
          
invalid_state=0, jigged_sig=0, invalid_timeout=0, tx_drop=0
tx_int_err=0, rx_drop=0, timer_error=0, rts_timeout=0
invalid_rx=0, tx_lost_cts=0, cts_timeout=0, late_rx=0
```

### Common Debug Commands

typically more useful in troubleshooting difficult problems. The main disadvantage of `debug` commands is that they are process-intensive on IOS devices and should be used with care

### Running and Startup Configuration

* running-config
	* This file contains the actual configuration running in the RAM of an IOS device (the settings that the device is currently using)

* startup-config
	* This file contains the saved configuration settings in nonvolatile RAM(NVRMA) of a Cisco device and are applied at bootup.

Configuration files can reside in many locations, including RAM, NVRAM, or a Trivial File Transfer Protocol (TFTP) or FTP server, among other places. Whenever you make changes to an IOS's configuration by typing in commands from configuration mode, these changes are made in RAM (running-config). These changes can then be saved to NVRAM (startup-config), which is a static form of memory;

When the Cisco device is turned off, the contents of NVRAM are not erased and are available upon a power-up. IOS devices do not automatically save the configuration file from RAM to NVRAM; this must be done manually.

Configuration changes can also be saved to an external server using TFTP, FTP, and Secure Copy Protocol (SCP)

### Viewing Configurations

To examine the active or running configuration on an IOS device, use the `show running-config` command.
```
R1#show running-config
Building configuration...

Current configuration : 1251 bytes
!
upgrade fpd auto
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R1
!
boot-start-marker
boot-end-marker
!
logging message-counter syslog
!
no aaa new-model
ip source-route
no ip icmp rate-limit unreachable
ip cef
!
!
!
!         
no ip domain lookup
no ipv6 cef
!         
multilink bundle-name authenticated
!         
!         
.....
```

### Saving Your Changes

The startup configuration file is stored in NVRAM for both switches and routers. When an IOS device boots up, IOS loads the configuration from NVRAM and places it in RAM.

After booting the device, you can make configuration changes, which are stored in RAM (running-config). To have that configuration retained during reboots of the device, you will need to save the new changes to NVRAM (startup-config).

To save the active configuration to NVRAM, you must execute the `copy running-config startup-config` command from privileged EXEC mode.
```
R1#copy running-config startup-config
Destination filename [startup-config]? 
Building configuration...
[OK]
R1#
```

On the IOS device, you can view the saved configuration in NVRAM with the `show startup-config` command

> Shortcut to save IOS's configuration to NVRAM is the `write memory` command: you can abbreviate this to just `write`

```
R1#write memory
Building configuration...
[OK]
R1#write
Building configuration...
[OK]
R1#
```

### Reverting Your configuration

`copy startup-config running-config`

### Device Version Information

`show version`

```
R1#show version
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Fri 04-Mar-11 06:49 by prod_rel_team

ROM: ROMMON Emulation Microcode
BOOTLDR: 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)

R1 uptime is 15 minutes
System returned to ROM by unknown reload cause - suspect boot_data[BOOT_COUNT] 0x0, BOOT_COUNT 0, BOOTDATA 19
System image file is "tftp://255.255.255.255/unknown"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.
          
A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
          
If you require further assistance please contact us by sending email to
export@cisco.com.
          
Cisco 7206VXR (NPE400) processor (revision A) with 491520K/32768K bytes of memory.
Processor board ID 4279256517
R7000 CPU at 150MHz, Implementation 39, Rev 2.1, 256KB L2 Cache
6 slot VXR midplane, Version 2.1
          
Last reset from power-on
          
PCI bus mb0_mb1 (Slots 0, 1, 3 and 5) has a capacity of 600 bandwidth points.
Current configuration on bus mb0_mb1 has a total of 400 bandwidth points. 
This configuration is within the PCI bus capacity and is supported. 

PCI bus mb2 (Slots 2, 4, 6) has a capacity of 600 bandwidth points.
Current configuration on bus mb2 has a total of 0 bandwidth points 
This configuration is within the PCI bus capacity and is supported. 
          
Please refer to the following document "Cisco 7200 Series Port Adaptor
Hardware Configuration Guidelines" on Cisco.com <http://www.cisco.com>
for c7200 bandwidth points oversubscription and usage guidelines.
          
          
2 FastEthernet interfaces
4 Serial interfaces
509K bytes of NVRAM.
          
8192K bytes of Flash internal SIMM (Sector size 256K).
Configuration register is 0x2102
```

### Interface Information

Layer 1 problems would be related to identifying physical connection issues. Layer 2 issues would be related to the layer 2 protocol configuration such as a serial link having HDLC or PPP configured properly on the serial interfaces.

### Viewing Interface Information

`show interfaces`: this command enables you to see the status and configuration of your interfaces, as well as some statistical information

```
// 전체 인터페이스
R1#show interfaces
FastEthernet0/0 is administratively down, line protocol is down 
  Hardware is DEC21140, address is ca01.4e72.0000 (bia ca01.4e72.0000)
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output 00:26:20, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog
     0 input packets with dribble condition detected
     0 packets output, 0 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
     0 unknown protocol drops
...

// 특정 인터페이스 (Serial2/0)
R1#show interfaces S2/0
Serial2/0 is administratively down, line protocol is down 
  Hardware is M4T
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation HDLC, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input never, output never, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops) 
     Conversations  0/0/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     0 packets output, 0 bytes, 0 underruns
     0 output errors, 0 collisions, 0 interface resets
     0 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     1 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
```

In the output, can see information about interface such as: MAC address, IP address, maximum transmission unit (MTU), encapsulation protocol (ARPA means Ethernet), and the duplex setting and speed on the interface

### Troubleshooting Interface Problems

**Possible values for the physical layer status:**
* UP
	* The device is sensing a physical layer signal on the interface
* Down
	* The device is not sensing a physical layer signal on the interface
	* if the attached device is turned off
	* no cable attached
	* wrong type of cable is being used
* Administratively down
	* Use the `shutdown` command to disable the interface

**Possible values for the data link layer status:**
* Up
	* The data link layer is operational.
* Down
	* The data link layer is not operational.
	* missed keepalives on a serial link
	* no clocking
	* incorrect encapsulation type
	* disabled physical layer

```
R1#show interfaces F0/0
FastEthernet0/0 is up, line protocol is up 
  // interface type, MAC 주소
  Hardware is DEC21140, address is ca01.4e72.0000 (bia ca01.4e72.0000)
  // IP ADDR
  Internet address is 12.0.0.1/8
  // MTU Ethernet Frame size, BW = bandwidth
  MTU 1500 bytes, BW 100000 Kbit/sec, DLY 100 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation ARPA, loopback not set
  Keepalive set (10 sec)
  Half-duplex, 100Mb/s, 100BaseTX/FX
  ARP type: ARPA, ARP Timeout 04:00:00
  Last input never, output 00:00:04, output hang never
  Last clearing of "show interface" counters never
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: fifo
  Output queue: 0/40 (size/max)
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     0 packets input, 0 bytes
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored
     0 watchdog
     0 input packets with dribble condition detected
     126 packets output, 13349 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     0 unknown protocol drops
     0 babbles, 0 late collision, 0 deferred
     0 lost carrier, 0 no carrier
     0 output buffer failures, 0 output buffers swapped out
```

![[스크린샷 2025-05-06 02.38.39.png]]

### WAN Serial Loopback Test

When troubleshooting connectivity over the WAN, you may need to perform a loopback test on the serial port of the Cisco device. A loopback test is a way to verify where the problem occurs with the WAN link: Is it on your side or is it with the serivce provider?

It is great idea to start testing connectivity to the channel service unit/data service unit (CSU/DSU) by performing a CSU/DSU loopback test to verify your T1 link or your 56K link. If that is successful, you can then verify connectivity from the CSU/DSU to the service provider by performing a teleco-assisted loopback test with the service provider.

Two types of loopback testing can be performed on the CSU/DSU:
* **Software**
	* Use Cisco IOS commands to test functionality from the router to the CSU/DSU
* **Hardware**
	* Connect a loopback plug/cable to the CSU/DSU to perform the loopback test.

*Troubleshoot the WAN interface and perform a software loopback test*
First, you can see the hardware that exists in your device by using the `show inventory` command:

```
R1#show inventory
NAME: "Chassis", DESCR: "Cisco 7206VXR, 6-slot chassis"
PID: CISCO7206VXR      , VID:    , SN: 4279256517 

NAME: "NPE400 0", DESCR: "Cisco 7200VXR Network Processing Engine NPE-400"
PID: NPE-400           , VID:    , SN: 11111111   

NAME: "module 0", DESCR: "I/O FastEthernet (TX-ISL)"
PID: C7200-IO-FE-MII/RJ45=, VID:    , SN: 4294967295 

NAME: "module 1", DESCR: "FastEthernet"
PID: PA-FE-TX          , VID:    , SN: 4294967295 

NAME: "module 2", DESCR: "Serial"
PID: PA-4T+=           , VID:    , SN: 4294967295 

NAME: "Power Supply 1", DESCR: "Cisco 7200 AC Power Supply"
PID: PWR-7200-AC       , VID:    , SN:            

NAME: "Power Supply 2", DESCR: "Cisco 7200 AC Power Supply"
PID: PWR-7200-AC       , VID:    , SN:            


R1#
```

To see if there is a serial port created by the card, use the `show ip interface brief` command:
```
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            12.0.0.1        YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  administratively down down    
Serial2/0                  13.0.0.1        YES NVRAM  up                    up      
Serial2/1                  unassigned      YES NVRAM  administratively down down    
Serial2/2                  unassigned      YES NVRAM  administratively down down    
Serial2/3                  unassigned      YES NVRAM  administratively down down 
```

Notice the serial interface of S2/0. If you want to view details of that interface, use `show interface S2/0`:
```
R1#show interface S2/0
Serial2/0 is up, line protocol is up 
  Hardware is M4T
  Internet address is 13.0.0.1/8
  MTU 1500 bytes, BW 1544 Kbit/sec, DLY 20000 usec, 
     reliability 255/255, txload 1/255, rxload 1/255
  Encapsulation PPP, LCP Open
  // loopback 셋 안되어있음
  Open: IPCP, CDPCP, crc 16, loopback not set
  Keepalive set (10 sec)
  Restart-Delay is 0 secs
  Last input 00:00:02, output 00:00:01, output hang never
  Last clearing of "show interface" counters 02:28:08
  Input queue: 0/75/0/0 (size/max/drops/flushes); Total output drops: 0
  Queueing strategy: weighted fair
  Output queue: 0/1000/64/0 (size/max total/threshold/drops) 
     Conversations  0/1/256 (active/max active/max total)
     Reserved Conversations 0/0 (allocated/max allocated)
     Available Bandwidth 1158 kilobits/sec
  5 minute input rate 0 bits/sec, 0 packets/sec
  5 minute output rate 0 bits/sec, 0 packets/sec
     1897 packets input, 77742 bytes, 0 no buffer
     Received 0 broadcasts, 0 runts, 0 giants, 0 throttles
     0 input errors, 0 CRC, 0 frame, 0 overrun, 0 ignored, 0 abort
     1896 packets output, 77723 bytes, 0 underruns
     0 output errors, 0 collisions, 1 interface resets
     1 unknown protocol drops
     0 output buffer failures, 0 output buffers swapped out
     1 carrier transitions     DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
```

To perform the loopback test on this interface, you need to enable loopback.
```
// enable loopback

```