## Router Configuration Files

configuration file contains the commands used to configure on IOS device. Configuration files are typically located in one of three places: RAM, NVRAM, and/or an external server(TFPT, FTP, HTTP and SCP)

the commands related to configuration files, even `show` commands, require you to be working in privileged EXEC mode. Also, the running configuration of an IOS device is not automatically saved to NVRAM you must manually do this by issuing the `copy ruunig-config startup-config` or `write` command.

### Saving Configuration Files

`copy running-config startup-config`, when you execute this command, whatever filename (the default is `startup-config`) you are copying to in NVRAM is completely overwritten. If you want to keep an old copy and a newer one in NVRAM, you'll need to specify a name other than `startup-config`

Note that the `copy` command has two parameters: the first parameter refers to where the source information is (where you want to copy from) and the second parameter refers to where the destination is

```
copy running-config flash:file_name
copy startup-config flash:file_name
```

This enables you to have multiple configuration files stored locally on your IOS device; by default, when booting up, your IOS device will use the startup-config file in NVRAM to load its configuration

> It is not a common practice to copy configuration files to flash, and for exam purposes, this is not where you back up configuration files.

you can also back up your configuration to an external server. You must have the server software on a server or PC and IP configured correctly on your IOS device to access the server.

```
copy running-config URL_location
```

ex) to back up your configuration file to a TFTP server:
```
copy running-config tftp://192.168.1.10/mybackupfile.txt
```

The configuration is backed up to an ASCII text file. If you don't supply the full URL, just the protocol information, you'll be prompted for the additional information
```
R1#copy running-config tftp
Address or name of remote host []? 192.168.1.10
Destination filename [router-config]? mybackupfile.cfg
!!
781 bytes copied in 5.8 secs (156 bytes/sec)
IOS#
```

If the filename already exists on the server, the server overwrites the old file. After entering this information, you should see bang symbols (!) indicating the successful transfer of UDP segments to the TFTP server. If you see periods (.), this indicates an unsuccessful transfer.

### Restoring Configuration Files

```
IOS# copy URL_location running-config
IOS# copy URL_location startup-config
```

### Creating and Deleting Configuration Files

```
IOS# erase startup-config
IOS# erase nvram
```

You can also use the `write erase` command to delete your startup configuration.

To verify the erasure, use the `show startup-config` command. If the startup-config was erased, you will get the following message when you try to show the startup-config:
```
IOS# show startup-config
%% Non-volatile configuration memory is not present
```

### Configuration File Nomenclature

Starting with IOS 12.0 and later, Cisco introduced command and naming nomenclatures that follow Cisco IOS File System (IFS) guidelines (what you are used to when entering a URL in a web browser address text box). Therefore, instead of entering a command and having a router prompt you for additional information, such as the IP address of a TFTP server and the filename, you can now pull all of this information on a single command line. Commands that reference configuration files and IOS images contain prefixes in front of the file type,
![[Pasted image 20250506095855.png]]

```
IOS# copy system:running-config nvram:startup-config
IOS# copy running-config startup-config

IOS# more system:running-config
IOS# delete flash:file_name
```

---

### Exercise 8-1: manipulating Your Router's Configuration Files

* Make change to configuration
* save the change to NVRAM

1. change hostname
	* `config t`
	* `hostname NEW_HOSTNAME`

2. NVRAM 에 저장
	* `do write` 또는 `copy running-config startup-config`

---

## Changes in Your Network

When you decide to make changes to your network, including the addition or deletion of devices, you should always do some preparation work before you make changes.

Making changes can cause things to malfunction or not function at all, so you should always prepare beforehand.

> It is much easier to restore a backup copy than it is to re-create something from scratch.
> whenever you make changes, always test the change to ensure your Cisco device is performing as expected.

### Adding Devices

1. Decide which IP address you'll assign to the device for management purposes.
2. Configure the ports of the device, including the console and virtual type terminal (VTY) ports.
3. Set up your passwords for User and Privileged EXEC access.
4. Assign the appropriate IP addresses to the device's interface(s)
5. Create a basic configuration on the device so that it can perform its job.

### Changing Devices

Before you make any changes to your network, you should always back up your configuration files. Likewise, before you perform a software upgrade on your Cisco device, you should always back up the old IOS image.

before loading the new image on your IOS device, should check about dose the new image contain all of the features need? and dose this device have enough flash and RAM to store and load the IOS image?

## IOS Image Files

The default location of IOS images is in flash. On some IOS devices, flash is built into the motherboard, some use PCMCIA cards for storage, and some use a combination of both. At times, you will have to deal with the device's flash when you want to perform an upgrade, for instance.

To view your files in flash, use the `show flash` command
In addition to using the `show flash` command, you can also use the `dir` command to see how much flash memory is available on your IOS device.

### Naming Conventions for IOS Images

**`c1841-advipservicesk9-mz.124-6.T7.bin`**

* **c1841**
	* Refers to the name of the platform on which the image will run.
	* different router models have different processors, and an image compiled for one processor or router model will typically not run on a different model. therefore, it is very important that you load the appropriate image on your device.
* **advipservicesk9**
	* Refers to the features included in this IOS version
	* feature set
	* in this example, IOS is the advanced IP services and k9 refers to the inclusion of encryption support.
* **mz** or **z**
	* that the image is compressed and must be uncompressed before loading/running.
	* If you see l here, this indicates where the IOS image is run from.
	* The l indicates that it is relocatable image and that the image can be run from RAM.
* **124-6.T7**
	* Indicates the software version number of IOS.
	* In this instance, the version is 12.4(6)T7.
	* Image filenames with T indicate new features, and those without T indicate the mainline (only bug fixes are made to it)
* **.bin**
	* binary image

### Before Upgrading the IOS Image

Before you upgrade the IOS on your device, you should first back up the existing image to an external server. your flash may not be large enough to support two images (the old one and the new). If you load the new one and you experience problems with it, you'll probably want to load the old image back onto your device. Cisco doesn't keep every software version available on its web site. Older versions of IOS are hard to locate, so if you are upgrading from and old version of IOS, it is recommended backing it upt first

You can back up your Cisco IOS (and configuration files)to a TFTP server or to an FTP server. Although both are File Transfer Protocols, they do differ in their underlining use.

TFTP uses UDP port 69 and does not require authentication (a username and password) to connect to the TFTP server.
FTP uses TCP port 21 (command channel) and TCP port 20 (data channel) and does use authentication by having the person connecting supply a username and password that is configured on the server

### Creating the TFTP Server

@TODO: TFTP server in linux

### Verifying Server information

* Is the server reachable?
* Are you able to connect to the port?
* enough disk space on the server to hold the IOS image?
* Does the server support the file nomenclature that you want to use?

### Baking Up an IOS Image

```
R1#copy ?
  /erase          Erase destination file system.
  /error          Allow to copy error file.
  /noverify       Don't verify image signature before reload.
  /verify         Verify image signature before reload.
  archive:        Copy from archive: file system
  bootflash:      Copy from bootflash: file system
  cns:            Copy from cns: file system
  disk0:          Copy from disk0: file system
  disk1:          Copy from disk1: file system
  flash:          Copy from flash: file system
  ftp:            Copy from ftp: file system
  http:           Copy from http: file system
  https:          Copy from https: file system
  null:           Copy from null: file system
  nvram:          Copy from nvram: file system
  pram:           Copy from pram: file system
  rcp:            Copy from rcp: file system
  running-config  Copy from current system configuration
  scp:            Copy from scp: file system
  slot0:          Copy from slot0: file system
  slot1:          Copy from slot1: file system
  startup-config  Copy from startup configuration
  system:         Copy from system: file system
  tar:            Copy from tar: file system
  tftp:           Copy from tftp: file system
  tmpsys:         Copy from tmpsys: file system
```

## Remote Access to Your Cisco Device

In many instances, it may not be possible to be physically in front of your IOS device to manage it. You can optionally manage it remotely by accessing its CLI via telnet or SSH, or you can manage it with a GUI with a web browser.

To access your IOS device's CLI remotely, you must first set up its VTYs. If you're accessing a layer 2 IOS switch, you'll need to assign an IP address to a VLAN interface; if you're accessing a router, you'll need to assign an IP address to one of its interfaces and enable it. By default, only telnet is enabled on the router

### SSH vs Telnet Access

One of the most common tools used by network administrators to manage their devices remotely is the telnet application. Telnet enables you access to the CLI of a device. The problem with telnet, however, is that all information sent between you and the Cisco device is sent in clear text, including you username and/or password.

SSH(Secure Shell) uses RSA as an encryption algorithm to encrypt any data sent between you and your networking device. SSH is actually disabled by default on your IOS device.

| telnet                         | SSH                         |
| ------------------------------ | --------------------------- |
| no encryption (send plan text) | use encryption (RSA)        |
| enabled by default via IOS     | disabled by default via IOS |

### Telnet Configuration

```
R1>enable
R1#conf t
R1 (config)#line VTY 0 15
R1 (config-line)#password telnetpass
R1 (config-line)#login
```

### Using Telnet

If you're configured your Cisco devices correctly (with IP addressing and routing information and the appropriate commands on the VTYs), you should be able to telnet to them successfully.

```
IOS# name_of_the_destination | destniation_IP_address

or

IOS# telnet name_of_the_destination | destination_IP_address

or

IOS# connect name_of_the_destination | destination_IP_address
```

```
R2#telnet 192.168.13.1
Trying 192.168.13.1 ... Open


User Access Verification

Password: 
R1>exit

[Connection to 192.168.13.1 closed by foreign host]
R2#

R1#show users
    Line       User       Host(s)              Idle       Location
*  0 con 0                idle                 00:00:00   
   2 vty 0                idle                 00:00:59 192.168.13.2

  Interface    User               Mode         Idle     Peer Address
  Se2/0        R2                 Sync PPP     00:00:00 192.168.13.2 
```

### Suspending Telnet Sessions

If you are using an IOS device and telnet to a remote destination, you may want to go back to your IOS device. One way of doing this is to exit the remote device; however, you may just want to go back to your source Cisco device, make a quick adjustment, and then return to the remote device. Logging off and back on the remote device is a hassle in this instance.

return to your original router or switch, do what you need to do, and then jump right back into your remote device all without your having to log off and back on to the remote device. To suspend a telnet session, press `CTRL-SHIFT-6 x`

On your source IOS, if you want to see the open telnet sessions that are currently suspended, use the `show sessions` command:

to resume `resume connection_#`
and to disconnect session `disconnect connection_#`

### Verifying and Clearing Connections

you can view other users who are also logged in with this command `IOS# show users`

If you want to terminate someone's session, `IOS# clear line line_#`

---
### Exercise 8-4: Configuring Telnet on the Cisco Device

1. password configuration

```
R1>enable
R1#config t
R1 (config)#enable secret secretpass
```

2. configure password on the VTY lines (telnet ports):

```
R1(config)#line vty 0 15
R1(config-line)#password telnetpass
R1(config-line)#login
```

3. Console into router R1 an then enter `ping ~~~`

```
# check IP addr
R1#show ip interface brief 
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            172.21.1.105    YES DHCP   up                    up      
FastEthernet1/0            unassigned      YES manual administratively down down    
FastEthernet1/1            unassigned      YES unset  administratively down down    
Serial2/0                  192.168.13.1    YES manual up                    up      
Serial2/1                  unassigned      YES unset  administratively down down    
Serial2/2                  unassigned      YES unset  administratively down down    
Serial2/3                  unassigned      YES unset  administratively down down    
NVI0                       172.21.1.105    YES unset  up                    up   

# serial2/0 에 R2연결했음, R2에서 PING
R2#ping 192.168.13.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.13.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 12/28/68 ms
```

4. telnet으로 연결
```
R2#telnet 192.168.13.1
Trying 192.168.13.1 ... Open


User Access Verification

Password: 
R1>
```

5. `exit`으로 disconnect 가능
```
R1>exit

[Connection to 192.168.13.1 closed by foreign host]
R2#
```

---

### SSH Configuration

**need to configure**
* A local username and password
	* SSH requires both a username and password configured on the device
	* `username` command
* A hostname and a domain name
	* Hostname and domain name are required to label the RSA key pair on the IOS device
	* `hostname` and `ip domain-name` command
* The SSH version to use
	* You should configure the specific SSH version you want to use.
	* The default is version 1, but the recommended version to use is 2
	* `ip ssh version` command
* Restricting VTY access
	* you will ensure that remote access can be achieved only through SSH and not telnet, because telnet does not encrypt communication.
	* By default, telnet is allowed on the VTYs you should ensure that only SSH access is allowed
	* `login local` and `transport input` line subconfiguration commands.

```
R1#config t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#username joe secret mypassword
R1(config)#ip ssh version 2
Please create RSA keys (of atleast 768 bits size) to enable SSH v2.

R1(config)#crypto key generate rsa
% Please define a domain-name first.

R1(config)#ip domain-name joe.com
R1(config)#crypto key generate rsa
The name for the keys will be: R1.joe.com
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

R1(config)#
*May 13 06:45:38.335: %SSH-5-ENABLED: SSH 2.0 has been enabled
R1(config)#line vty 0 15

// specifies the use of the local database
R1(config-line)#login local

// restricts access to the VTYs to SSH use only
R1(config-line)#transport input ssh
R1(config-line)#
```

## Configuration Registers and Password Recovery

### Configuration Registers

The Configuration register setting is used by the bootstrap program to determine the location from which the IOS image and configuration file should be loaded.

The configuration register is a 16-bit field

![[Pasted image 20250513161017.png]]

that is stored in NVRAM and can be modified to control how your device boots. For example, if you forgot your password on your Cisco device, you can modify the configuration register not to load the startup configuraiton at bootup in order to bypass the password.

The 16 bits are divided into four, 4-bit blocks, with each 4-bit chunk known as a *nibble*(half a byte)

that the values of the 4 bits in a nibble start on the right side as 1, then 2, then 4, and finally 8. Those values repeat for each of the four nibbles that exist in the 16-bit register fields.

Turning on one of the bits in the configuration registers is a method to enable a feature during bootup. if bit number 6 is turned on, the contents of NVRAM are ignored and not applied during bootup.

| Bit Number | Explanation                                          |
| ---------- | ---------------------------------------------------- |
| 0-3        | Known as the boot fields discussed in next section   |
| 6          | Ignore the contents of NVRAM                         |
| 7          | Disable the display of boot messages                 |
| 8          | Break is disabled                                    |
| 10         | IP broadcast with all zeros                          |
| 13         | Loads the default ROM software if network boot fails |

If you wanted to boot the device and have it load the IOS and the startup configuration, you would set the configuration register value to 2102 (the default setting). But if you wanted to restart the Cisco device and have it load the IOS, but not the startup configuration, you would set the configuration register to 2142 (which enables bit 13, bit 8, bit 6 and bit 1).

0x2102: 0010 0001 0000 0010
0x2142: 0010 0001 0100 0010

1, 6, 8, 13 비트 enable

### Boot Fields

The first 4-bit nibble on the right side is known as the *boot field*, which controls how the Cisco device boots up. If the boot field equals a specific decimal value, then the bootup of the device happens a specific way.

* **0**
	* If the boot field equals 0 (no bits enabled), the Cisco device will boot to ROMMON mode.
	* This boot mode is typically used when troubleshooting startup issues or needing to download or install a new IOS image file.
	* When booted to ROMMON mode, the `rommon>` prompt is displayed.
	* To boot to ROMMON mode, the configuration register value would be 2100.
	* `0010 0001 0000 0000`
* **1**
	* If the boot field has a decimal value of 1, the device boots to a Mini IOS that is located on ROM and known as RXBOOT.
	* When a device booted into RXBOOT, the prompt is `router (boot)>`
	* The configuration register in this case would be set to 2101
	* `0010 0001 0000 0001`
* **2 to F**
	* Having the boot field set to a value from 2 to F indicates the IOS image that should be loaded from flash memory.
	* To boot an IOS image from flash memory, the configuration register would have a value of 2102 to 210F.
	* `0010 0001 0000 0010` - `0010 0001 0000 1111`

### Looking at the Configuration Register Value

```
R1#show version
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Fri 04-Mar-11 06:49 by prod_rel_team

ROM: ROMMON Emulation Microcode
BOOTLDR: 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)

R1 uptime is 1 minute
System returned to ROM by unknown reload cause - suspect boot_data[BOOT_COUNT] 0x0, BOOT_COUNT 0, BOOTDATA 19
System image file is "tftp://255.255.255.255/unknown"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.
          
A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
          
If you require further assistance please contact us by sending email to
export@cisco.com.
          
Cisco 7206VXR (NPE400) processor (revision A) with 491520K/32768K bytes of memory.
Processor board ID 4279256517
R7000 CPU at 150MHz, Implementation 39, Rev 2.1, 256KB L2 Cache
6 slot VXR midplane, Version 2.1
          
Last reset from power-on
          
PCI bus mb0_mb1 (Slots 0, 1, 3 and 5) has a capacity of 600 bandwidth points.
Current configuration on bus mb0_mb1 has a total of 600 bandwidth points. 
This configuration is within the PCI bus capacity and is supported. 
          
PCI bus mb2 (Slots 2, 4, 6) has a capacity of 600 bandwidth points.
Current configuration on bus mb2 has a total of 0 bandwidth points 
This configuration is within the PCI bus capacity and is supported. 
          
Please refer to the following document "Cisco 7200 Series Port Adaptor
Hardware Configuration Guidelines" on Cisco.com <http://www.cisco.com>
for c7200 bandwidth points oversubscription and usage guidelines.
          
          
3 FastEthernet interfaces
4 Serial interfaces
509K bytes of NVRAM.
          
8192K bytes of Flash internal SIMM (Sector size 256K).

// Configuration register value 확인 가능함
Configuration register is 0x2102
```

### Changing the Configuration Register from Configuration Mode

```
Router(config)# config-register 0xHEX_VALUE
```

> If you configured your router, rebooted it, and it came up with the System Configuration dialog prompt, then you either forgot to save your configuration register.

The resister value is four hexadecimal digits, or 16 bits, in length, Each bit position in the register, though, indicates a function that the bootstrap program should take. Therefore, you should be very careful when configuring this value on your router.

When entering the register value, you must always precede it with 0x, indicating that this is a hexadecimal value. If you don't do this, the router assumes the value is decimal and converts it to hexadecimal.

> default configuration register value is 0x2102, which causes a router to boot up using its default bootup process

### Changing the Configuration Register from ROM Monitor

if you don't know the passwords on the router. A second method, though, enables you to change the register value without having to log into the router. To use this method, you'll need console access to the router you can't do this from the auxiliary line or from a VTY session. Next, you'll turn off the router and then turn it back on. As the router starts booting, you'll break into ROMMON mode with the router's break sequence. To break into router, once you see the bootstrap program has loaded, you can, in most cases, use the `CTRL-BREAK` control sequence to break into ROMMON mode. Note that control sequence may differ, depending on the terminal emulation program you are using on your PC

Once you're in ROMMON mode, you can begin the process of changing the register value using one of two methods, depending on the router model that you have. Cisco devices typically use the `confreg` command to modify the configuration register from ROMMON.

```
rommon 4 > confreq 0x2142
```

```
// script mode
rommon 5 > confreq
```

### Password Recovery

The passwords are stored in your startup configuration, which is stored in NVRAM. To bypass the password you need to modify the configuration registers so taht your device boots without loading the startup configuration (ignore NVRAM). once the deivce has booted without your startup configuration, you will be able to gain access without a password and can then set the password to a new value.

To configure your Cisco device to ignore NVRAM, you will need to enable bit 6, which has a value of 4, resulting in the configuration register value of 0x2142 instead of the default 0x2012

**recover the password on Cisco device**
1. Use the `show version` command to view the current configuration register value. (default: 0x2012)
2. When power on the Cisco router, press `CTRL-BREAK` to distrupt the boot process and go into ROMMON mode. (`rommon >` prompt)
3. Type the following command to configure the device to skip startup config when booting:
	* `rommon>confreg 0x2142`
4. Reboot the router with the `reset` command
5. When the router reboots, it will not load the startup configuration and ask if you want to use the System Configuration dialog. Type `No` and press `Enter`
6. At the `router>` prompt, enter the `enable` command to get into privileged EXEC mode.
7. Use the `copy startup-config running-config` or `write` command to copy the startup configuration that was not read during bootup to be your current configuration. This is so you do not lose any settings.
8. View the configuration with the `show running-config` command.
9. Change the password by using the `enable password <newpass>` or `enable secret <new secret>` command in global configuration mode.
10. Copy that from your current configuration to your startup configuration by using the `copy running-config startup-config` command (or use the `write` command)
11. use the `config-register 0x2102` command to change the configuration registers back to the default value of 0x2102 so that NVRAM is read during bootup.
12. Reboot the router with the `reload` command

## Troubleshooting and Debugging

When troubleshooting problems from a user desktop:
1. Verify the Ethernet cable connection
2. Verify the operation of the NIC (ipconfig)
3. Verify the IP configuration of the NIC (ipconfig)
4. Verify the application information

**Troubleshooting commands**

| OSI Layer  | Command            |
| ---------- | ------------------ |
| Layer 2    | show ip arp        |
| Layer 2    | show interfaces    |
| Layer 2    | show cdp neighbors |
| Layer 3    | ping               |
| Layer 3    | traceroute         |
| Layer 7    | telent             |
| Layers 2-7 | debug              |

### Local ARP Table

Address Resolution Protocol (ARP) is used to resolve layer 3 IP address to layer 2 MAC address.

When a LAN device in a subnet needs to access resources beyond the subnet, it must forward its frames to the MAC address of the default gateway (router) and use ARP for the resoultion. The router builds a local ARP table when it receives traffic on an interface, keeping track of the IP-to-MAC address mappings.

You can view the mappings using the `show arp` or `show ip arp` command

```
R1#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  172.21.1.1             96   de93.f561.a31a  ARPA   FastEthernet0/0
Internet  172.21.1.105            -   ca01.0115.0000  ARPA   FastEthernet0/0
```

A dash (-) in the (min) column means the address is local to the router; a time value indicates that the router learned the IP/MAC addressing mapping dynamically. The last entry in this example way dynamically learned within the last minute. If a particular MAC address isn't shown for a period of time, it is aged out the ARP table. Likewise, when a frame mathes an existing entry in the table, its aging time is reset to 0 in the table. The Type column denotes the Ethernet encapsulation type (ARPA, SNAP, or SAP) used in the frame: TCP/IP uses ARPA for Ethernet.

### Cisco Discovery Protocol (CDP)

CDP is Cisco proprietary data link layer protocol that was made available in version 10.3 of the router IOS. Many, but not all, Cisco devices support CDP, including Cisco routers and Catalyst switches. For those devices that support CDP, it is enabled by default.

CDP messaged received from one Cisco device, by default, are not forwarded to any other devices behind it. In other words, you can see CDP information about only other Cisco devices directly connected to your device. Most people misunderstand this, since CDP uses multicasts to disseminate its informatioin. You would think that a Cisco switch would flood this kind of traffic; however, CDP is an exception to the rule in a network of Cisco devices.

**CDP Information**
works at the data link layer. However, since CDP uses a Subnetwork Access Protocol (SNAP) frame type, not every data link layer media type is supported. The media types that are supported are Ethernet, Token Ring, Fiber Distributed Data Interface (FDDI), Point-to-Point Protocol (PPP), High-Level Data Link Control (HDLC), Asynchronous Transfer Mode (ATM), and Frame Relay.

The information shared in a CDP packet about a Cisco device includes the following:
* Name of the device configured with the `hostname` command
* IOS software version
* Hardware capabilities, such as routing, switching, and/or bridging
* Hardware platform of your device
* The layer 3 address(es) of the device
* The interface on which the CDP update was generated

**CDP Configuration**
CDP is enabled on all Cisco CDP-capable devices when you receive your product from Cisco. On Cisco routers and switches, you can globally disable or enable CDP with this command:

```
IOS (config)# [no] cdp run
```

or enable or disable CDP on an interface-by-interface basis:

```
IOS(config)# interface type [slot_#/]port_#
IOS(config-if)# [no] cdp enable
```

Since CDP dosen't use many IOS resources (a small frame is generated once a minute), it is recommended that you keep it enabled unless your router is connected to the Internet or untrusted devices; then you should at least disable CDP on these interfaces. At a minimum, the information is only 80 bytes in length. Other, optional commands are related to CDP, such as changing the update and hold-down timers

**CDP Status**
To see the status of CDP on your Cisco device, use this command:
```
R1#show cdp
Global CDP information:
        Sending CDP packets every 60 seconds
        Sending a holdtime value of 180 seconds
        Sending CDPv2 advertisements is  enabled
R1#
```

CDP is enabled and generating updates every 60 seconds. The hold-down timer is set to 180 seconds. This timer determines how long a CDP neighbor's information is kept in the local CDP table without seeing a CDP update from that neighbor. These are the default timers for CDP.

You can also see the CDP configuration on an interface-by-interface basis by adding the interface parameter to the `show cdp` command

```
R1#show cdp interface
FastEthernet0/0 is up, line protocol is up
  Encapsulation ARPA
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
FastEthernet1/0 is administratively down, line protocol is down
  Encapsulation ARPA
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
FastEthernet1/1 is administratively down, line protocol is down
  Encapsulation ARPA
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
Serial2/0 is up, line protocol is up
  Encapsulation PPP
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
Serial2/1 is administratively down, line protocol is down
  Encapsulation HDLC
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
Serial2/2 is administratively down, line protocol is down
  Encapsulation HDLC
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
Serial2/3 is administratively down, line protocol is down
  Encapsulation HDLC
  Sending CDP packets every 60 seconds
  Holdtime is 180 seconds
R1#
```

**CDP Neighbors**
To see a summarized list of the CDP neighbors to which your Cisco device is connected, use the `show cdp neighbors` command

```
R1#show cdp neighbors
Capability Codes: R - Router, T - Trans Bridge, B - Source Route Bridge
                  S - Switch, H - Host, I - IGMP, r - Repeater

Device ID        Local Intrfce     Holdtme    Capability  Platform  Port ID
R2               Ser 2/0            177           R       7206VXR   Ser 2/0
R1#
```

In this example, one device is connected with a deivce ID of *R2* which is 7206VXR router

```
R1#show cdp neighbors detail
-------------------------
Device ID: R2
Entry address(es): 
  IP address: 192.168.13.2
Platform: Cisco 7206VXR,  Capabilities: Router 
Interface: Serial2/0,  Port ID (outgoing port): Serial2/0
Holdtime : 126 sec

Version :
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Fri 04-Mar-11 06:49 by prod_rel_team

advertisement version: 2

R1#
```

To list the details of a specific neighbor, use this command:

```

R1#show cdp entry R2
-------------------------
Device ID: R2
Entry address(es): 
  IP address: 192.168.13.2
Platform: Cisco 7206VXR,  Capabilities: Router 
Interface: Serial2/0,  Port ID (outgoing port): Serial2/0
Holdtime : 160 sec

Version :
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Fri 04-Mar-11 06:49 by prod_rel_team

advertisement version: 2

R1#
```

view CDP traffic statistics:
```
R1#show cdp traffic
CDP counters :
        Total packets output: 500, Input: 251
        Hdr syntax: 0, Chksum error: 0, Encaps failed: 0
        No memory: 0, Invalid packet: 0, Fragmented: 0
        CDP version 1 advertisements output: 0, Input: 0
        CDP version 2 advertisements output: 500, Input: 251
R1#
```

### Using LLDP

One of the drawbacks of CDP is that it is a Cisco proprietary protocol. If you had a mixed environment of Cisco devices and non-Cisco devices, CDP would not be able to discover the non-Cisco devices for you.

The IEEE has created an industry-standard protocol for device discovery, the *Link Layer Discover Protocol(LLDP)*, which is known as the IEEE 802.1ab standard.

With LLDP running on your Cisco devices, you can use it to discover any other devices running LLDP, much like CDP. LLDP is not enabled on Cisco devices by default, but it can be enabled with the following command:
```
Router(config)#lldp run
```

Once enabled, LLDP is enabled for all interfaces. You can disable LLDP with the `no lldp run` global configuration command. If you wanted to disable LLDP on a specific interface, you can navigate to the interface and disable transmitting and receiving of LLDP on the interface

```
Router(config-if)#no lldp transmit
Router(config-if)#no lldp receive
```

verify that LLDP is running on your Cisco device by using the `show lldp` command.

```
Router#show lldp
Global LLDP information:
	status: Active
	LLDP advertisements are sent every 30 seconds
	LLDP hold time advertised is 120 seconds
	LLDP interface reinitialisation delay is 2 seconds
```

### Layer 3 Connectivity Testing

CDP can be very useful in determining whether the data link layer is working correctly with another directlry connected Cisco device, or it is commonly used to create a network map by discovering the different devices on the network. You can even see the layer 3 address(es) configured on your neighboring device and use this for testing layer 3 connectivity.

you could also use the `show interfaces` command (or `show interfaces brief`) for data link layer testing.

The main limitation of these two tools, however, is that they don't test layer 3 problems, though Cisco does offer tools for testing layer 3 connectivity (`ping`, `traceroute`)

**Using Ping**
Ping (Packet Internet Groper) is command utility that you can use to verify layer 3 connectivity on a Cisco device. Ping uses ICMP as the status reporting protocol to identify whether or not a system is up and running.

You can use the `ping` command on your Cisco device by typing `ping <ip_address>`.

* **Destination host unreachable**
	* The router connected to the remote host cannot contact that host on the connected segment
* **Destination network unreachable**
	* A router between the source and destination doesn't have a routing table entry that determines how to reach the destination

When using the `ping` command to perform the communication test,

if the destination is reachable, the destination responds with an echo reply message for each echo sent by the source.

If the destination is not reachable, an intermediate router, if it exists, will respond with a destination network unreachable message, indicting where the problem begins.

If a router is connected to the remote segment where the destination host is connected to the remote segment where the destination host is connected, and that router can't reach the destination host, this will cause a "desination host unreachable" message. Also not that you may not receive a reply if ICMP is being blocked by a firewall.

**Simple ping Command**
To execute a simple `ping` from either user EXEC mode or privileged EXEC mode, enter the `ping` command on the CLI and follow it with the IP address or hostname of the destination:
```
IOS> ping destination_IP_address_or_host_name

R1#ping 172.30.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.30.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/8/12 ms
R1#
```


| Ping Output | Explanation                                                                                                       |
| ----------- | ----------------------------------------------------------------------------------------------------------------- |
| .           | A response was not received before the timeout period expired.                                                    |
| !           | A response was received within the timeout period.                                                                |
| U           | A remote router responded that the destination is unreachable. the network segment is reachable, but not the host |
| N           | A remote device responded that the protocol is not supported                                                      |
| P           | A remote device responded that the protocol is not supported                                                      |
| Q           | The source quench tells the source to slow its output                                                             |
| M           | The ping packet needed to be fragmented, but a remote router couldn't perform fragmentation.                      |
| A           | The ping packet was filtered by a device with an access control list (administratively prohibited).               |
| ?           | The ping packet type is not understood by a remote device.                                                        |
| &           | The ping exceeded the maximum number of hops supported by the routing protocol.                                   |

**Extended ping Command**

```
R1#ping
Protocol [ip]: 
Target IP address: 172.30.1.1
Repeat count [5]: 
Datagram size [100]: 
Timeout in seconds [2]: 
Extended commands [n]: y
Source address or interface: 
Type of service [0]: 
Set DF bit in IP header? [no]: 
Validate reply data? [no]: 
Data pattern [0xABCD]: 
Loose, Strict, Record, Timestamp, Verbose[none]: 
Sweep range of sizes [n]: 
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.30.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 4/11/24 ms
R1#
```

* **Protocol
	* The protocol to use for the ping (defaults to IP).
* **Target IP address**
	* The IP address or hostname of the destination to test
* **Repeat count**
	* How many echo requests should be generated for the test
* **Datagram size**
	* The size, in bytes, of the ping packet (defaults to 100).
* **Timeout in seconds**
	* The amount of time to wait before indicating a timeout for the echo (defaults to 2 seconds).
	* When seeing a mix of periods and explanation points (!) in the displayed output, increasing this value can help determine whether you are experiencing congestion problems with a slow response time between your IOS device and the destination.
* **Extended commands**
	* Whether or not the remaining questions should also be asked (defaults to no)
* **Source address**
	* The IP address that should appear as the source address in the IP header (defaults to the IP address of the interface the pint will use to exit the IOS device).
* **Type of service**
	* The IP lever for QoS (defaults to 0)
* **Set DF bit in IP header?**
	* Wheter or not the ping can be fragmented when it reaches a segment that supports a smaller MTU size (the default is no)
	* Somethimes a misconfigured MTU can cause performance problems. You can use this parameter to pinpoint the problem, since a device with a smaller MTU size will not be able to handle the larger packet.
* **Data pattern**
	* The data pattern that is placed in the ping.
	* It is a hexadecimal four-digit (16-bit) number (defaults to 0xABCD) and is used to solve cable problems and crosstalk on cables.
* **Loose, Strict, Record, Timestamp, Verbose**
	* IP header options (defaults to none of these).
	* The record parameter recrodss the router that the ping took this is somewhat similar to traceroute.
	* if you choose record, you will be asked for the maximum number of hops that are allowed to be recroded by the ping (defaults to 9, and can range from 1 to 9).
* **Sweep range of sizes**
	* Send pings that vary in size.
	* This is helpful when trying to troubleshoot a problem related to a segment that has a small MTU size (and you don't know what that number is).
	* This defaults to n for no.

> When troubleshooting PC problems, first determine whether the user can ping the loopback address of their PC: `ping 127.0.0.1` If this fails, you know something is wrong with the TCP/IP protocol stack installation on the PC.
> 
> Next, have the user try to ping the configured IP address. If this failes, you know that something is wrong with their IP address configuration.
> 
> Next, have the user ping the default gateway. If this fails, either something is wrong with the configured default gateway address, the default gateway itself, the subnet mask value configured on the user's PC, or the layer 2 switch connecting them together

#### Using Traceroute

One limitation of `ping` is that it will not tell your where, between you and the destination, layer 3 connectivity is broken. The `traceroute` command, on the other hand, will list each router along the way, including the final destination. Therefore, if a layer 3 connection problem exists, `traceroute` will tell you at least where the problem begins. Like the `ping` command, `traceroute` has two versions: one for user EXEC mode and one for privileged EXEC mode.

#### Simple traceroute Command

The simple `traceroute` command, which works at both user and privileged EXEC modes:

```
R1#traceroute 172.30.1.1

Type escape sequence to abort.
Tracing the route to 172.30.1.1

  1 172.30.1.1 20 msec 12 msec 4 msec
R1#

R1#traceroute 192.168.13.2

Type escape sequence to abort.
Tracing the route to 192.168.13.2

  1 192.168.13.2 76 msec 12 msec 24 msec
R1#
```

```
Router > traceroute 65.32.13.33

1. 10.98.240.1 20 mesc 24 mesc 16 msec
2. 65.32.15.254 16 mesc 16 mesc 12 mesc
3. 65.32.13.33 12 mesc 12 mesc 12 mesc
```

In this example, the destination was three hops away each hop is listed on a separate line. For each destination, three tests are performed, where the round-trip time is displayed for each test. If you don't see a round-trip time, typically indicated by an asterisk, this indicates a possible problem or timeout in the response (for example, if ICMP is blocked at the firewall).

**other values instead of the round-trip time**

| traceroute Output | Expanation                                                                                                                                              |
| ----------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------- |
| *                 | Either the wait timer expired while waiting for a response or the device did not respond at all potentially because of a firewall blocking ICMP traffic |
| A                 | The trace packet was filtered by a remote device (administratively prohibited).                                                                         |
| U                 | The port of the device is unreacheable (the destination received the trace packet but discard it).                                                      |
| H                 | The destination is unreachable (the destination segment was reachable, but not the host).                                                               |
| I                 | The user interrupted the traceroute process                                                                                                             |
| N                 | The network is unreachable (the destination segment was not reachable).                                                                                 |
| P                 | The protocol is unreachable (the device doesn't support traceroute)                                                                                     |
| Q                 | The source quench tells the source to slow its output.                                                                                                  |
| T                 | The trace packet exceeded the configured timeout value                                                                                                  |
| ?                 | The device couldn't identify the specific trace types in the trace packet                                                                               |

In certain cases, for a specific destination, you might see three asterisks(`***`) in the output. since it can occur for a variety of reasons: for instance, there may be an inconsistency in how the source and destination devices have implemented traceroute, or the destination may be configured not to reply to these messages. However, if you continually find the same destination repeaged in the output with these replay messages, this indicates a layer 3 problem starting with either these device or the device preceding it.

> if you have DNS lookups enabled on your IOS device (this is the `ip-domain-lookup` command), IOS will attempt to resolve the IP address to a domain name before printing the output line for that device. If your traces seem totake a long time, DNS lookups is usually the culprit. You can disable DNS lookups on your IOS device with the `no ip domain-lookup` command

#### Extended traceroute Command

```
R1#traceroute
Protocol [ip]: 
Target IP address: 172.30.1.1
Source address: 
Numeric display [n]: 
Timeout in seconds [3]: 
Probe count [3]: 
Minimum Time to Live [1]: 
Maximum Time to Live [30]: 
Port Number [33434]: 
Loose, Strict, Record, Timestamp, Verbose[none]: 
Type escape sequence to abort.
Tracing the route to 172.30.1.1

  1 172.30.1.1 12 msec 8 msec 12 msec
R1#
```

* **Time to Live**
	* Specifies how many hops the trace is allowed to take
* **Loose**
	* Tells the router that the hops you specify must appear in the trace path, but other routers can appear as well
* **Strict**
	* Restricts the trace path only to those routers that you specify
* **Record**
	* Specifies the number of hops to leave room for in the trace packet
* **Timestamp**
	* Enables you to specify the amount of space to leave room for in the trace packet for timing information
* **Verbose**
	* Automatically selected whenever you choose any of the option from this question; prints the entire contents of the trace packet

if more than one path exists to reach to destination, this command will test each path, which can take the trace process longer. And like the extended `ping` command, instead of using the script to perform the test, you can enter the command and all of its parameters on a single command line.

> `ping` command uses ICMP to test layer 3 connectivity to a device.
> `traceroute` command lists each routing device along the way to the destination (a list of the layer 3 hops) and is typically used to troubleshoot routing problems.

### Layer7 Connectivity Testing

The `ping` and `traceroute` commands can test only layer 3 connectivity. If you can reach a destination with either of these two commands, this indicates that layer 3 and below are functioning correctly. You can use other tools, such as `telnet`, to test the application layer. If you can telnet to a destination, then all seven layers of the OSI model are functioning correctly.

As an example, if you can telnet to a machine but can't send an e-mail to it, then the problem is not a networking problem, but an application problem (with the e-mail program). if you are filtering traffic with an access control list, this could also be the culprit.

> To test `telnet`, the remote destination must have telnet configured and enabled.
> If the remote device is an IOS device, you must minimally configure the `login` and `password` commands on the VTYs

### Debug Overview

One problem with using `show` commands is that they display only what is currently stored somewhere in the router's RAM, and this display is static.

And `show` commands, unfortunately, do not always display detailed troubleshooting information. For example, perhaps you want the router to tell you when a particular event occurs and display some of the packet contentes of that event. The `show` commands cannot do this; however `debug` commands can.

One of the most powerful troubleshooting tools of IOS is the `debug` command, which enables you to view events and problems, in real time.

The `debug` commands, however, have a drawback: Since the router has to examine and display many different things when this feature is enabled, the performance of IOS will suffer As an example, if you want to see every IP packet that travels through a router, the router has to examine each packet, determine whether it is an IP packet,  and then display the packet or partial packet contents on the screen. On a very busy router, this debug process can cause serious performance degradation.
Therefore, you should be very careful about enabeling a debug process on your router; you may want to wait till after hours or periods of lesser activity before using this tool.

> you should never use the debug all command this enables debugging for every process related to IOS features enabeld on your router. In this situation, you'll see pages and pages of output messages on all kinds of things and, on a busy IOS device, probably crash it.

Typically, you will use `debug` commands for detailed troubleshooting. For instance, you may have tried using `show` commands to descover the cause of a particular problem, but without any success. You should then turn to using a particular `debug` command to uncover the source of the problem.

This command has many, many options and parameters use context-sensitive help to view them. To enable `debug` you must be at privileged EXEC mode. If you are not on the console when enabling `debug`, you'll also need to execute the privileged EXEC `terminanl monitor` command to see the `debug` output on your non-conole line.

Once you've fixed your problem or no longer need to see the `debug` output, you should always disable the `debug` process

```
IOS# no debug all

or

IOS# undebug all
```

These two commands disable all running `debug` commands on your router. You can first use the `show debug` command to see which events or processes you have enables.

If you want to see timestamps displayed in your debug output, enter the following command:
```
Rotuer(config)# service timestamps debug datetime msec
```

the `datetime` parameter displays the current date and time, and the `msec` parameter displays an additional timing parameter: millisends

## Licensing Cisco Devices

Cisco now has only four image types:
1. IP Base
2. Data (MPLS and ATM)
3. Unified Communications (VoIP and IP telephony)
4. Security (firewall, IPS, and VPNs)

You can use the `show license feature` command to view the technology package licenses and the feature licenses supported by your router.

![[Pasted image 20250517203114.png]]

Licensing is enforced starting with Cisco ISR G2 routers (1900, 2900, and 3900 series). Licensing unlocks features in IOS code. Licenses com in two types:
* **Evaluation**
	* This license is a temporary license that is valid for a particular period of time, such as 60 days or one year.
* **Permanent**
	* This license is valid for the life of the product

Licenses are associated with two values from a Cisco ISR G2 router, referred to as a universal device identifier (UDI):
* Product ID (platform type)
* Serial number (located in ROM on the motherboard)

The importance of the UDI is that the license you obtain from Cisco is tied to this value. In other words, you can't take a license from one router and copy it to another router: the license is tied to the UDI value of your Cisco ISR G2 router.

![[Pasted image 20250517203451.png]]

Use the `show license feature` command to view the package and feature licenses installed on your router.

### Installing Licenses

Your router comes with an evaluation license, also known as a temporary licesne, for most packages and features supported on your router. If you want to try a new software pacakge or feature, you can activate the evaluation license for that pacakage or feature

To install a permanent license, use the following prvileged EXEC command:
```
Router# license install URL-location
```

The license file is an XML file that you download from Cisco. Typically you would place this in flash on the router, but you could pull it from a remote server via TFTP or FTP.

![[Pasted image 20250517212047.png]]

Once you've installed a license, it is not used until the router is rebooted. You can execute the `reload` command to reboot the router.

To activate an evaluation license to try out technology packages, use this command:
```
Router(config)# license boot module module_name technology-package package_name
```

The `module_name` is the product model, such as c3900 for 3950 router. The technology `package_name` is one of the four packages. For example, the Security pacakge parameter is `securityk9`. As with a permanent license, you must reboot the router for the license to take effect.

### Licensing Verification

One of the first commands you can use to verify your licensing is the `show version` command.

```
R1#show version
Cisco IOS Software, 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Fri 04-Mar-11 06:49 by prod_rel_team

ROM: ROMMON Emulation Microcode
BOOTLDR: 7200 Software (C7200-ADVENTERPRISEK9-M), Version 12.4(24)T5, RELEASE SOFTWARE (fc3)

R1 uptime is 18 hours, 43 minutes
System returned to ROM by unknown reload cause - suspect boot_data[BOOT_COUNT] 0x0, BOOT_COUNT 0, BOOTDATA 19
System image file is "tftp://255.255.255.255/unknown"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.
          
A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
          
If you require further assistance please contact us by sending email to
export@cisco.com.
          
Cisco 7206VXR (NPE400) processor (revision A) with 491520K/32768K bytes of memory.
Processor board ID 4279256517
R7000 CPU at 150MHz, Implementation 39, Rev 2.1, 256KB L2 Cache
6 slot VXR midplane, Version 2.1
          
Last reset from power-on
          
PCI bus mb0_mb1 (Slots 0, 1, 3 and 5) has a capacity of 600 bandwidth points.
Current configuration on bus mb0_mb1 has a total of 600 bandwidth points. 
This configuration is within the PCI bus capacity and is supported. 
          
PCI bus mb2 (Slots 2, 4, 6) has a capacity of 600 bandwidth points.
Current configuration on bus mb2 has a total of 0 bandwidth points 
This configuration is within the PCI bus capacity and is supported. 
          
Please refer to the following document "Cisco 7200 Series Port Adaptor
Hardware Configuration Guidelines" on Cisco.com <http://www.cisco.com>
for c7200 bandwidth points oversubscription and usage guidelines.
          
          
3 FastEthernet interfaces
4 Serial interfaces
509K bytes of NVRAM.
          
8192K bytes of Flash internal SIMM (Sector size 256K).
Configuration register is 0x2102
```

![[Pasted image 20250517212526.png]]

You can also use the `show license` command to view the installed license
![[Pasted image 20250517212547.png]]

### Managing Licenses

how to back up your license as well as how to uninstall a license. To back up a license, use the `license save` command

```
Router# license save URL
```

You can save the license file to the local file system or a remote server.

```
Router# license save flash:/licenses.lic
```

To uninstall (remove) a license from a router, you need to perform two actions:

1. Disable the technology package.
2. Clear the license

To disable the technology package, use the `license boot module` command.
![[Pasted image 20250517212851.png]]

Once the router has rebooted, you need to clear the license with the `license clear` command.
![[Pasted image 20250517212941.png]]

Once done, you can re-enable the technology package:
![[Pasted image 20250517213006.png]]

Upon rebooting, use the `show version` command to verify the license change.